bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h

/*
 * Copyright (c) 2020 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */


#ifndef _REG_MAC_CORE_H_
#define _REG_MAC_CORE_H_

#include <stdint.h>
#include "ipc_compat.h"
#include "lmac_types.h"
#include "reg_access.h"

#define REG_MAC_CORE_COUNT 344

#define REG_MAC_CORE_DECODING_MASK 0x000007FF

/**
 * @brief SIGNATURE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            signature   0x0
 * </pre>
 */
#define NXMAC_SIGNATURE_ADDR   0x60B00000
#define NXMAC_SIGNATURE_OFFSET 0x00000000
#define NXMAC_SIGNATURE_INDEX  0x00000000
#define NXMAC_SIGNATURE_RESET  0x00000000

static inline uint32_t blmac_signature_get(void)
{
    return REG_PL_RD(NXMAC_SIGNATURE_ADDR);
}

// field definitions
#define NXMAC_SIGNATURE_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_SIGNATURE_LSB    0
#define NXMAC_SIGNATURE_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_SIGNATURE_RST    0x0

static inline uint32_t blmac_signature_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_SIGNATURE_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief VERSION_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     16     mac80211MHFormat   0
 *     14                 coex   0
 *     13                 wapi   0
 *     12                  tpc   1
 *     11                  vht   1
 *     10                   ht   1
 *     08                  rce   0
 *     07                 ccmp   0
 *     06                 tkip   0
 *     05                  wep   0
 *     04             security   0
 *     03                  sme   0
 *     02                 hcca   0
 *     01                 edca   1
 *     00                  qos   1
 * </pre>
 */
#define NXMAC_VERSION_1_ADDR   0x60B00004
#define NXMAC_VERSION_1_OFFSET 0x00000004
#define NXMAC_VERSION_1_INDEX  0x00000001
#define NXMAC_VERSION_1_RESET  0x00001C03

static inline uint32_t blmac_version_1_get(void)
{
    return REG_PL_RD(NXMAC_VERSION_1_ADDR);
}

// field definitions
#define NXMAC_MU_MIMO_TX_BIT            ((uint32_t)0x00080000)
#define NXMAC_MU_MIMO_TX_POS            19
#define NXMAC_BFMER_BIT                 ((uint32_t)0x00040000)
#define NXMAC_BFMER_POS                 18
#define NXMAC_BFMEE_BIT                 ((uint32_t)0x00020000)
#define NXMAC_BFMEE_POS                 17
#define NXMAC_MAC_80211MH_FORMAT_BIT    ((uint32_t)0x00010000)
#define NXMAC_MAC_80211MH_FORMAT_POS    16
#define NXMAC_COEX_BIT                  ((uint32_t)0x00004000)
#define NXMAC_COEX_POS                  14
#define NXMAC_WAPI_BIT                  ((uint32_t)0x00002000)
#define NXMAC_WAPI_POS                  13
#define NXMAC_TPC_BIT                   ((uint32_t)0x00001000)
#define NXMAC_TPC_POS                   12
#define NXMAC_VHT_BIT                   ((uint32_t)0x00000800)
#define NXMAC_VHT_POS                   11
#define NXMAC_HT_BIT                    ((uint32_t)0x00000400)
#define NXMAC_HT_POS                    10
#define NXMAC_RCE_BIT                   ((uint32_t)0x00000100)
#define NXMAC_RCE_POS                   8
#define NXMAC_CCMP_BIT                  ((uint32_t)0x00000080)
#define NXMAC_CCMP_POS                  7
#define NXMAC_TKIP_BIT                  ((uint32_t)0x00000040)
#define NXMAC_TKIP_POS                  6
#define NXMAC_WEP_BIT                   ((uint32_t)0x00000020)
#define NXMAC_WEP_POS                   5
#define NXMAC_SECURITY_BIT              ((uint32_t)0x00000010)
#define NXMAC_SECURITY_POS              4
#define NXMAC_SME_BIT                   ((uint32_t)0x00000008)
#define NXMAC_SME_POS                   3
#define NXMAC_HCCA_BIT                  ((uint32_t)0x00000004)
#define NXMAC_HCCA_POS                  2
#define NXMAC_EDCA_BIT                  ((uint32_t)0x00000002)
#define NXMAC_EDCA_POS                  1
#define NXMAC_QOS_BIT                   ((uint32_t)0x00000001)
#define NXMAC_QOS_POS                   0

#define NXMAC_MAC_80211MH_FORMAT_RST    0x0
#define NXMAC_COEX_RST                  0x0
#define NXMAC_WAPI_RST                  0x0
#define NXMAC_TPC_RST                   0x1
#define NXMAC_VHT_RST                   0x1
#define NXMAC_HT_RST                    0x1
#define NXMAC_RCE_RST                   0x0
#define NXMAC_CCMP_RST                  0x0
#define NXMAC_TKIP_RST                  0x0
#define NXMAC_WEP_RST                   0x0
#define NXMAC_SECURITY_RST              0x0
#define NXMAC_SME_RST                   0x0
#define NXMAC_HCCA_RST                  0x0
#define NXMAC_EDCA_RST                  0x1
#define NXMAC_QOS_RST                   0x1

