bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_version_1_unpack(uint8_t* mac80211mhformat, uint8_t* coex, uint8_t* wapi, uint8_t* tpc, uint8_t* vht, uint8_t* ht, uint8_t* rce, uint8_t* ccmp, uint8_t* tkip, uint8_t* wep, uint8_t* security, uint8_t* sme, uint8_t* hcca, uint8_t* edca, uint8_t* qos)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);

    *mac80211mhformat = (localVal & ((uint32_t)0x00010000)) >> 16;
    *coex = (localVal & ((uint32_t)0x00004000)) >> 14;
    *wapi = (localVal & ((uint32_t)0x00002000)) >> 13;
    *tpc = (localVal & ((uint32_t)0x00001000)) >> 12;
    *vht = (localVal & ((uint32_t)0x00000800)) >> 11;
    *ht = (localVal & ((uint32_t)0x00000400)) >> 10;
    *rce = (localVal & ((uint32_t)0x00000100)) >> 8;
    *ccmp = (localVal & ((uint32_t)0x00000080)) >> 7;
    *tkip = (localVal & ((uint32_t)0x00000040)) >> 6;
    *wep = (localVal & ((uint32_t)0x00000020)) >> 5;
    *security = (localVal & ((uint32_t)0x00000010)) >> 4;
    *sme = (localVal & ((uint32_t)0x00000008)) >> 3;
    *hcca = (localVal & ((uint32_t)0x00000004)) >> 2;
    *edca = (localVal & ((uint32_t)0x00000002)) >> 1;
    *qos = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_mac_80211mh_format_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

static inline uint8_t blmac_coex_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

static inline uint8_t blmac_wapi_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

static inline uint8_t blmac_tpc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

static inline uint8_t blmac_vht_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

static inline uint8_t blmac_ht_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

static inline uint8_t blmac_rce_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

static inline uint8_t blmac_ccmp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

static inline uint8_t blmac_tkip_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

static inline uint8_t blmac_wep_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

static inline uint8_t blmac_security_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

static inline uint8_t blmac_sme_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline uint8_t blmac_hcca_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

static inline uint8_t blmac_edca_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline uint8_t blmac_qos_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_1_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief VERSION_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  16:14          phaseNumber   0x0
 *  13:08        releaseNumber   0x0
 *     07            ieRelease   0
 *  06:00            umVersion   0x0
 * </pre>
 */
#define NXMAC_VERSION_2_ADDR   0x60B00008
#define NXMAC_VERSION_2_OFFSET 0x00000008
#define NXMAC_VERSION_2_INDEX  0x00000002
#define NXMAC_VERSION_2_RESET  0x00000000

static inline uint32_t blmac_version_2_get(void)
{
    return REG_PL_RD(NXMAC_VERSION_2_ADDR);
}

// field definitions
#define NXMAC_PHASE_NUMBER_MASK     ((uint32_t)0x0001C000)
#define NXMAC_PHASE_NUMBER_LSB      14
#define NXMAC_PHASE_NUMBER_WIDTH    ((uint32_t)0x00000003)
#define NXMAC_RELEASE_NUMBER_MASK   ((uint32_t)0x00003F00)
#define NXMAC_RELEASE_NUMBER_LSB    8
#define NXMAC_RELEASE_NUMBER_WIDTH  ((uint32_t)0x00000006)
#define NXMAC_IE_RELEASE_BIT        ((uint32_t)0x00000080)
#define NXMAC_IE_RELEASE_POS        7
#define NXMAC_UM_VERSION_MASK       ((uint32_t)0x0000007F)
#define NXMAC_UM_VERSION_LSB        0
#define NXMAC_UM_VERSION_WIDTH      ((uint32_t)0x00000007)

#define NXMAC_PHASE_NUMBER_RST      0x0
#define NXMAC_RELEASE_NUMBER_RST    0x0
#define NXMAC_IE_RELEASE_RST        0x0
#define NXMAC_UM_VERSION_RST        0x0

static inline void blmac_version_2_unpack(uint8_t* phasenumber, uint8_t* releasenumber, uint8_t* ierelease, uint8_t* umversion)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_2_ADDR);

    *phasenumber = (localVal & ((uint32_t)0x0001C000)) >> 14;
    *releasenumber = (localVal & ((uint32_t)0x00003F00)) >> 8;
    *ierelease = (localVal & ((uint32_t)0x00000080)) >> 7;
    *umversion = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

static inline uint8_t blmac_phase_number_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_2_ADDR);
    return ((localVal & ((uint32_t)0x0001C000)) >> 14);
}

static inline uint8_t blmac_release_number_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_2_ADDR);
    return ((localVal & ((uint32_t)0x00003F00)) >> 8);
}

static inline uint8_t blmac_ie_release_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_2_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

static inline uint8_t blmac_um_version_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VERSION_2_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

/**
 * @brief BITMAP_CNT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00            bitmapCnt   0x0
 * </pre>
 */
#define NXMAC_BITMAP_CNT_ADDR   0x60B0000C
#define NXMAC_BITMAP_CNT_OFFSET 0x0000000C
#define NXMAC_BITMAP_CNT_INDEX  0x00000003
#define NXMAC_BITMAP_CNT_RESET  0x00000000

static inline uint32_t blmac_bitmap_cnt_get(void)
{
    return REG_PL_RD(NXMAC_BITMAP_CNT_ADDR);
}

