bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_BITMAP_CNT_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_BITMAP_CNT_LSB    0
#define NXMAC_BITMAP_CNT_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_BITMAP_CNT_RST    0x0

static inline uint16_t blmac_bitmap_cnt_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BITMAP_CNT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief MAC_ADDR_LOW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00           macAddrLow   0x0
 * </pre>
 */
#define NXMAC_MAC_ADDR_LOW_ADDR   0x60B00010
#define NXMAC_MAC_ADDR_LOW_OFFSET 0x00000010
#define NXMAC_MAC_ADDR_LOW_INDEX  0x00000004
#define NXMAC_MAC_ADDR_LOW_RESET  0x00000000

static inline uint32_t blmac_mac_addr_low_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ADDR_LOW_ADDR);
}

static inline void blmac_mac_addr_low_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ADDR_LOW_ADDR, value);
}

// field definitions
#define NXMAC_MAC_ADDR_LOW_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_MAC_ADDR_LOW_LSB    0
#define NXMAC_MAC_ADDR_LOW_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_MAC_ADDR_LOW_RST    0x0

static inline uint32_t blmac_mac_addr_low_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ADDR_LOW_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_mac_addr_low_setf(uint32_t macaddrlow)
{
    ASSERT_ERR((((uint32_t)macaddrlow << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_MAC_ADDR_LOW_ADDR, (uint32_t)macaddrlow << 0);
}

/**
 * @brief MAC_ADDR_HI register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00          macAddrHigh   0x0
 * </pre>
 */
#define NXMAC_MAC_ADDR_HI_ADDR   0x60B00014
#define NXMAC_MAC_ADDR_HI_OFFSET 0x00000014
#define NXMAC_MAC_ADDR_HI_INDEX  0x00000005
#define NXMAC_MAC_ADDR_HI_RESET  0x00000000

static inline uint32_t blmac_mac_addr_hi_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ADDR_HI_ADDR);
}

static inline void blmac_mac_addr_hi_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ADDR_HI_ADDR, value);
}

// field definitions
#define NXMAC_MAC_ADDR_HIGH_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_MAC_ADDR_HIGH_LSB    0
#define NXMAC_MAC_ADDR_HIGH_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_MAC_ADDR_HIGH_RST    0x0

static inline uint16_t blmac_mac_addr_high_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ADDR_HI_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_mac_addr_high_setf(uint16_t macaddrhigh)
{
    ASSERT_ERR((((uint32_t)macaddrhigh << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_MAC_ADDR_HI_ADDR, (uint32_t)macaddrhigh << 0);
}

/**
 * @brief MAC_ADDR_LOW_MASK register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00       macAddrLowMask   0x0
 * </pre>
 */
#define NXMAC_MAC_ADDR_LOW_MASK_ADDR   0x60B00018
#define NXMAC_MAC_ADDR_LOW_MASK_OFFSET 0x00000018
#define NXMAC_MAC_ADDR_LOW_MASK_INDEX  0x00000006
#define NXMAC_MAC_ADDR_LOW_MASK_RESET  0x00000000

static inline uint32_t blmac_mac_addr_low_mask_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ADDR_LOW_MASK_ADDR);
}

static inline void blmac_mac_addr_low_mask_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ADDR_LOW_MASK_ADDR, value);
}

// field definitions
#define NXMAC_MAC_ADDR_LOW_MASK_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_MAC_ADDR_LOW_MASK_LSB    0
#define NXMAC_MAC_ADDR_LOW_MASK_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_MAC_ADDR_LOW_MASK_RST    0x0

static inline uint32_t blmac_mac_addr_low_mask_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ADDR_LOW_MASK_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_mac_addr_low_mask_setf(uint32_t macaddrlowmask)
{
    ASSERT_ERR((((uint32_t)macaddrlowmask << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_MAC_ADDR_LOW_MASK_ADDR, (uint32_t)macaddrlowmask << 0);
}

/**
 * @brief MAC_ADDR_HI_MASK register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00      macAddrHighMask   0x0
 * </pre>
 */
#define NXMAC_MAC_ADDR_HI_MASK_ADDR   0x60B0001C
#define NXMAC_MAC_ADDR_HI_MASK_OFFSET 0x0000001C
#define NXMAC_MAC_ADDR_HI_MASK_INDEX  0x00000007
#define NXMAC_MAC_ADDR_HI_MASK_RESET  0x00000000

static inline uint32_t blmac_mac_addr_hi_mask_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ADDR_HI_MASK_ADDR);
}

static inline void blmac_mac_addr_hi_mask_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ADDR_HI_MASK_ADDR, value);
}

// field definitions
#define NXMAC_MAC_ADDR_HIGH_MASK_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_MAC_ADDR_HIGH_MASK_LSB    0
#define NXMAC_MAC_ADDR_HIGH_MASK_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_MAC_ADDR_HIGH_MASK_RST    0x0

static inline uint16_t blmac_mac_addr_high_mask_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ADDR_HI_MASK_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_mac_addr_high_mask_setf(uint16_t macaddrhighmask)
{
    ASSERT_ERR((((uint32_t)macaddrhighmask << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_MAC_ADDR_HI_MASK_ADDR, (uint32_t)macaddrhighmask << 0);
}

/**
 * @brief BSS_ID_LOW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             bssIDLow   0x0
 * </pre>
 */
#define NXMAC_BSS_ID_LOW_ADDR   0x60B00020
#define NXMAC_BSS_ID_LOW_OFFSET 0x00000020
#define NXMAC_BSS_ID_LOW_INDEX  0x00000008
#define NXMAC_BSS_ID_LOW_RESET  0x00000000

static inline uint32_t blmac_bss_id_low_get(void)
{
    return REG_PL_RD(NXMAC_BSS_ID_LOW_ADDR);
}

static inline void blmac_bss_id_low_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BSS_ID_LOW_ADDR, value);
}

