bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_BSS_ID_LOW_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_BSS_ID_LOW_LSB    0
#define NXMAC_BSS_ID_LOW_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_BSS_ID_LOW_RST    0x0

static inline uint32_t blmac_bss_id_low_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BSS_ID_LOW_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_bss_id_low_setf(uint32_t bssidlow)
{
    ASSERT_ERR((((uint32_t)bssidlow << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_BSS_ID_LOW_ADDR, (uint32_t)bssidlow << 0);
}

/**
 * @brief BSS_ID_HI register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00            bssIDHigh   0x0
 * </pre>
 */
#define NXMAC_BSS_ID_HI_ADDR   0x60B00024
#define NXMAC_BSS_ID_HI_OFFSET 0x00000024
#define NXMAC_BSS_ID_HI_INDEX  0x00000009
#define NXMAC_BSS_ID_HI_RESET  0x00000000

static inline uint32_t blmac_bss_id_hi_get(void)
{
    return REG_PL_RD(NXMAC_BSS_ID_HI_ADDR);
}

static inline void blmac_bss_id_hi_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BSS_ID_HI_ADDR, value);
}

// field definitions
#define NXMAC_BSS_ID_HIGH_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_BSS_ID_HIGH_LSB    0
#define NXMAC_BSS_ID_HIGH_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_BSS_ID_HIGH_RST    0x0

static inline uint16_t blmac_bss_id_high_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BSS_ID_HI_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_bss_id_high_setf(uint16_t bssidhigh)
{
    ASSERT_ERR((((uint32_t)bssidhigh << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_BSS_ID_HI_ADDR, (uint32_t)bssidhigh << 0);
}

/**
 * @brief BSS_ID_LOW_MASK register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00         bssIDLowMask   0x0
 * </pre>
 */
#define NXMAC_BSS_ID_LOW_MASK_ADDR   0x60B00028
#define NXMAC_BSS_ID_LOW_MASK_OFFSET 0x00000028
#define NXMAC_BSS_ID_LOW_MASK_INDEX  0x0000000A
#define NXMAC_BSS_ID_LOW_MASK_RESET  0x00000000

static inline uint32_t blmac_bss_id_low_mask_get(void)
{
    return REG_PL_RD(NXMAC_BSS_ID_LOW_MASK_ADDR);
}

static inline void blmac_bss_id_low_mask_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BSS_ID_LOW_MASK_ADDR, value);
}

// field definitions
#define NXMAC_BSS_ID_LOW_MASK_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_BSS_ID_LOW_MASK_LSB    0
#define NXMAC_BSS_ID_LOW_MASK_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_BSS_ID_LOW_MASK_RST    0x0

static inline uint32_t blmac_bss_id_low_mask_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BSS_ID_LOW_MASK_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_bss_id_low_mask_setf(uint32_t bssidlowmask)
{
    ASSERT_ERR((((uint32_t)bssidlowmask << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_BSS_ID_LOW_MASK_ADDR, (uint32_t)bssidlowmask << 0);
}

/**
 * @brief BSS_ID_HI_MASK register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00        bssIDHighMask   0x0
 * </pre>
 */
#define NXMAC_BSS_ID_HI_MASK_ADDR   0x60B0002C
#define NXMAC_BSS_ID_HI_MASK_OFFSET 0x0000002C
#define NXMAC_BSS_ID_HI_MASK_INDEX  0x0000000B
#define NXMAC_BSS_ID_HI_MASK_RESET  0x00000000

static inline uint32_t blmac_bss_id_hi_mask_get(void)
{
    return REG_PL_RD(NXMAC_BSS_ID_HI_MASK_ADDR);
}

static inline void blmac_bss_id_hi_mask_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BSS_ID_HI_MASK_ADDR, value);
}

// field definitions
#define NXMAC_BSS_ID_HIGH_MASK_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_BSS_ID_HIGH_MASK_LSB    0
#define NXMAC_BSS_ID_HIGH_MASK_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_BSS_ID_HIGH_MASK_RST    0x0

static inline uint16_t blmac_bss_id_high_mask_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BSS_ID_HI_MASK_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_bss_id_high_mask_setf(uint16_t bssidhighmask)
{
    ASSERT_ERR((((uint32_t)bssidhighmask << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_BSS_ID_HI_MASK_ADDR, (uint32_t)bssidhighmask << 0);
}

/**
 * @brief STATE_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:04            nextState   0x0
 *  03:00         currentState   0x0
 * </pre>
 */
#define NXMAC_STATE_CNTRL_ADDR   0x60B00038
#define NXMAC_STATE_CNTRL_OFFSET 0x00000038
#define NXMAC_STATE_CNTRL_INDEX  0x0000000E
#define NXMAC_STATE_CNTRL_RESET  0x00000000

static inline uint32_t blmac_state_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_STATE_CNTRL_ADDR);
}

static inline void blmac_state_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_STATE_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_NEXT_STATE_MASK      ((uint32_t)0x000000F0)
#define NXMAC_NEXT_STATE_LSB       4
#define NXMAC_NEXT_STATE_WIDTH     ((uint32_t)0x00000004)
#define NXMAC_CURRENT_STATE_MASK   ((uint32_t)0x0000000F)
#define NXMAC_CURRENT_STATE_LSB    0
#define NXMAC_CURRENT_STATE_WIDTH  ((uint32_t)0x00000004)

#define NXMAC_NEXT_STATE_RST       0x0
#define NXMAC_CURRENT_STATE_RST    0x0

static inline void blmac_state_cntrl_unpack(uint8_t* nextstate, uint8_t* currentstate)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STATE_CNTRL_ADDR);

    *nextstate = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *currentstate = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint8_t blmac_next_state_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STATE_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_next_state_setf(uint8_t nextstate)
{
    ASSERT_ERR((((uint32_t)nextstate << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_STATE_CNTRL_ADDR, (uint32_t)nextstate << 4);
}

static inline uint8_t blmac_current_state_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STATE_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

/**
 * @brief SCAN_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00           probeDelay   0x0
 * </pre>
 */
#define NXMAC_SCAN_CNTRL_ADDR   0x60B0003C
#define NXMAC_SCAN_CNTRL_OFFSET 0x0000003C
#define NXMAC_SCAN_CNTRL_INDEX  0x0000000F
#define NXMAC_SCAN_CNTRL_RESET  0x00000000

