bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint32_t blmac_scan_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_SCAN_CNTRL_ADDR);
}

static inline void blmac_scan_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_SCAN_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_PROBE_DELAY_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_PROBE_DELAY_LSB    0
#define NXMAC_PROBE_DELAY_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_PROBE_DELAY_RST    0x0

static inline uint16_t blmac_probe_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_SCAN_CNTRL_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_probe_delay_setf(uint16_t probedelay)
{
    ASSERT_ERR((((uint32_t)probedelay << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_SCAN_CNTRL_ADDR, (uint32_t)probedelay << 0);
}

/**
 * @brief DOZE_CNTRL_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:17                atimW   0x0
 *     16           wakeupDTIM   0
 *  15:00       listenInterval   0x0
 * </pre>
 */
#define NXMAC_DOZE_CNTRL_1_ADDR   0x60B00044
#define NXMAC_DOZE_CNTRL_1_OFFSET 0x00000044
#define NXMAC_DOZE_CNTRL_1_INDEX  0x00000011
#define NXMAC_DOZE_CNTRL_1_RESET  0x00000000

static inline uint32_t blmac_doze_cntrl_1_get(void)
{
    return REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR);
}

static inline void blmac_doze_cntrl_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DOZE_CNTRL_1_ADDR, value);
}

// field definitions
#define NXMAC_ATIM_W_MASK            ((uint32_t)0xFFFE0000)
#define NXMAC_ATIM_W_LSB             17
#define NXMAC_ATIM_W_WIDTH           ((uint32_t)0x0000000F)
#define NXMAC_WAKEUP_DTIM_BIT        ((uint32_t)0x00010000)
#define NXMAC_WAKEUP_DTIM_POS        16
#define NXMAC_LISTEN_INTERVAL_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_LISTEN_INTERVAL_LSB    0
#define NXMAC_LISTEN_INTERVAL_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_ATIM_W_RST             0x0
#define NXMAC_WAKEUP_DTIM_RST        0x0
#define NXMAC_LISTEN_INTERVAL_RST    0x0

static inline void blmac_doze_cntrl_1_pack(uint16_t atimw, uint8_t wakeupdtim, uint16_t listeninterval)
{
    ASSERT_ERR((((uint32_t)atimw << 17) & ~((uint32_t)0xFFFE0000)) == 0);
    ASSERT_ERR((((uint32_t)wakeupdtim << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)listeninterval << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_DOZE_CNTRL_1_ADDR,  ((uint32_t)atimw << 17) | ((uint32_t)wakeupdtim << 16) | ((uint32_t)listeninterval << 0));
}

static inline void blmac_doze_cntrl_1_unpack(uint16_t* atimw, uint8_t* wakeupdtim, uint16_t* listeninterval)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR);

    *atimw = (localVal & ((uint32_t)0xFFFE0000)) >> 17;
    *wakeupdtim = (localVal & ((uint32_t)0x00010000)) >> 16;
    *listeninterval = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

static inline uint16_t blmac_atim_w_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0xFFFE0000)) >> 17);
}

static inline void blmac_atim_w_setf(uint16_t atimw)
{
    ASSERT_ERR((((uint32_t)atimw << 17) & ~((uint32_t)0xFFFE0000)) == 0);
    REG_PL_WR(NXMAC_DOZE_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR) & ~((uint32_t)0xFFFE0000)) | ((uint32_t)atimw << 17));
}

static inline uint8_t blmac_wakeup_dtim_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

static inline void blmac_wakeup_dtim_setf(uint8_t wakeupdtim)
{
    ASSERT_ERR((((uint32_t)wakeupdtim << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_PL_WR(NXMAC_DOZE_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)wakeupdtim << 16));
}

static inline uint16_t blmac_listen_interval_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

static inline void blmac_listen_interval_setf(uint16_t listeninterval)
{
    ASSERT_ERR((((uint32_t)listeninterval << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_DOZE_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_DOZE_CNTRL_1_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)listeninterval << 0));
}

/**
 * @brief MAC_CNTRL_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     26             rxRIFSEn   0
 *     25        tsfMgtDisable   0
 *     24       tsfUpdatedBySW   0
 *  16:14             abgnMode   0x3
 *     13       keyStoRAMReset   0
 *     12        mibTableReset   0
 *     11   rateControllerMPIF   1
 *     10        disableBAResp   0
 *     09       disableCTSResp   0
 *     08       disableACKResp   0
 *     07      activeClkGating   1
 *     06    enableLPClkSwitch   0
 *     03             cfpAware   0
 *     02               pwrMgt   0
 *     01                   ap   0
 *     00              bssType   1
 * </pre>
 */
#define NXMAC_MAC_CNTRL_1_ADDR   0x60B0004C
#define NXMAC_MAC_CNTRL_1_OFFSET 0x0000004C
#define NXMAC_MAC_CNTRL_1_INDEX  0x00000013
#define NXMAC_MAC_CNTRL_1_RESET  0x0000C881

static inline uint32_t blmac_mac_cntrl_1_get(void)
{
    return REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
}

static inline void blmac_mac_cntrl_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, value);
}

// field definitions
#define NXMAC_RX_RIFS_EN_BIT              ((uint32_t)0x04000000)
#define NXMAC_RX_RIFS_EN_POS              26
#define NXMAC_TSF_MGT_DISABLE_BIT         ((uint32_t)0x02000000)
#define NXMAC_TSF_MGT_DISABLE_POS         25
#define NXMAC_TSF_UPDATED_BY_SW_BIT       ((uint32_t)0x01000000)
#define NXMAC_TSF_UPDATED_BY_SW_POS       24
#define NXMAC_ABGN_MODE_MASK              ((uint32_t)0x0001C000)
#define NXMAC_ABGN_MODE_LSB               14
#define NXMAC_ABGN_MODE_WIDTH             ((uint32_t)0x00000003)
#define NXMAC_KEY_STO_RAM_RESET_BIT       ((uint32_t)0x00002000)
#define NXMAC_KEY_STO_RAM_RESET_POS       13
#define NXMAC_MIB_TABLE_RESET_BIT         ((uint32_t)0x00001000)
#define NXMAC_MIB_TABLE_RESET_POS         12
#define NXMAC_RATE_CONTROLLER_MPIF_BIT    ((uint32_t)0x00000800)
#define NXMAC_RATE_CONTROLLER_MPIF_POS    11
#define NXMAC_DISABLE_BA_RESP_BIT         ((uint32_t)0x00000400)
#define NXMAC_DISABLE_BA_RESP_POS         10
#define NXMAC_DISABLE_CTS_RESP_BIT        ((uint32_t)0x00000200)
#define NXMAC_DISABLE_CTS_RESP_POS        9
#define NXMAC_DISABLE_ACK_RESP_BIT        ((uint32_t)0x00000100)
#define NXMAC_DISABLE_ACK_RESP_POS        8
#define NXMAC_ACTIVE_CLK_GATING_BIT       ((uint32_t)0x00000080)
#define NXMAC_ACTIVE_CLK_GATING_POS       7
#define NXMAC_ENABLE_LP_CLK_SWITCH_BIT    ((uint32_t)0x00000040)
#define NXMAC_ENABLE_LP_CLK_SWITCH_POS    6
#define NXMAC_CFP_AWARE_BIT               ((uint32_t)0x00000008)
#define NXMAC_CFP_AWARE_POS               3
#define NXMAC_PWR_MGT_BIT                 ((uint32_t)0x00000004)
#define NXMAC_PWR_MGT_POS                 2
#define NXMAC_AP_BIT                      ((uint32_t)0x00000002)
#define NXMAC_AP_POS                      1
#define NXMAC_BSS_TYPE_BIT                ((uint32_t)0x00000001)
#define NXMAC_BSS_TYPE_POS                0

