bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
#define NXMAC_RX_RIFS_EN_RST              0x0
#define NXMAC_TSF_MGT_DISABLE_RST         0x0
#define NXMAC_TSF_UPDATED_BY_SW_RST       0x0
#define NXMAC_ABGN_MODE_RST               0x3
#define NXMAC_KEY_STO_RAM_RESET_RST       0x0
#define NXMAC_MIB_TABLE_RESET_RST         0x0
#define NXMAC_RATE_CONTROLLER_MPIF_RST    0x1
#define NXMAC_DISABLE_BA_RESP_RST         0x0
#define NXMAC_DISABLE_CTS_RESP_RST        0x0
#define NXMAC_DISABLE_ACK_RESP_RST        0x0
#define NXMAC_ACTIVE_CLK_GATING_RST       0x1
#define NXMAC_ENABLE_LP_CLK_SWITCH_RST    0x0
#define NXMAC_CFP_AWARE_RST               0x0
#define NXMAC_PWR_MGT_RST                 0x0
#define NXMAC_AP_RST                      0x0
#define NXMAC_BSS_TYPE_RST                0x1

static inline void blmac_mac_cntrl_1_pack(uint8_t rxrifsen, uint8_t tsfmgtdisable, uint8_t tsfupdatedbysw, uint8_t abgnmode, uint8_t keystoramreset, uint8_t mibtablereset, uint8_t ratecontrollermpif, uint8_t disablebaresp, uint8_t disablectsresp, uint8_t disableackresp, uint8_t activeclkgating, uint8_t enablelpclkswitch, uint8_t cfpaware, uint8_t pwrmgt, uint8_t ap, uint8_t bsstype)
{
    ASSERT_ERR((((uint32_t)rxrifsen << 26) & ~((uint32_t)0x04000000)) == 0);
    ASSERT_ERR((((uint32_t)tsfmgtdisable << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)tsfupdatedbysw << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)abgnmode << 14) & ~((uint32_t)0x0001C000)) == 0);
    ASSERT_ERR((((uint32_t)keystoramreset << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)mibtablereset << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)ratecontrollermpif << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)disablebaresp << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)disablectsresp << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)disableackresp << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)activeclkgating << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)enablelpclkswitch << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)cfpaware << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)pwrmgt << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)ap << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)bsstype << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR,  ((uint32_t)rxrifsen << 26) | ((uint32_t)tsfmgtdisable << 25) | ((uint32_t)tsfupdatedbysw << 24) | ((uint32_t)abgnmode << 14) | ((uint32_t)keystoramreset << 13) | ((uint32_t)mibtablereset << 12) | ((uint32_t)ratecontrollermpif << 11) | ((uint32_t)disablebaresp << 10) | ((uint32_t)disablectsresp << 9) | ((uint32_t)disableackresp << 8) | ((uint32_t)activeclkgating << 7) | ((uint32_t)enablelpclkswitch << 6) | ((uint32_t)cfpaware << 3) | ((uint32_t)pwrmgt << 2) | ((uint32_t)ap << 1) | ((uint32_t)bsstype << 0));
}

static inline void blmac_mac_cntrl_1_unpack(uint8_t* rxrifsen, uint8_t* tsfmgtdisable, uint8_t* tsfupdatedbysw, uint8_t* abgnmode, uint8_t* keystoramreset, uint8_t* mibtablereset, uint8_t* ratecontrollermpif, uint8_t* disablebaresp, uint8_t* disablectsresp, uint8_t* disableackresp, uint8_t* activeclkgating, uint8_t* enablelpclkswitch, uint8_t* cfpaware, uint8_t* pwrmgt, uint8_t* ap, uint8_t* bsstype)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);

    *rxrifsen = (localVal & ((uint32_t)0x04000000)) >> 26;
    *tsfmgtdisable = (localVal & ((uint32_t)0x02000000)) >> 25;
    *tsfupdatedbysw = (localVal & ((uint32_t)0x01000000)) >> 24;
    *abgnmode = (localVal & ((uint32_t)0x0001C000)) >> 14;
    *keystoramreset = (localVal & ((uint32_t)0x00002000)) >> 13;
    *mibtablereset = (localVal & ((uint32_t)0x00001000)) >> 12;
    *ratecontrollermpif = (localVal & ((uint32_t)0x00000800)) >> 11;
    *disablebaresp = (localVal & ((uint32_t)0x00000400)) >> 10;
    *disablectsresp = (localVal & ((uint32_t)0x00000200)) >> 9;
    *disableackresp = (localVal & ((uint32_t)0x00000100)) >> 8;
    *activeclkgating = (localVal & ((uint32_t)0x00000080)) >> 7;
    *enablelpclkswitch = (localVal & ((uint32_t)0x00000040)) >> 6;
    *cfpaware = (localVal & ((uint32_t)0x00000008)) >> 3;
    *pwrmgt = (localVal & ((uint32_t)0x00000004)) >> 2;
    *ap = (localVal & ((uint32_t)0x00000002)) >> 1;
    *bsstype = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_rx_rifs_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

static inline void blmac_rx_rifs_en_setf(uint8_t rxrifsen)
{
    ASSERT_ERR((((uint32_t)rxrifsen << 26) & ~((uint32_t)0x04000000)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x04000000)) | ((uint32_t)rxrifsen << 26));
}

static inline uint8_t blmac_tsf_mgt_disable_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

static inline void blmac_tsf_mgt_disable_setf(uint8_t tsfmgtdisable)
{
    ASSERT_ERR((((uint32_t)tsfmgtdisable << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)tsfmgtdisable << 25));
}

static inline uint8_t blmac_tsf_updated_by_sw_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

static inline void blmac_tsf_updated_by_sw_setf(uint8_t tsfupdatedbysw)
{
    ASSERT_ERR((((uint32_t)tsfupdatedbysw << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)tsfupdatedbysw << 24));
}

static inline uint8_t blmac_abgn_mode_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x0001C000)) >> 14);
}

static inline void blmac_abgn_mode_setf(uint8_t abgnmode)
{
    ASSERT_ERR((((uint32_t)abgnmode << 14) & ~((uint32_t)0x0001C000)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x0001C000)) | ((uint32_t)abgnmode << 14));
}

static inline uint8_t blmac_key_sto_ram_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

static inline void blmac_key_sto_ram_reset_setf(uint8_t keystoramreset)
{
    ASSERT_ERR((((uint32_t)keystoramreset << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)keystoramreset << 13));
}

static inline uint8_t blmac_mib_table_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

static inline void blmac_mib_table_reset_setf(uint8_t mibtablereset)
{
    ASSERT_ERR((((uint32_t)mibtablereset << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)mibtablereset << 12));
}

