bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_rate_controller_mpif_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

static inline void blmac_rate_controller_mpif_setf(uint8_t ratecontrollermpif)
{
    ASSERT_ERR((((uint32_t)ratecontrollermpif << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)ratecontrollermpif << 11));
}

static inline uint8_t blmac_disable_ba_resp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

static inline void blmac_disable_ba_resp_setf(uint8_t disablebaresp)
{
    ASSERT_ERR((((uint32_t)disablebaresp << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)disablebaresp << 10));
}

static inline uint8_t blmac_disable_cts_resp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

static inline void blmac_disable_cts_resp_setf(uint8_t disablectsresp)
{
    ASSERT_ERR((((uint32_t)disablectsresp << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)disablectsresp << 9));
}

static inline uint8_t blmac_disable_ack_resp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

static inline void blmac_disable_ack_resp_setf(uint8_t disableackresp)
{
    ASSERT_ERR((((uint32_t)disableackresp << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)disableackresp << 8));
}

static inline uint8_t blmac_active_clk_gating_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

static inline void blmac_active_clk_gating_setf(uint8_t activeclkgating)
{
    ASSERT_ERR((((uint32_t)activeclkgating << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)activeclkgating << 7));
}

static inline uint8_t blmac_enable_lp_clk_switch_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

static inline void blmac_enable_lp_clk_switch_setf(uint8_t enablelpclkswitch)
{
    ASSERT_ERR((((uint32_t)enablelpclkswitch << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)enablelpclkswitch << 6));
}

static inline uint8_t blmac_cfp_aware_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline void blmac_cfp_aware_setf(uint8_t cfpaware)
{
    ASSERT_ERR((((uint32_t)cfpaware << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)cfpaware << 3));
}

static inline uint8_t blmac_pwr_mgt_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

static inline void blmac_pwr_mgt_setf(uint8_t pwrmgt)
{
    ASSERT_ERR((((uint32_t)pwrmgt << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)pwrmgt << 2));
}

static inline uint8_t blmac_ap_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline void blmac_ap_setf(uint8_t ap)
{
    ASSERT_ERR((((uint32_t)ap << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)ap << 1));
}

static inline uint8_t blmac_bss_type_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_bss_type_setf(uint8_t bsstype)
{
    ASSERT_ERR((((uint32_t)bsstype << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_MAC_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_MAC_CNTRL_1_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)bsstype << 0));
}

/**
 * @brief MAC_ERR_REC_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     16        rxFlowCntrlEn   0
 *     07      baPSBitmapReset   0
 *     06      encrRxFIFOReset   0
 *     05    macPHYIFFIFOReset   0
 *     04          txFIFOReset   0
 *     03          rxFIFOReset   0
 *     02           hwFSMReset   0
 *     01            useErrDet   0
 *     00            useErrRec   0
 * </pre>
 */
#define NXMAC_MAC_ERR_REC_CNTRL_ADDR   0x60B00054
#define NXMAC_MAC_ERR_REC_CNTRL_OFFSET 0x00000054
#define NXMAC_MAC_ERR_REC_CNTRL_INDEX  0x00000015
#define NXMAC_MAC_ERR_REC_CNTRL_RESET  0x00000000

static inline uint32_t blmac_mac_err_rec_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
}

static inline void blmac_mac_err_rec_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_RX_FLOW_CNTRL_EN_BIT       ((uint32_t)0x00010000)
#define NXMAC_RX_FLOW_CNTRL_EN_POS       16
#define NXMAC_BA_PS_BITMAP_RESET_BIT     ((uint32_t)0x00000080)
#define NXMAC_BA_PS_BITMAP_RESET_POS     7
#define NXMAC_ENCR_RX_FIFO_RESET_BIT     ((uint32_t)0x00000040)
#define NXMAC_ENCR_RX_FIFO_RESET_POS     6
#define NXMAC_MAC_PHYIFFIFO_RESET_BIT    ((uint32_t)0x00000020)
#define NXMAC_MAC_PHYIFFIFO_RESET_POS    5
#define NXMAC_TX_FIFO_RESET_BIT          ((uint32_t)0x00000010)
#define NXMAC_TX_FIFO_RESET_POS          4
#define NXMAC_RX_FIFO_RESET_BIT          ((uint32_t)0x00000008)
#define NXMAC_RX_FIFO_RESET_POS          3
#define NXMAC_HW_FSM_RESET_BIT           ((uint32_t)0x00000004)
#define NXMAC_HW_FSM_RESET_POS           2
#define NXMAC_USE_ERR_DET_BIT            ((uint32_t)0x00000002)
#define NXMAC_USE_ERR_DET_POS            1
#define NXMAC_USE_ERR_REC_BIT            ((uint32_t)0x00000001)
#define NXMAC_USE_ERR_REC_POS            0

#define NXMAC_RX_FLOW_CNTRL_EN_RST       0x0
#define NXMAC_BA_PS_BITMAP_RESET_RST     0x0
#define NXMAC_ENCR_RX_FIFO_RESET_RST     0x0
#define NXMAC_MAC_PHYIFFIFO_RESET_RST    0x0
#define NXMAC_TX_FIFO_RESET_RST          0x0
#define NXMAC_RX_FIFO_RESET_RST          0x0
#define NXMAC_HW_FSM_RESET_RST           0x0
#define NXMAC_USE_ERR_DET_RST            0x0
#define NXMAC_USE_ERR_REC_RST            0x0

static inline void blmac_mac_err_rec_cntrl_pack(uint8_t rxflowcntrlen, uint8_t bapsbitmapreset, uint8_t encrrxfiforeset, uint8_t macphyiffiforeset, uint8_t txfiforeset, uint8_t rxfiforeset, uint8_t hwfsmreset, uint8_t useerrdet)
{
    ASSERT_ERR((((uint32_t)rxflowcntrlen << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)bapsbitmapreset << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)encrrxfiforeset << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)macphyiffiforeset << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)txfiforeset << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)rxfiforeset << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)hwfsmreset << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)useerrdet << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR,  ((uint32_t)rxflowcntrlen << 16) | ((uint32_t)bapsbitmapreset << 7) | ((uint32_t)encrrxfiforeset << 6) | ((uint32_t)macphyiffiforeset << 5) | ((uint32_t)txfiforeset << 4) | ((uint32_t)rxfiforeset << 3) | ((uint32_t)hwfsmreset << 2) | ((uint32_t)useerrdet << 1));
}

static inline void blmac_mac_err_rec_cntrl_unpack(uint8_t* rxflowcntrlen, uint8_t* bapsbitmapreset, uint8_t* encrrxfiforeset, uint8_t* macphyiffiforeset, uint8_t* txfiforeset, uint8_t* rxfiforeset, uint8_t* hwfsmreset, uint8_t* useerrdet, uint8_t* useerrrec)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);

    *rxflowcntrlen = (localVal & ((uint32_t)0x00010000)) >> 16;
    *bapsbitmapreset = (localVal & ((uint32_t)0x00000080)) >> 7;
    *encrrxfiforeset = (localVal & ((uint32_t)0x00000040)) >> 6;
    *macphyiffiforeset = (localVal & ((uint32_t)0x00000020)) >> 5;
    *txfiforeset = (localVal & ((uint32_t)0x00000010)) >> 4;
    *rxfiforeset = (localVal & ((uint32_t)0x00000008)) >> 3;
    *hwfsmreset = (localVal & ((uint32_t)0x00000004)) >> 2;
    *useerrdet = (localVal & ((uint32_t)0x00000002)) >> 1;
    *useerrrec = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_rx_flow_cntrl_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

static inline void blmac_rx_flow_cntrl_en_setf(uint8_t rxflowcntrlen)
{
    ASSERT_ERR((((uint32_t)rxflowcntrlen << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)rxflowcntrlen << 16));
}

