bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_ba_ps_bitmap_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

static inline void blmac_ba_ps_bitmap_reset_setf(uint8_t bapsbitmapreset)
{
    ASSERT_ERR((((uint32_t)bapsbitmapreset << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)bapsbitmapreset << 7));
}

static inline uint8_t blmac_encr_rx_fifo_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

static inline void blmac_encr_rx_fifo_reset_setf(uint8_t encrrxfiforeset)
{
    ASSERT_ERR((((uint32_t)encrrxfiforeset << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)encrrxfiforeset << 6));
}

static inline uint8_t blmac_mac_phyiffifo_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

static inline void blmac_mac_phyiffifo_reset_setf(uint8_t macphyiffiforeset)
{
    ASSERT_ERR((((uint32_t)macphyiffiforeset << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)macphyiffiforeset << 5));
}

static inline uint8_t blmac_tx_fifo_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

static inline void blmac_tx_fifo_reset_setf(uint8_t txfiforeset)
{
    ASSERT_ERR((((uint32_t)txfiforeset << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)txfiforeset << 4));
}

static inline uint8_t blmac_rx_fifo_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline void blmac_rx_fifo_reset_setf(uint8_t rxfiforeset)
{
    ASSERT_ERR((((uint32_t)rxfiforeset << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)rxfiforeset << 3));
}

static inline uint8_t blmac_hw_fsm_reset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

static inline void blmac_hw_fsm_reset_setf(uint8_t hwfsmreset)
{
    ASSERT_ERR((((uint32_t)hwfsmreset << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)hwfsmreset << 2));
}

static inline uint8_t blmac_use_err_det_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline void blmac_use_err_det_setf(uint8_t useerrdet)
{
    ASSERT_ERR((((uint32_t)useerrdet << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_REC_CNTRL_ADDR, (REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)useerrdet << 1));
}

static inline uint8_t blmac_use_err_rec_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_REC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief MAC_ERR_SET_STATUS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     03        errInHWLevel3   0
 *     02      errInTxRxLevel2   0
 *     01        errInRxLevel1   0
 *     00        errInTxLevel1   0
 * </pre>
 */
#define NXMAC_MAC_ERR_SET_STATUS_ADDR   0x60B00058
#define NXMAC_MAC_ERR_SET_STATUS_OFFSET 0x00000058
#define NXMAC_MAC_ERR_SET_STATUS_INDEX  0x00000016
#define NXMAC_MAC_ERR_SET_STATUS_RESET  0x00000000

static inline uint32_t blmac_mac_err_set_status_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ERR_SET_STATUS_ADDR);
}

static inline void blmac_mac_err_set_status_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ERR_SET_STATUS_ADDR, value);
}

// field definitions
#define NXMAC_ERR_IN_HW_LEVEL_3_BIT       ((uint32_t)0x00000008)
#define NXMAC_ERR_IN_HW_LEVEL_3_POS       3
#define NXMAC_ERR_IN_TX_RX_LEVEL_2_BIT    ((uint32_t)0x00000004)
#define NXMAC_ERR_IN_TX_RX_LEVEL_2_POS    2
#define NXMAC_ERR_IN_RX_LEVEL_1_BIT       ((uint32_t)0x00000002)
#define NXMAC_ERR_IN_RX_LEVEL_1_POS       1
#define NXMAC_ERR_IN_TX_LEVEL_1_BIT       ((uint32_t)0x00000001)
#define NXMAC_ERR_IN_TX_LEVEL_1_POS       0

#define NXMAC_ERR_IN_HW_LEVEL_3_RST       0x0
#define NXMAC_ERR_IN_TX_RX_LEVEL_2_RST    0x0
#define NXMAC_ERR_IN_RX_LEVEL_1_RST       0x0
#define NXMAC_ERR_IN_TX_LEVEL_1_RST       0x0

static inline void blmac_mac_err_set_status_pack(uint8_t errinhwlevel3, uint8_t errintxrxlevel2, uint8_t errinrxlevel1, uint8_t errintxlevel1)
{
    ASSERT_ERR((((uint32_t)errinhwlevel3 << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)errintxrxlevel2 << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)errinrxlevel1 << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)errintxlevel1 << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_SET_STATUS_ADDR,  ((uint32_t)errinhwlevel3 << 3) | ((uint32_t)errintxrxlevel2 << 2) | ((uint32_t)errinrxlevel1 << 1) | ((uint32_t)errintxlevel1 << 0));
}

static inline void blmac_mac_err_set_status_unpack(uint8_t* errinhwlevel3, uint8_t* errintxrxlevel2, uint8_t* errinrxlevel1, uint8_t* errintxlevel1)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_SET_STATUS_ADDR);

    *errinhwlevel3 = (localVal & ((uint32_t)0x00000008)) >> 3;
    *errintxrxlevel2 = (localVal & ((uint32_t)0x00000004)) >> 2;
    *errinrxlevel1 = (localVal & ((uint32_t)0x00000002)) >> 1;
    *errintxlevel1 = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_err_in_hw_level_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_SET_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline void blmac_err_in_hw_level_3_setf(uint8_t errinhwlevel3)
{
    ASSERT_ERR((((uint32_t)errinhwlevel3 << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_SET_STATUS_ADDR, (uint32_t)errinhwlevel3 << 3);
}

