bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_err_in_tx_rx_level_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_SET_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

static inline void blmac_err_in_tx_rx_level_2_setf(uint8_t errintxrxlevel2)
{
    ASSERT_ERR((((uint32_t)errintxrxlevel2 << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_SET_STATUS_ADDR, (uint32_t)errintxrxlevel2 << 2);
}

static inline uint8_t blmac_err_in_rx_level_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_SET_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline void blmac_err_in_rx_level_1_setf(uint8_t errinrxlevel1)
{
    ASSERT_ERR((((uint32_t)errinrxlevel1 << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_SET_STATUS_ADDR, (uint32_t)errinrxlevel1 << 1);
}

static inline uint8_t blmac_err_in_tx_level_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_SET_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_err_in_tx_level_1_setf(uint8_t errintxlevel1)
{
    ASSERT_ERR((((uint32_t)errintxlevel1 << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_SET_STATUS_ADDR, (uint32_t)errintxlevel1 << 0);
}

/**
 * @brief MAC_ERR_CLEAR_STATUS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     03   clearErrInHWLevel3   0
 *     02   clearErrInTxRxLevel2   0
 *     01   clearErrInRxLevel1   0
 *     00   clearErrInTxLevel1   0
 * </pre>
 */
#define NXMAC_MAC_ERR_CLEAR_STATUS_ADDR   0x60B0005C
#define NXMAC_MAC_ERR_CLEAR_STATUS_OFFSET 0x0000005C
#define NXMAC_MAC_ERR_CLEAR_STATUS_INDEX  0x00000017
#define NXMAC_MAC_ERR_CLEAR_STATUS_RESET  0x00000000

static inline uint32_t blmac_mac_err_clear_status_get(void)
{
    return REG_PL_RD(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR);
}

static inline void blmac_mac_err_clear_status_clear(uint32_t value)
{
    REG_PL_WR(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR, value);
}

// field definitions
#define NXMAC_CLEAR_ERR_IN_HW_LEVEL_3_BIT       ((uint32_t)0x00000008)
#define NXMAC_CLEAR_ERR_IN_HW_LEVEL_3_POS       3
#define NXMAC_CLEAR_ERR_IN_TX_RX_LEVEL_2_BIT    ((uint32_t)0x00000004)
#define NXMAC_CLEAR_ERR_IN_TX_RX_LEVEL_2_POS    2
#define NXMAC_CLEAR_ERR_IN_RX_LEVEL_1_BIT       ((uint32_t)0x00000002)
#define NXMAC_CLEAR_ERR_IN_RX_LEVEL_1_POS       1
#define NXMAC_CLEAR_ERR_IN_TX_LEVEL_1_BIT       ((uint32_t)0x00000001)
#define NXMAC_CLEAR_ERR_IN_TX_LEVEL_1_POS       0

#define NXMAC_CLEAR_ERR_IN_HW_LEVEL_3_RST       0x0
#define NXMAC_CLEAR_ERR_IN_TX_RX_LEVEL_2_RST    0x0
#define NXMAC_CLEAR_ERR_IN_RX_LEVEL_1_RST       0x0
#define NXMAC_CLEAR_ERR_IN_TX_LEVEL_1_RST       0x0

static inline void blmac_mac_err_clear_status_pack(uint8_t clearerrinhwlevel3, uint8_t clearerrintxrxlevel2, uint8_t clearerrinrxlevel1, uint8_t clearerrintxlevel1)
{
    ASSERT_ERR((((uint32_t)clearerrinhwlevel3 << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)clearerrintxrxlevel2 << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)clearerrinrxlevel1 << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)clearerrintxlevel1 << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR,  ((uint32_t)clearerrinhwlevel3 << 3) | ((uint32_t)clearerrintxrxlevel2 << 2) | ((uint32_t)clearerrinrxlevel1 << 1) | ((uint32_t)clearerrintxlevel1 << 0));
}

static inline void blmac_mac_err_clear_status_unpack(uint8_t* clearerrinhwlevel3, uint8_t* clearerrintxrxlevel2, uint8_t* clearerrinrxlevel1, uint8_t* clearerrintxlevel1)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR);

    *clearerrinhwlevel3 = (localVal & ((uint32_t)0x00000008)) >> 3;
    *clearerrintxrxlevel2 = (localVal & ((uint32_t)0x00000004)) >> 2;
    *clearerrinrxlevel1 = (localVal & ((uint32_t)0x00000002)) >> 1;
    *clearerrintxlevel1 = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_clear_err_in_hw_level_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline void blmac_clear_err_in_hw_level_3_clearf(uint8_t clearerrinhwlevel3)
{
    ASSERT_ERR((((uint32_t)clearerrinhwlevel3 << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR, (uint32_t)clearerrinhwlevel3 << 3);
}

static inline uint8_t blmac_clear_err_in_tx_rx_level_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

static inline void blmac_clear_err_in_tx_rx_level_2_clearf(uint8_t clearerrintxrxlevel2)
{
    ASSERT_ERR((((uint32_t)clearerrintxrxlevel2 << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR, (uint32_t)clearerrintxrxlevel2 << 2);
}

static inline uint8_t blmac_clear_err_in_rx_level_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline void blmac_clear_err_in_rx_level_1_clearf(uint8_t clearerrinrxlevel1)
{
    ASSERT_ERR((((uint32_t)clearerrinrxlevel1 << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR, (uint32_t)clearerrinrxlevel1 << 1);
}

static inline uint8_t blmac_clear_err_in_tx_level_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_clear_err_in_tx_level_1_clearf(uint8_t clearerrintxlevel1)
{
    ASSERT_ERR((((uint32_t)clearerrintxlevel1 << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_MAC_ERR_CLEAR_STATUS_ADDR, (uint32_t)clearerrintxlevel1 << 0);
}

/**
 * @brief RX_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31   enDuplicateDetection   0
 *     30        acceptUnknown   0
 *     29   acceptOtherDataFrames   0
 *     28        acceptQoSNull   1
 *     27      acceptQCFWOData   0
 *     26          acceptQData   1
 *     25       acceptCFWOData   0
 *     24           acceptData   1
 *     23   acceptOtherCntrlFrames   0
 *     22          acceptCFEnd   0
 *     21            acceptACK   0
 *     20            acceptCTS   0
 *     19            acceptRTS   0
 *     18         acceptPSPoll   1
 *     17             acceptBA   1
 *     16            acceptBAR   1
 *     15   acceptOtherMgmtFrames   1
 *     13      acceptAllBeacon   0
 *     12   acceptNotExpectedBA   0
 *     11   acceptDecryptErrorFrames   0
 *     10         acceptBeacon   1
 *     09      acceptProbeResp   1
 *     08       acceptProbeReq   1
 *     07      acceptMyUnicast   1
 *     06        acceptUnicast   0
 *     05    acceptErrorFrames   0
 *     04     acceptOtherBSSID   0
 *     03      acceptBroadcast   1
 *     02      acceptMulticast   0
 *     01          dontDecrypt   0
 *     00       excUnencrypted   0
 * </pre>
 */
#define NXMAC_RX_CNTRL_ADDR   0x60B00060
#define NXMAC_RX_CNTRL_OFFSET 0x00000060
#define NXMAC_RX_CNTRL_INDEX  0x00000018
#define NXMAC_RX_CNTRL_RESET  0x15078788

static inline uint32_t blmac_rx_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
}

