bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_rx_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_EN_DUPLICATE_DETECTION_BIT         ((uint32_t)0x80000000)
#define NXMAC_EN_DUPLICATE_DETECTION_POS         31
#define NXMAC_ACCEPT_UNKNOWN_BIT                 ((uint32_t)0x40000000)
#define NXMAC_ACCEPT_UNKNOWN_POS                 30
#define NXMAC_ACCEPT_OTHER_DATA_FRAMES_BIT       ((uint32_t)0x20000000)
#define NXMAC_ACCEPT_OTHER_DATA_FRAMES_POS       29
#define NXMAC_ACCEPT_QO_S_NULL_BIT               ((uint32_t)0x10000000)
#define NXMAC_ACCEPT_QO_S_NULL_POS               28
#define NXMAC_ACCEPT_QCFWO_DATA_BIT              ((uint32_t)0x08000000)
#define NXMAC_ACCEPT_QCFWO_DATA_POS              27
#define NXMAC_ACCEPT_Q_DATA_BIT                  ((uint32_t)0x04000000)
#define NXMAC_ACCEPT_Q_DATA_POS                  26
#define NXMAC_ACCEPT_CFWO_DATA_BIT               ((uint32_t)0x02000000)
#define NXMAC_ACCEPT_CFWO_DATA_POS               25
#define NXMAC_ACCEPT_DATA_BIT                    ((uint32_t)0x01000000)
#define NXMAC_ACCEPT_DATA_POS                    24
#define NXMAC_ACCEPT_OTHER_CNTRL_FRAMES_BIT      ((uint32_t)0x00800000)
#define NXMAC_ACCEPT_OTHER_CNTRL_FRAMES_POS      23
#define NXMAC_ACCEPT_CF_END_BIT                  ((uint32_t)0x00400000)
#define NXMAC_ACCEPT_CF_END_POS                  22
#define NXMAC_ACCEPT_ACK_BIT                     ((uint32_t)0x00200000)
#define NXMAC_ACCEPT_ACK_POS                     21
#define NXMAC_ACCEPT_CTS_BIT                     ((uint32_t)0x00100000)
#define NXMAC_ACCEPT_CTS_POS                     20
#define NXMAC_ACCEPT_RTS_BIT                     ((uint32_t)0x00080000)
#define NXMAC_ACCEPT_RTS_POS                     19
#define NXMAC_ACCEPT_PS_POLL_BIT                 ((uint32_t)0x00040000)
#define NXMAC_ACCEPT_PS_POLL_POS                 18
#define NXMAC_ACCEPT_BA_BIT                      ((uint32_t)0x00020000)
#define NXMAC_ACCEPT_BA_POS                      17
#define NXMAC_ACCEPT_BAR_BIT                     ((uint32_t)0x00010000)
#define NXMAC_ACCEPT_BAR_POS                     16
#define NXMAC_ACCEPT_OTHER_MGMT_FRAMES_BIT       ((uint32_t)0x00008000)
#define NXMAC_ACCEPT_OTHER_MGMT_FRAMES_POS       15
#define NXMAC_ACCEPT_ALL_BEACON_BIT              ((uint32_t)0x00002000)
#define NXMAC_ACCEPT_ALL_BEACON_POS              13
#define NXMAC_ACCEPT_NOT_EXPECTED_BA_BIT         ((uint32_t)0x00001000)
#define NXMAC_ACCEPT_NOT_EXPECTED_BA_POS         12
#define NXMAC_ACCEPT_DECRYPT_ERROR_FRAMES_BIT    ((uint32_t)0x00000800)
#define NXMAC_ACCEPT_DECRYPT_ERROR_FRAMES_POS    11
#define NXMAC_ACCEPT_BEACON_BIT                  ((uint32_t)0x00000400)
#define NXMAC_ACCEPT_BEACON_POS                  10
#define NXMAC_ACCEPT_PROBE_RESP_BIT              ((uint32_t)0x00000200)
#define NXMAC_ACCEPT_PROBE_RESP_POS              9
#define NXMAC_ACCEPT_PROBE_REQ_BIT               ((uint32_t)0x00000100)
#define NXMAC_ACCEPT_PROBE_REQ_POS               8
#define NXMAC_ACCEPT_MY_UNICAST_BIT              ((uint32_t)0x00000080)
#define NXMAC_ACCEPT_MY_UNICAST_POS              7
#define NXMAC_ACCEPT_UNICAST_BIT                 ((uint32_t)0x00000040)
#define NXMAC_ACCEPT_UNICAST_POS                 6
#define NXMAC_ACCEPT_ERROR_FRAMES_BIT            ((uint32_t)0x00000020)
#define NXMAC_ACCEPT_ERROR_FRAMES_POS            5
#define NXMAC_ACCEPT_OTHER_BSSID_BIT             ((uint32_t)0x00000010)
#define NXMAC_ACCEPT_OTHER_BSSID_POS             4
#define NXMAC_ACCEPT_BROADCAST_BIT               ((uint32_t)0x00000008)
#define NXMAC_ACCEPT_BROADCAST_POS               3
#define NXMAC_ACCEPT_MULTICAST_BIT               ((uint32_t)0x00000004)
#define NXMAC_ACCEPT_MULTICAST_POS               2
#define NXMAC_DONT_DECRYPT_BIT                   ((uint32_t)0x00000002)
#define NXMAC_DONT_DECRYPT_POS                   1
#define NXMAC_EXC_UNENCRYPTED_BIT                ((uint32_t)0x00000001)
#define NXMAC_EXC_UNENCRYPTED_POS                0

#define NXMAC_EN_DUPLICATE_DETECTION_RST         0x0
#define NXMAC_ACCEPT_UNKNOWN_RST                 0x0
#define NXMAC_ACCEPT_OTHER_DATA_FRAMES_RST       0x0
#define NXMAC_ACCEPT_QO_S_NULL_RST               0x1
#define NXMAC_ACCEPT_QCFWO_DATA_RST              0x0
#define NXMAC_ACCEPT_Q_DATA_RST                  0x1
#define NXMAC_ACCEPT_CFWO_DATA_RST               0x0
#define NXMAC_ACCEPT_DATA_RST                    0x1
#define NXMAC_ACCEPT_OTHER_CNTRL_FRAMES_RST      0x0
#define NXMAC_ACCEPT_CF_END_RST                  0x0
#define NXMAC_ACCEPT_ACK_RST                     0x0
#define NXMAC_ACCEPT_CTS_RST                     0x0
#define NXMAC_ACCEPT_RTS_RST                     0x0
#define NXMAC_ACCEPT_PS_POLL_RST                 0x1
#define NXMAC_ACCEPT_BA_RST                      0x1
#define NXMAC_ACCEPT_BAR_RST                     0x1
#define NXMAC_ACCEPT_OTHER_MGMT_FRAMES_RST       0x1
#define NXMAC_ACCEPT_ALL_BEACON_RST              0x0
#define NXMAC_ACCEPT_NOT_EXPECTED_BA_RST         0x0
#define NXMAC_ACCEPT_DECRYPT_ERROR_FRAMES_RST    0x0
#define NXMAC_ACCEPT_BEACON_RST                  0x1
#define NXMAC_ACCEPT_PROBE_RESP_RST              0x1
#define NXMAC_ACCEPT_PROBE_REQ_RST               0x1
#define NXMAC_ACCEPT_MY_UNICAST_RST              0x1
#define NXMAC_ACCEPT_UNICAST_RST                 0x0
#define NXMAC_ACCEPT_ERROR_FRAMES_RST            0x0
#define NXMAC_ACCEPT_OTHER_BSSID_RST             0x0
#define NXMAC_ACCEPT_BROADCAST_RST               0x1
#define NXMAC_ACCEPT_MULTICAST_RST               0x0
#define NXMAC_DONT_DECRYPT_RST                   0x0
#define NXMAC_EXC_UNENCRYPTED_RST                0x0

static inline void blmac_rx_cntrl_pack(uint8_t acceptunknown, uint8_t acceptotherdataframes, uint8_t acceptqosnull, uint8_t acceptqcfwodata, uint8_t acceptqdata, uint8_t acceptcfwodata, uint8_t acceptdata, uint8_t acceptothercntrlframes, uint8_t acceptcfend, uint8_t acceptack, uint8_t acceptcts, uint8_t acceptrts, uint8_t acceptpspoll, uint8_t acceptba, uint8_t acceptbar, uint8_t acceptothermgmtframes, uint8_t acceptallbeacon, uint8_t acceptnotexpectedba, uint8_t acceptdecrypterrorframes, uint8_t acceptbeacon, uint8_t acceptproberesp, uint8_t acceptprobereq, uint8_t acceptmyunicast, uint8_t acceptunicast, uint8_t accepterrorframes, uint8_t acceptotherbssid, uint8_t acceptbroadcast, uint8_t acceptmulticast, uint8_t dontdecrypt, uint8_t excunencrypted)
{
    ASSERT_ERR((((uint32_t)acceptunknown << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptotherdataframes << 29) & ~((uint32_t)0x20000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptqosnull << 28) & ~((uint32_t)0x10000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptqcfwodata << 27) & ~((uint32_t)0x08000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptqdata << 26) & ~((uint32_t)0x04000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptcfwodata << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptdata << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)acceptothercntrlframes << 23) & ~((uint32_t)0x00800000)) == 0);
    ASSERT_ERR((((uint32_t)acceptcfend << 22) & ~((uint32_t)0x00400000)) == 0);
    ASSERT_ERR((((uint32_t)acceptack << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)acceptcts << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)acceptrts << 19) & ~((uint32_t)0x00080000)) == 0);
    ASSERT_ERR((((uint32_t)acceptpspoll << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)acceptba << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)acceptbar << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)acceptothermgmtframes << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)acceptallbeacon << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)acceptnotexpectedba << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)acceptdecrypterrorframes << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)acceptbeacon << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)acceptproberesp << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)acceptprobereq << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)acceptmyunicast << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)acceptunicast << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)accepterrorframes << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)acceptotherbssid << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)acceptbroadcast << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)acceptmulticast << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dontdecrypt << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)excunencrypted << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR,  ((uint32_t)acceptunknown << 30) | ((uint32_t)acceptotherdataframes << 29) | ((uint32_t)acceptqosnull << 28) | ((uint32_t)acceptqcfwodata << 27) | ((uint32_t)acceptqdata << 26) | ((uint32_t)acceptcfwodata << 25) | ((uint32_t)acceptdata << 24) | ((uint32_t)acceptothercntrlframes << 23) | ((uint32_t)acceptcfend << 22) | ((uint32_t)acceptack << 21) | ((uint32_t)acceptcts << 20) | ((uint32_t)acceptrts << 19) | ((uint32_t)acceptpspoll << 18) | ((uint32_t)acceptba << 17) | ((uint32_t)acceptbar << 16) | ((uint32_t)acceptothermgmtframes << 15) | ((uint32_t)acceptallbeacon << 13) | ((uint32_t)acceptnotexpectedba << 12) | ((uint32_t)acceptdecrypterrorframes << 11) | ((uint32_t)acceptbeacon << 10) | ((uint32_t)acceptproberesp << 9) | ((uint32_t)acceptprobereq << 8) | ((uint32_t)acceptmyunicast << 7) | ((uint32_t)acceptunicast << 6) | ((uint32_t)accepterrorframes << 5) | ((uint32_t)acceptotherbssid << 4) | ((uint32_t)acceptbroadcast << 3) | ((uint32_t)acceptmulticast << 2) | ((uint32_t)dontdecrypt << 1) | ((uint32_t)excunencrypted << 0));
}

static inline void blmac_rx_cntrl_unpack(uint8_t* enduplicatedetection, uint8_t* acceptunknown, uint8_t* acceptotherdataframes, uint8_t* acceptqosnull, uint8_t* acceptqcfwodata, uint8_t* acceptqdata, uint8_t* acceptcfwodata, uint8_t* acceptdata, uint8_t* acceptothercntrlframes, uint8_t* acceptcfend, uint8_t* acceptack, uint8_t* acceptcts, uint8_t* acceptrts, uint8_t* acceptpspoll, uint8_t* acceptba, uint8_t* acceptbar, uint8_t* acceptothermgmtframes, uint8_t* acceptallbeacon, uint8_t* acceptnotexpectedba, uint8_t* acceptdecrypterrorframes, uint8_t* acceptbeacon, uint8_t* acceptproberesp, uint8_t* acceptprobereq, uint8_t* acceptmyunicast, uint8_t* acceptunicast, uint8_t* accepterrorframes, uint8_t* acceptotherbssid, uint8_t* acceptbroadcast, uint8_t* acceptmulticast, uint8_t* dontdecrypt, uint8_t* excunencrypted)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);

