bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
    *enduplicatedetection = (localVal & ((uint32_t)0x80000000)) >> 31;
    *acceptunknown = (localVal & ((uint32_t)0x40000000)) >> 30;
    *acceptotherdataframes = (localVal & ((uint32_t)0x20000000)) >> 29;
    *acceptqosnull = (localVal & ((uint32_t)0x10000000)) >> 28;
    *acceptqcfwodata = (localVal & ((uint32_t)0x08000000)) >> 27;
    *acceptqdata = (localVal & ((uint32_t)0x04000000)) >> 26;
    *acceptcfwodata = (localVal & ((uint32_t)0x02000000)) >> 25;
    *acceptdata = (localVal & ((uint32_t)0x01000000)) >> 24;
    *acceptothercntrlframes = (localVal & ((uint32_t)0x00800000)) >> 23;
    *acceptcfend = (localVal & ((uint32_t)0x00400000)) >> 22;
    *acceptack = (localVal & ((uint32_t)0x00200000)) >> 21;
    *acceptcts = (localVal & ((uint32_t)0x00100000)) >> 20;
    *acceptrts = (localVal & ((uint32_t)0x00080000)) >> 19;
    *acceptpspoll = (localVal & ((uint32_t)0x00040000)) >> 18;
    *acceptba = (localVal & ((uint32_t)0x00020000)) >> 17;
    *acceptbar = (localVal & ((uint32_t)0x00010000)) >> 16;
    *acceptothermgmtframes = (localVal & ((uint32_t)0x00008000)) >> 15;
    *acceptallbeacon = (localVal & ((uint32_t)0x00002000)) >> 13;
    *acceptnotexpectedba = (localVal & ((uint32_t)0x00001000)) >> 12;
    *acceptdecrypterrorframes = (localVal & ((uint32_t)0x00000800)) >> 11;
    *acceptbeacon = (localVal & ((uint32_t)0x00000400)) >> 10;
    *acceptproberesp = (localVal & ((uint32_t)0x00000200)) >> 9;
    *acceptprobereq = (localVal & ((uint32_t)0x00000100)) >> 8;
    *acceptmyunicast = (localVal & ((uint32_t)0x00000080)) >> 7;
    *acceptunicast = (localVal & ((uint32_t)0x00000040)) >> 6;
    *accepterrorframes = (localVal & ((uint32_t)0x00000020)) >> 5;
    *acceptotherbssid = (localVal & ((uint32_t)0x00000010)) >> 4;
    *acceptbroadcast = (localVal & ((uint32_t)0x00000008)) >> 3;
    *acceptmulticast = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dontdecrypt = (localVal & ((uint32_t)0x00000002)) >> 1;
    *excunencrypted = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_en_duplicate_detection_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

static inline uint8_t blmac_accept_unknown_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

static inline void blmac_accept_unknown_setf(uint8_t acceptunknown)
{
    ASSERT_ERR((((uint32_t)acceptunknown << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)acceptunknown << 30));
}

static inline uint8_t blmac_accept_other_data_frames_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

static inline void blmac_accept_other_data_frames_setf(uint8_t acceptotherdataframes)
{
    ASSERT_ERR((((uint32_t)acceptotherdataframes << 29) & ~((uint32_t)0x20000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x20000000)) | ((uint32_t)acceptotherdataframes << 29));
}

static inline uint8_t blmac_accept_qo_s_null_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x10000000)) >> 28);
}

static inline void blmac_accept_qo_s_null_setf(uint8_t acceptqosnull)
{
    ASSERT_ERR((((uint32_t)acceptqosnull << 28) & ~((uint32_t)0x10000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x10000000)) | ((uint32_t)acceptqosnull << 28));
}

static inline uint8_t blmac_accept_qcfwo_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x08000000)) >> 27);
}

static inline void blmac_accept_qcfwo_data_setf(uint8_t acceptqcfwodata)
{
    ASSERT_ERR((((uint32_t)acceptqcfwodata << 27) & ~((uint32_t)0x08000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x08000000)) | ((uint32_t)acceptqcfwodata << 27));
}

static inline uint8_t blmac_accept_q_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

static inline void blmac_accept_q_data_setf(uint8_t acceptqdata)
{
    ASSERT_ERR((((uint32_t)acceptqdata << 26) & ~((uint32_t)0x04000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x04000000)) | ((uint32_t)acceptqdata << 26));
}

static inline uint8_t blmac_accept_cfwo_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

static inline void blmac_accept_cfwo_data_setf(uint8_t acceptcfwodata)
{
    ASSERT_ERR((((uint32_t)acceptcfwodata << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)acceptcfwodata << 25));
}

static inline uint8_t blmac_accept_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

static inline void blmac_accept_data_setf(uint8_t acceptdata)
{
    ASSERT_ERR((((uint32_t)acceptdata << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)acceptdata << 24));
}

static inline uint8_t blmac_accept_other_cntrl_frames_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

static inline void blmac_accept_other_cntrl_frames_setf(uint8_t acceptothercntrlframes)
{
    ASSERT_ERR((((uint32_t)acceptothercntrlframes << 23) & ~((uint32_t)0x00800000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00800000)) | ((uint32_t)acceptothercntrlframes << 23));
}

static inline uint8_t blmac_accept_cf_end_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

static inline void blmac_accept_cf_end_setf(uint8_t acceptcfend)
{
    ASSERT_ERR((((uint32_t)acceptcfend << 22) & ~((uint32_t)0x00400000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00400000)) | ((uint32_t)acceptcfend << 22));
}

static inline uint8_t blmac_accept_ack_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

