bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_accept_ack_setf(uint8_t acceptack)
{
    ASSERT_ERR((((uint32_t)acceptack << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)acceptack << 21));
}

static inline uint8_t blmac_accept_cts_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

static inline void blmac_accept_cts_setf(uint8_t acceptcts)
{
    ASSERT_ERR((((uint32_t)acceptcts << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)acceptcts << 20));
}

static inline uint8_t blmac_accept_rts_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

static inline void blmac_accept_rts_setf(uint8_t acceptrts)
{
    ASSERT_ERR((((uint32_t)acceptrts << 19) & ~((uint32_t)0x00080000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00080000)) | ((uint32_t)acceptrts << 19));
}

static inline uint8_t blmac_accept_ps_poll_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

static inline void blmac_accept_ps_poll_setf(uint8_t acceptpspoll)
{
    ASSERT_ERR((((uint32_t)acceptpspoll << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)acceptpspoll << 18));
}

static inline uint8_t blmac_accept_ba_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

static inline void blmac_accept_ba_setf(uint8_t acceptba)
{
    ASSERT_ERR((((uint32_t)acceptba << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)acceptba << 17));
}

static inline uint8_t blmac_accept_bar_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

static inline void blmac_accept_bar_setf(uint8_t acceptbar)
{
    ASSERT_ERR((((uint32_t)acceptbar << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)acceptbar << 16));
}

static inline uint8_t blmac_accept_other_mgmt_frames_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

static inline void blmac_accept_other_mgmt_frames_setf(uint8_t acceptothermgmtframes)
{
    ASSERT_ERR((((uint32_t)acceptothermgmtframes << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)acceptothermgmtframes << 15));
}

static inline uint8_t blmac_accept_all_beacon_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

static inline void blmac_accept_all_beacon_setf(uint8_t acceptallbeacon)
{
    ASSERT_ERR((((uint32_t)acceptallbeacon << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)acceptallbeacon << 13));
}

static inline uint8_t blmac_accept_not_expected_ba_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

static inline void blmac_accept_not_expected_ba_setf(uint8_t acceptnotexpectedba)
{
    ASSERT_ERR((((uint32_t)acceptnotexpectedba << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)acceptnotexpectedba << 12));
}

static inline uint8_t blmac_accept_decrypt_error_frames_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

static inline void blmac_accept_decrypt_error_frames_setf(uint8_t acceptdecrypterrorframes)
{
    ASSERT_ERR((((uint32_t)acceptdecrypterrorframes << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)acceptdecrypterrorframes << 11));
}

static inline uint8_t blmac_accept_beacon_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

static inline void blmac_accept_beacon_setf(uint8_t acceptbeacon)
{
    ASSERT_ERR((((uint32_t)acceptbeacon << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)acceptbeacon << 10));
}

static inline uint8_t blmac_accept_probe_resp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

static inline void blmac_accept_probe_resp_setf(uint8_t acceptproberesp)
{
    ASSERT_ERR((((uint32_t)acceptproberesp << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)acceptproberesp << 9));
}

static inline uint8_t blmac_accept_probe_req_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

static inline void blmac_accept_probe_req_setf(uint8_t acceptprobereq)
{
    ASSERT_ERR((((uint32_t)acceptprobereq << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)acceptprobereq << 8));
}

static inline uint8_t blmac_accept_my_unicast_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

static inline void blmac_accept_my_unicast_setf(uint8_t acceptmyunicast)
{
    ASSERT_ERR((((uint32_t)acceptmyunicast << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)acceptmyunicast << 7));
}

static inline uint8_t blmac_accept_unicast_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

static inline void blmac_accept_unicast_setf(uint8_t acceptunicast)
{
    ASSERT_ERR((((uint32_t)acceptunicast << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)acceptunicast << 6));
}

static inline uint8_t blmac_accept_error_frames_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

static inline void blmac_accept_error_frames_setf(uint8_t accepterrorframes)
{
    ASSERT_ERR((((uint32_t)accepterrorframes << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)accepterrorframes << 5));
}

static inline uint8_t blmac_accept_other_bssid_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

static inline void blmac_accept_other_bssid_setf(uint8_t acceptotherbssid)
{
    ASSERT_ERR((((uint32_t)acceptotherbssid << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)acceptotherbssid << 4));
}

