bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_accept_broadcast_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline void blmac_accept_broadcast_setf(uint8_t acceptbroadcast)
{
    ASSERT_ERR((((uint32_t)acceptbroadcast << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)acceptbroadcast << 3));
}

static inline uint8_t blmac_accept_multicast_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

static inline void blmac_accept_multicast_setf(uint8_t acceptmulticast)
{
    ASSERT_ERR((((uint32_t)acceptmulticast << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)acceptmulticast << 2));
}

static inline uint8_t blmac_dont_decrypt_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline void blmac_dont_decrypt_setf(uint8_t dontdecrypt)
{
    ASSERT_ERR((((uint32_t)dontdecrypt << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)dontdecrypt << 1));
}

static inline uint8_t blmac_exc_unencrypted_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_exc_unencrypted_setf(uint8_t excunencrypted)
{
    ASSERT_ERR((((uint32_t)excunencrypted << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_RX_CNTRL_ADDR, (REG_PL_RD(NXMAC_RX_CNTRL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)excunencrypted << 0));
}

/**
 * @brief BCN_CNTRL_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24          noBcnTxTime   0x0
 *     23       impTBTTIn128Us   0
 *  22:16        impTBTTPeriod   0x0
 *  15:00            beaconInt   0x0
 * </pre>
 */
#define NXMAC_BCN_CNTRL_1_ADDR   0x60B00064
#define NXMAC_BCN_CNTRL_1_OFFSET 0x00000064
#define NXMAC_BCN_CNTRL_1_INDEX  0x00000019
#define NXMAC_BCN_CNTRL_1_RESET  0x00000000

static inline uint32_t blmac_bcn_cntrl_1_get(void)
{
    return REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR);
}

static inline void blmac_bcn_cntrl_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BCN_CNTRL_1_ADDR, value);
}

// field definitions
#define NXMAC_NO_BCN_TX_TIME_MASK       ((uint32_t)0xFF000000)
#define NXMAC_NO_BCN_TX_TIME_LSB        24
#define NXMAC_NO_BCN_TX_TIME_WIDTH      ((uint32_t)0x00000008)
#define NXMAC_IMP_TBTT_IN_128_US_BIT    ((uint32_t)0x00800000)
#define NXMAC_IMP_TBTT_IN_128_US_POS    23
#define NXMAC_IMP_TBTT_PERIOD_MASK      ((uint32_t)0x007F0000)
#define NXMAC_IMP_TBTT_PERIOD_LSB       16
#define NXMAC_IMP_TBTT_PERIOD_WIDTH     ((uint32_t)0x00000007)
#define NXMAC_BEACON_INT_MASK           ((uint32_t)0x0000FFFF)
#define NXMAC_BEACON_INT_LSB            0
#define NXMAC_BEACON_INT_WIDTH          ((uint32_t)0x00000010)

#define NXMAC_NO_BCN_TX_TIME_RST        0x0
#define NXMAC_IMP_TBTT_IN_128_US_RST    0x0
#define NXMAC_IMP_TBTT_PERIOD_RST       0x0
#define NXMAC_BEACON_INT_RST            0x0

static inline void blmac_bcn_cntrl_1_pack(uint8_t nobcntxtime, uint8_t imptbttin128us, uint8_t imptbttperiod, uint16_t beaconint)
{
    ASSERT_ERR((((uint32_t)nobcntxtime << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)imptbttin128us << 23) & ~((uint32_t)0x00800000)) == 0);
    ASSERT_ERR((((uint32_t)imptbttperiod << 16) & ~((uint32_t)0x007F0000)) == 0);
    ASSERT_ERR((((uint32_t)beaconint << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_1_ADDR,  ((uint32_t)nobcntxtime << 24) | ((uint32_t)imptbttin128us << 23) | ((uint32_t)imptbttperiod << 16) | ((uint32_t)beaconint << 0));
}

static inline void blmac_bcn_cntrl_1_unpack(uint8_t* nobcntxtime, uint8_t* imptbttin128us, uint8_t* imptbttperiod, uint16_t* beaconint)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR);

    *nobcntxtime = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *imptbttin128us = (localVal & ((uint32_t)0x00800000)) >> 23;
    *imptbttperiod = (localVal & ((uint32_t)0x007F0000)) >> 16;
    *beaconint = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

static inline uint8_t blmac_no_bcn_tx_time_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline void blmac_no_bcn_tx_time_setf(uint8_t nobcntxtime)
{
    ASSERT_ERR((((uint32_t)nobcntxtime << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)nobcntxtime << 24));
}

static inline uint8_t blmac_imp_tbtt_in_128_us_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

static inline void blmac_imp_tbtt_in_128_us_setf(uint8_t imptbttin128us)
{
    ASSERT_ERR((((uint32_t)imptbttin128us << 23) & ~((uint32_t)0x00800000)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR) & ~((uint32_t)0x00800000)) | ((uint32_t)imptbttin128us << 23));
}

static inline uint8_t blmac_imp_tbtt_period_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

static inline void blmac_imp_tbtt_period_setf(uint8_t imptbttperiod)
{
    ASSERT_ERR((((uint32_t)imptbttperiod << 16) & ~((uint32_t)0x007F0000)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR) & ~((uint32_t)0x007F0000)) | ((uint32_t)imptbttperiod << 16));
}

static inline uint16_t blmac_beacon_int_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

static inline void blmac_beacon_int_setf(uint16_t beaconint)
{
    ASSERT_ERR((((uint32_t)beaconint << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_1_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_1_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)beaconint << 0));
}

/**
 * @brief BCN_CNTRL_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:16                  aid   0x0
 *  15:08            timOffset   0x0
 *  07:00      bcnUpdateOffset   0x0
 * </pre>
 */
#define NXMAC_BCN_CNTRL_2_ADDR   0x60B00068
#define NXMAC_BCN_CNTRL_2_OFFSET 0x00000068
#define NXMAC_BCN_CNTRL_2_INDEX  0x0000001A
#define NXMAC_BCN_CNTRL_2_RESET  0x00000000

static inline uint32_t blmac_bcn_cntrl_2_get(void)
{
    return REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR);
}

static inline void blmac_bcn_cntrl_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BCN_CNTRL_2_ADDR, value);
}

