bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_AID_MASK                 ((uint32_t)0x0FFF0000)
#define NXMAC_AID_LSB                  16
#define NXMAC_AID_WIDTH                ((uint32_t)0x0000000C)
#define NXMAC_TIM_OFFSET_MASK          ((uint32_t)0x0000FF00)
#define NXMAC_TIM_OFFSET_LSB           8
#define NXMAC_TIM_OFFSET_WIDTH         ((uint32_t)0x00000008)
#define NXMAC_BCN_UPDATE_OFFSET_MASK   ((uint32_t)0x000000FF)
#define NXMAC_BCN_UPDATE_OFFSET_LSB    0
#define NXMAC_BCN_UPDATE_OFFSET_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_AID_RST                  0x0
#define NXMAC_TIM_OFFSET_RST           0x0
#define NXMAC_BCN_UPDATE_OFFSET_RST    0x0

static inline void blmac_bcn_cntrl_2_pack(uint16_t aid, uint8_t timoffset, uint8_t bcnupdateoffset)
{
    ASSERT_ERR((((uint32_t)aid << 16) & ~((uint32_t)0x0FFF0000)) == 0);
    ASSERT_ERR((((uint32_t)timoffset << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)bcnupdateoffset << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_2_ADDR,  ((uint32_t)aid << 16) | ((uint32_t)timoffset << 8) | ((uint32_t)bcnupdateoffset << 0));
}

static inline void blmac_bcn_cntrl_2_unpack(uint16_t* aid, uint8_t* timoffset, uint8_t* bcnupdateoffset)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR);

    *aid = (localVal & ((uint32_t)0x0FFF0000)) >> 16;
    *timoffset = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *bcnupdateoffset = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_aid_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR);
    return ((localVal & ((uint32_t)0x0FFF0000)) >> 16);
}

static inline void blmac_aid_setf(uint16_t aid)
{
    ASSERT_ERR((((uint32_t)aid << 16) & ~((uint32_t)0x0FFF0000)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_2_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR) & ~((uint32_t)0x0FFF0000)) | ((uint32_t)aid << 16));
}

static inline uint8_t blmac_tim_offset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_tim_offset_setf(uint8_t timoffset)
{
    ASSERT_ERR((((uint32_t)timoffset << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_2_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)timoffset << 8));
}

static inline uint8_t blmac_bcn_update_offset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_bcn_update_offset_setf(uint8_t bcnupdateoffset)
{
    ASSERT_ERR((((uint32_t)bcnupdateoffset << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_BCN_CNTRL_2_ADDR, (REG_PL_RD(NXMAC_BCN_CNTRL_2_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)bcnupdateoffset << 0));
}

/**
 * @brief DTIM_CFP_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31      dtimUpdatedBySW   0
 *  15:08            cfpPeriod   0x0
 *  07:00           dtimPeriod   0x0
 * </pre>
 */
#define NXMAC_DTIM_CFP_1_ADDR   0x60B00090
#define NXMAC_DTIM_CFP_1_OFFSET 0x00000090
#define NXMAC_DTIM_CFP_1_INDEX  0x00000024
#define NXMAC_DTIM_CFP_1_RESET  0x00000000

static inline uint32_t blmac_dtim_cfp_1_get(void)
{
    return REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR);
}

static inline void blmac_dtim_cfp_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DTIM_CFP_1_ADDR, value);
}

// field definitions
#define NXMAC_DTIM_UPDATED_BY_SW_BIT    ((uint32_t)0x80000000)
#define NXMAC_DTIM_UPDATED_BY_SW_POS    31
#define NXMAC_CFP_PERIOD_MASK           ((uint32_t)0x0000FF00)
#define NXMAC_CFP_PERIOD_LSB            8
#define NXMAC_CFP_PERIOD_WIDTH          ((uint32_t)0x00000008)
#define NXMAC_DTIM_PERIOD_MASK          ((uint32_t)0x000000FF)
#define NXMAC_DTIM_PERIOD_LSB           0
#define NXMAC_DTIM_PERIOD_WIDTH         ((uint32_t)0x00000008)

#define NXMAC_DTIM_UPDATED_BY_SW_RST    0x0
#define NXMAC_CFP_PERIOD_RST            0x0
#define NXMAC_DTIM_PERIOD_RST           0x0

static inline void blmac_dtim_cfp_1_pack(uint8_t dtimupdatedbysw, uint8_t cfpperiod, uint8_t dtimperiod)
{
    ASSERT_ERR((((uint32_t)dtimupdatedbysw << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)cfpperiod << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)dtimperiod << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_DTIM_CFP_1_ADDR,  ((uint32_t)dtimupdatedbysw << 31) | ((uint32_t)cfpperiod << 8) | ((uint32_t)dtimperiod << 0));
}

static inline void blmac_dtim_cfp_1_unpack(uint8_t* dtimupdatedbysw, uint8_t* cfpperiod, uint8_t* dtimperiod)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR);

    *dtimupdatedbysw = (localVal & ((uint32_t)0x80000000)) >> 31;
    *cfpperiod = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *dtimperiod = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_dtim_updated_by_sw_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

static inline void blmac_dtim_updated_by_sw_setf(uint8_t dtimupdatedbysw)
{
    ASSERT_ERR((((uint32_t)dtimupdatedbysw << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(NXMAC_DTIM_CFP_1_ADDR, (REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)dtimupdatedbysw << 31));
}

static inline uint8_t blmac_cfp_period_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_cfp_period_setf(uint8_t cfpperiod)
{
    ASSERT_ERR((((uint32_t)cfpperiod << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_DTIM_CFP_1_ADDR, (REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)cfpperiod << 8));
}

static inline uint8_t blmac_dtim_period_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_dtim_period_setf(uint8_t dtimperiod)
{
    ASSERT_ERR((((uint32_t)dtimperiod << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_DTIM_CFP_1_ADDR, (REG_PL_RD(NXMAC_DTIM_CFP_1_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)dtimperiod << 0));
}

/**
 * @brief DTIM_CFP_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00       cfpMaxDuration   0x0
 * </pre>
 */
#define NXMAC_DTIM_CFP_2_ADDR   0x60B00094
#define NXMAC_DTIM_CFP_2_OFFSET 0x00000094
#define NXMAC_DTIM_CFP_2_INDEX  0x00000025
#define NXMAC_DTIM_CFP_2_RESET  0x00000000

static inline uint32_t blmac_dtim_cfp_2_get(void)
{
    return REG_PL_RD(NXMAC_DTIM_CFP_2_ADDR);
}

