bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_dtim_cfp_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DTIM_CFP_2_ADDR, value);
}

// field definitions
#define NXMAC_CFP_MAX_DURATION_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_CFP_MAX_DURATION_LSB    0
#define NXMAC_CFP_MAX_DURATION_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_CFP_MAX_DURATION_RST    0x0

static inline uint16_t blmac_cfp_max_duration_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DTIM_CFP_2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_cfp_max_duration_setf(uint16_t cfpmaxduration)
{
    ASSERT_ERR((((uint32_t)cfpmaxduration << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_DTIM_CFP_2_ADDR, (uint32_t)cfpmaxduration << 0);
}

/**
 * @brief RETRY_LIMITS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08   dot11LongRetryLimit   0x4
 *  07:00   dot11ShortRetryLimit   0x7
 * </pre>
 */
#define NXMAC_RETRY_LIMITS_ADDR   0x60B00098
#define NXMAC_RETRY_LIMITS_OFFSET 0x00000098
#define NXMAC_RETRY_LIMITS_INDEX  0x00000026
#define NXMAC_RETRY_LIMITS_RESET  0x00000407

static inline uint32_t blmac_retry_limits_get(void)
{
    return REG_PL_RD(NXMAC_RETRY_LIMITS_ADDR);
}

static inline void blmac_retry_limits_set(uint32_t value)
{
    REG_PL_WR(NXMAC_RETRY_LIMITS_ADDR, value);
}

// field definitions
#define NXMAC_DOT_11_LONG_RETRY_LIMIT_MASK    ((uint32_t)0x0000FF00)
#define NXMAC_DOT_11_LONG_RETRY_LIMIT_LSB     8
#define NXMAC_DOT_11_LONG_RETRY_LIMIT_WIDTH   ((uint32_t)0x00000008)
#define NXMAC_DOT_11_SHORT_RETRY_LIMIT_MASK   ((uint32_t)0x000000FF)
#define NXMAC_DOT_11_SHORT_RETRY_LIMIT_LSB    0
#define NXMAC_DOT_11_SHORT_RETRY_LIMIT_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_DOT_11_LONG_RETRY_LIMIT_RST     0x4
#define NXMAC_DOT_11_SHORT_RETRY_LIMIT_RST    0x7

static inline void blmac_retry_limits_pack(uint8_t dot11longretrylimit, uint8_t dot11shortretrylimit)
{
    ASSERT_ERR((((uint32_t)dot11longretrylimit << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)dot11shortretrylimit << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_RETRY_LIMITS_ADDR,  ((uint32_t)dot11longretrylimit << 8) | ((uint32_t)dot11shortretrylimit << 0));
}

static inline void blmac_retry_limits_unpack(uint8_t* dot11longretrylimit, uint8_t* dot11shortretrylimit)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RETRY_LIMITS_ADDR);

    *dot11longretrylimit = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *dot11shortretrylimit = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_dot_11_long_retry_limit_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RETRY_LIMITS_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_dot_11_long_retry_limit_setf(uint8_t dot11longretrylimit)
{
    ASSERT_ERR((((uint32_t)dot11longretrylimit << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_RETRY_LIMITS_ADDR, (REG_PL_RD(NXMAC_RETRY_LIMITS_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)dot11longretrylimit << 8));
}

static inline uint8_t blmac_dot_11_short_retry_limit_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RETRY_LIMITS_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_dot_11_short_retry_limit_setf(uint8_t dot11shortretrylimit)
{
    ASSERT_ERR((((uint32_t)dot11shortretrylimit << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_RETRY_LIMITS_ADDR, (REG_PL_RD(NXMAC_RETRY_LIMITS_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)dot11shortretrylimit << 0));
}

/**
 * @brief BB_SERVICE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  28:26            maxPHYNtx   0x2
 *  23:16           bbServiceB   0x0
 *  15:00           bbServiceA   0x0
 * </pre>
 */
#define NXMAC_BB_SERVICE_ADDR   0x60B0009C
#define NXMAC_BB_SERVICE_OFFSET 0x0000009C
#define NXMAC_BB_SERVICE_INDEX  0x00000027
#define NXMAC_BB_SERVICE_RESET  0x08000000

static inline uint32_t blmac_bb_service_get(void)
{
    return REG_PL_RD(NXMAC_BB_SERVICE_ADDR);
}

static inline void blmac_bb_service_set(uint32_t value)
{
    REG_PL_WR(NXMAC_BB_SERVICE_ADDR, value);
}

// field definitions
#define NXMAC_MAX_PHY_NTX_MASK    ((uint32_t)0x1C000000)
#define NXMAC_MAX_PHY_NTX_LSB     26
#define NXMAC_MAX_PHY_NTX_WIDTH   ((uint32_t)0x00000003)
#define NXMAC_BB_SERVICE_B_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_BB_SERVICE_B_LSB    16
#define NXMAC_BB_SERVICE_B_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_BB_SERVICE_A_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_BB_SERVICE_A_LSB    0
#define NXMAC_BB_SERVICE_A_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_MAX_PHY_NTX_RST     0x2
#define NXMAC_BB_SERVICE_B_RST    0x0
#define NXMAC_BB_SERVICE_A_RST    0x0

static inline void blmac_bb_service_pack(uint8_t maxphyntx, uint8_t bbserviceb, uint16_t bbservicea)
{
    ASSERT_ERR((((uint32_t)maxphyntx << 26) & ~((uint32_t)0x1C000000)) == 0);
    ASSERT_ERR((((uint32_t)bbserviceb << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)bbservicea << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_BB_SERVICE_ADDR,  ((uint32_t)maxphyntx << 26) | ((uint32_t)bbserviceb << 16) | ((uint32_t)bbservicea << 0));
}

static inline void blmac_bb_service_unpack(uint8_t* maxphyntx, uint8_t* bbserviceb, uint16_t* bbservicea)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BB_SERVICE_ADDR);

    *maxphyntx = (localVal & ((uint32_t)0x1C000000)) >> 26;
    *bbserviceb = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *bbservicea = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

static inline uint8_t blmac_max_phy_ntx_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BB_SERVICE_ADDR);
    return ((localVal & ((uint32_t)0x1C000000)) >> 26);
}

static inline void blmac_max_phy_ntx_setf(uint8_t maxphyntx)
{
    ASSERT_ERR((((uint32_t)maxphyntx << 26) & ~((uint32_t)0x1C000000)) == 0);
    REG_PL_WR(NXMAC_BB_SERVICE_ADDR, (REG_PL_RD(NXMAC_BB_SERVICE_ADDR) & ~((uint32_t)0x1C000000)) | ((uint32_t)maxphyntx << 26));
}

