bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_bb_service_b_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BB_SERVICE_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_bb_service_b_setf(uint8_t bbserviceb)
{
    ASSERT_ERR((((uint32_t)bbserviceb << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_BB_SERVICE_ADDR, (REG_PL_RD(NXMAC_BB_SERVICE_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)bbserviceb << 16));
}

static inline uint16_t blmac_bb_service_a_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_BB_SERVICE_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

static inline void blmac_bb_service_a_setf(uint16_t bbservicea)
{
    ASSERT_ERR((((uint32_t)bbservicea << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_BB_SERVICE_ADDR, (REG_PL_RD(NXMAC_BB_SERVICE_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)bbservicea << 0));
}

/**
 * @brief MAX_POWER_LEVEL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08      dsssMaxPwrLevel   0x4
 *  07:00      ofdmMaxPwrLevel   0x4
 * </pre>
 */
#define NXMAC_MAX_POWER_LEVEL_ADDR   0x60B000A0
#define NXMAC_MAX_POWER_LEVEL_OFFSET 0x000000A0
#define NXMAC_MAX_POWER_LEVEL_INDEX  0x00000028
#define NXMAC_MAX_POWER_LEVEL_RESET  0x00000404

static inline uint32_t blmac_max_power_level_get(void)
{
    return REG_PL_RD(NXMAC_MAX_POWER_LEVEL_ADDR);
}

static inline void blmac_max_power_level_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAX_POWER_LEVEL_ADDR, value);
}

// field definitions
#define NXMAC_DSSS_MAX_PWR_LEVEL_MASK   ((uint32_t)0x0000FF00)
#define NXMAC_DSSS_MAX_PWR_LEVEL_LSB    8
#define NXMAC_DSSS_MAX_PWR_LEVEL_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_OFDM_MAX_PWR_LEVEL_MASK   ((uint32_t)0x000000FF)
#define NXMAC_OFDM_MAX_PWR_LEVEL_LSB    0
#define NXMAC_OFDM_MAX_PWR_LEVEL_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_DSSS_MAX_PWR_LEVEL_RST    0x4
#define NXMAC_OFDM_MAX_PWR_LEVEL_RST    0x4

static inline void blmac_max_power_level_pack(uint8_t dsssmaxpwrlevel, uint8_t ofdmmaxpwrlevel)
{
    ASSERT_ERR((((uint32_t)dsssmaxpwrlevel << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)ofdmmaxpwrlevel << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_MAX_POWER_LEVEL_ADDR,  ((uint32_t)dsssmaxpwrlevel << 8) | ((uint32_t)ofdmmaxpwrlevel << 0));
}

static inline void blmac_max_power_level_unpack(uint8_t* dsssmaxpwrlevel, uint8_t* ofdmmaxpwrlevel)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAX_POWER_LEVEL_ADDR);

    *dsssmaxpwrlevel = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *ofdmmaxpwrlevel = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_dsss_max_pwr_level_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAX_POWER_LEVEL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_dsss_max_pwr_level_setf(uint8_t dsssmaxpwrlevel)
{
    ASSERT_ERR((((uint32_t)dsssmaxpwrlevel << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_MAX_POWER_LEVEL_ADDR, (REG_PL_RD(NXMAC_MAX_POWER_LEVEL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)dsssmaxpwrlevel << 8));
}

static inline uint8_t blmac_ofdm_max_pwr_level_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAX_POWER_LEVEL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_ofdm_max_pwr_level_setf(uint8_t ofdmmaxpwrlevel)
{
    ASSERT_ERR((((uint32_t)ofdmmaxpwrlevel << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_MAX_POWER_LEVEL_ADDR, (REG_PL_RD(NXMAC_MAX_POWER_LEVEL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)ofdmmaxpwrlevel << 0));
}

/**
 * @brief ENCR_KEY_0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      encrKeyRAMWord0   0x0
 * </pre>
 */
#define NXMAC_ENCR_KEY_0_ADDR   0x60B000AC
#define NXMAC_ENCR_KEY_0_OFFSET 0x000000AC
#define NXMAC_ENCR_KEY_0_INDEX  0x0000002B
#define NXMAC_ENCR_KEY_0_RESET  0x00000000

static inline uint32_t blmac_encr_key_0_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_KEY_0_ADDR);
}

static inline void blmac_encr_key_0_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_KEY_0_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_KEY_RAM_WORD_0_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_KEY_RAM_WORD_0_LSB    0
#define NXMAC_ENCR_KEY_RAM_WORD_0_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_KEY_RAM_WORD_0_RST    0x0

static inline uint32_t blmac_encr_key_ram_word_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_KEY_0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_key_ram_word_0_setf(uint32_t encrkeyramword0)
{
    ASSERT_ERR((((uint32_t)encrkeyramword0 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_KEY_0_ADDR, (uint32_t)encrkeyramword0 << 0);
}

/**
 * @brief ENCR_KEY_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      encrKeyRAMWord1   0x0
 * </pre>
 */
#define NXMAC_ENCR_KEY_1_ADDR   0x60B000B0
#define NXMAC_ENCR_KEY_1_OFFSET 0x000000B0
#define NXMAC_ENCR_KEY_1_INDEX  0x0000002C
#define NXMAC_ENCR_KEY_1_RESET  0x00000000

static inline uint32_t blmac_encr_key_1_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_KEY_1_ADDR);
}

static inline void blmac_encr_key_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_KEY_1_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_KEY_RAM_WORD_1_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_KEY_RAM_WORD_1_LSB    0
#define NXMAC_ENCR_KEY_RAM_WORD_1_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_KEY_RAM_WORD_1_RST    0x0

static inline uint32_t blmac_encr_key_ram_word_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_KEY_1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_key_ram_word_1_setf(uint32_t encrkeyramword1)
{
    ASSERT_ERR((((uint32_t)encrkeyramword1 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_KEY_1_ADDR, (uint32_t)encrkeyramword1 << 0);
}

/**
 * @brief ENCR_KEY_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      encrKeyRAMWord2   0x0
 * </pre>
 */
#define NXMAC_ENCR_KEY_2_ADDR   0x60B000B4
#define NXMAC_ENCR_KEY_2_OFFSET 0x000000B4
#define NXMAC_ENCR_KEY_2_INDEX  0x0000002D
#define NXMAC_ENCR_KEY_2_RESET  0x00000000

