bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint32_t blmac_encr_key_2_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_KEY_2_ADDR);
}

static inline void blmac_encr_key_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_KEY_2_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_KEY_RAM_WORD_2_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_KEY_RAM_WORD_2_LSB    0
#define NXMAC_ENCR_KEY_RAM_WORD_2_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_KEY_RAM_WORD_2_RST    0x0

static inline uint32_t blmac_encr_key_ram_word_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_KEY_2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_key_ram_word_2_setf(uint32_t encrkeyramword2)
{
    ASSERT_ERR((((uint32_t)encrkeyramword2 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_KEY_2_ADDR, (uint32_t)encrkeyramword2 << 0);
}

/**
 * @brief ENCR_KEY_3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      encrKeyRAMWord3   0x0
 * </pre>
 */
#define NXMAC_ENCR_KEY_3_ADDR   0x60B000B8
#define NXMAC_ENCR_KEY_3_OFFSET 0x000000B8
#define NXMAC_ENCR_KEY_3_INDEX  0x0000002E
#define NXMAC_ENCR_KEY_3_RESET  0x00000000

static inline uint32_t blmac_encr_key_3_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_KEY_3_ADDR);
}

static inline void blmac_encr_key_3_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_KEY_3_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_KEY_RAM_WORD_3_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_KEY_RAM_WORD_3_LSB    0
#define NXMAC_ENCR_KEY_RAM_WORD_3_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_KEY_RAM_WORD_3_RST    0x0

static inline uint32_t blmac_encr_key_ram_word_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_KEY_3_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_key_ram_word_3_setf(uint32_t encrkeyramword3)
{
    ASSERT_ERR((((uint32_t)encrkeyramword3 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_KEY_3_ADDR, (uint32_t)encrkeyramword3 << 0);
}

/**
 * @brief ENCR_MAC_ADDR_LOW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00        macAddrRAMLow   0xFFFFFFFF
 * </pre>
 */
#define NXMAC_ENCR_MAC_ADDR_LOW_ADDR   0x60B000BC
#define NXMAC_ENCR_MAC_ADDR_LOW_OFFSET 0x000000BC
#define NXMAC_ENCR_MAC_ADDR_LOW_INDEX  0x0000002F
#define NXMAC_ENCR_MAC_ADDR_LOW_RESET  0xFFFFFFFF

static inline uint32_t blmac_encr_mac_addr_low_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_MAC_ADDR_LOW_ADDR);
}

static inline void blmac_encr_mac_addr_low_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_MAC_ADDR_LOW_ADDR, value);
}

// field definitions
#define NXMAC_MAC_ADDR_RAM_LOW_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_MAC_ADDR_RAM_LOW_LSB    0
#define NXMAC_MAC_ADDR_RAM_LOW_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_MAC_ADDR_RAM_LOW_RST    0xFFFFFFFF

static inline uint32_t blmac_mac_addr_ram_low_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_MAC_ADDR_LOW_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_mac_addr_ram_low_setf(uint32_t macaddrramlow)
{
    ASSERT_ERR((((uint32_t)macaddrramlow << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_MAC_ADDR_LOW_ADDR, (uint32_t)macaddrramlow << 0);
}

/**
 * @brief ENCR_MAC_ADDR_HIGH register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00       macAddrRAMHigh   0xFFFF
 * </pre>
 */
#define NXMAC_ENCR_MAC_ADDR_HIGH_ADDR   0x60B000C0
#define NXMAC_ENCR_MAC_ADDR_HIGH_OFFSET 0x000000C0
#define NXMAC_ENCR_MAC_ADDR_HIGH_INDEX  0x00000030
#define NXMAC_ENCR_MAC_ADDR_HIGH_RESET  0x0000FFFF

static inline uint32_t blmac_encr_mac_addr_high_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_MAC_ADDR_HIGH_ADDR);
}

static inline void blmac_encr_mac_addr_high_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_MAC_ADDR_HIGH_ADDR, value);
}

// field definitions
#define NXMAC_MAC_ADDR_RAM_HIGH_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_MAC_ADDR_RAM_HIGH_LSB    0
#define NXMAC_MAC_ADDR_RAM_HIGH_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_MAC_ADDR_RAM_HIGH_RST    0xFFFF

static inline uint16_t blmac_mac_addr_ram_high_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_MAC_ADDR_HIGH_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_mac_addr_ram_high_setf(uint16_t macaddrramhigh)
{
    ASSERT_ERR((((uint32_t)macaddrramhigh << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_MAC_ADDR_HIGH_ADDR, (uint32_t)macaddrramhigh << 0);
}

/**
 * @brief ENCR_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31              newRead   0
 *     30             newWrite   0
 *  25:16          keyIndexRAM   0x0
 *  10:08             cTypeRAM   0x0
 *  07:04            vlanIDRAM   0x0
 *  03:02               sppRAM   0x0
 *     01         useDefKeyRAM   0
 *     00              cLenRAM   0
 * </pre>
 */
#define NXMAC_ENCR_CNTRL_ADDR   0x60B000C4
#define NXMAC_ENCR_CNTRL_OFFSET 0x000000C4
#define NXMAC_ENCR_CNTRL_INDEX  0x00000031
#define NXMAC_ENCR_CNTRL_RESET  0x00000000

static inline uint32_t blmac_encr_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
}

static inline void blmac_encr_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_NEW_READ_BIT           ((uint32_t)0x80000000)
#define NXMAC_NEW_READ_POS           31
#define NXMAC_NEW_WRITE_BIT          ((uint32_t)0x40000000)
#define NXMAC_NEW_WRITE_POS          30
#define NXMAC_KEY_INDEX_RAM_MASK     ((uint32_t)0x03FF0000)
#define NXMAC_KEY_INDEX_RAM_LSB      16
#define NXMAC_KEY_INDEX_RAM_WIDTH    ((uint32_t)0x0000000A)
#define NXMAC_C_TYPE_RAM_MASK        ((uint32_t)0x00000700)
#define NXMAC_C_TYPE_RAM_LSB         8
#define NXMAC_C_TYPE_RAM_WIDTH       ((uint32_t)0x00000003)
#define NXMAC_VLAN_IDRAM_MASK        ((uint32_t)0x000000F0)
#define NXMAC_VLAN_IDRAM_LSB         4
#define NXMAC_VLAN_IDRAM_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_SPP_RAM_MASK           ((uint32_t)0x0000000C)
#define NXMAC_SPP_RAM_LSB            2
#define NXMAC_SPP_RAM_WIDTH          ((uint32_t)0x00000002)
#define NXMAC_USE_DEF_KEY_RAM_BIT    ((uint32_t)0x00000002)
#define NXMAC_USE_DEF_KEY_RAM_POS    1
#define NXMAC_C_LEN_RAM_BIT          ((uint32_t)0x00000001)
#define NXMAC_C_LEN_RAM_POS          0

#define NXMAC_NEW_READ_RST           0x0
#define NXMAC_NEW_WRITE_RST          0x0
#define NXMAC_KEY_INDEX_RAM_RST      0x0
#define NXMAC_C_TYPE_RAM_RST         0x0
#define NXMAC_VLAN_IDRAM_RST         0x0
#define NXMAC_SPP_RAM_RST            0x0
#define NXMAC_USE_DEF_KEY_RAM_RST    0x0
#define NXMAC_C_LEN_RAM_RST          0x0

