bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_encr_cntrl_pack(uint8_t newread, uint8_t newwrite, uint16_t keyindexram, uint8_t ctyperam, uint8_t vlanidram, uint8_t sppram, uint8_t usedefkeyram, uint8_t clenram)
{
    ASSERT_ERR((((uint32_t)newread << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)newwrite << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)keyindexram << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)ctyperam << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)vlanidram << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)sppram << 2) & ~((uint32_t)0x0000000C)) == 0);
    ASSERT_ERR((((uint32_t)usedefkeyram << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)clenram << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR,  ((uint32_t)newread << 31) | ((uint32_t)newwrite << 30) | ((uint32_t)keyindexram << 16) | ((uint32_t)ctyperam << 8) | ((uint32_t)vlanidram << 4) | ((uint32_t)sppram << 2) | ((uint32_t)usedefkeyram << 1) | ((uint32_t)clenram << 0));
}

static inline void blmac_encr_cntrl_unpack(uint8_t* newread, uint8_t* newwrite, uint16_t* keyindexram, uint8_t* ctyperam, uint8_t* vlanidram, uint8_t* sppram, uint8_t* usedefkeyram, uint8_t* clenram)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);

    *newread = (localVal & ((uint32_t)0x80000000)) >> 31;
    *newwrite = (localVal & ((uint32_t)0x40000000)) >> 30;
    *keyindexram = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *ctyperam = (localVal & ((uint32_t)0x00000700)) >> 8;
    *vlanidram = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *sppram = (localVal & ((uint32_t)0x0000000C)) >> 2;
    *usedefkeyram = (localVal & ((uint32_t)0x00000002)) >> 1;
    *clenram = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_new_read_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

static inline void blmac_new_read_setf(uint8_t newread)
{
    ASSERT_ERR((((uint32_t)newread << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)newread << 31));
}

static inline uint8_t blmac_new_write_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

static inline void blmac_new_write_setf(uint8_t newwrite)
{
    ASSERT_ERR((((uint32_t)newwrite << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)newwrite << 30));
}

static inline uint16_t blmac_key_index_ram_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

static inline void blmac_key_index_ram_setf(uint16_t keyindexram)
{
    ASSERT_ERR((((uint32_t)keyindexram << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)keyindexram << 16));
}

static inline uint8_t blmac_c_type_ram_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

static inline void blmac_c_type_ram_setf(uint8_t ctyperam)
{
    ASSERT_ERR((((uint32_t)ctyperam << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x00000700)) | ((uint32_t)ctyperam << 8));
}

static inline uint8_t blmac_vlan_idram_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_vlan_idram_setf(uint8_t vlanidram)
{
    ASSERT_ERR((((uint32_t)vlanidram << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)vlanidram << 4));
}

static inline uint8_t blmac_spp_ram_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

static inline void blmac_spp_ram_setf(uint8_t sppram)
{
    ASSERT_ERR((((uint32_t)sppram << 2) & ~((uint32_t)0x0000000C)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x0000000C)) | ((uint32_t)sppram << 2));
}

static inline uint8_t blmac_use_def_key_ram_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

static inline void blmac_use_def_key_ram_setf(uint8_t usedefkeyram)
{
    ASSERT_ERR((((uint32_t)usedefkeyram << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)usedefkeyram << 1));
}

static inline uint8_t blmac_c_len_ram_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_c_len_ram_setf(uint8_t clenram)
{
    ASSERT_ERR((((uint32_t)clenram << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_ENCR_CNTRL_ADDR, (REG_PL_RD(NXMAC_ENCR_CNTRL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)clenram << 0));
}

/**
 * @brief ENCR_WPI_INT_KEY_0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00   encrIntKeyRAMWord0   0x0
 * </pre>
 */
#define NXMAC_ENCR_WPI_INT_KEY_0_ADDR   0x60B000C8
#define NXMAC_ENCR_WPI_INT_KEY_0_OFFSET 0x000000C8
#define NXMAC_ENCR_WPI_INT_KEY_0_INDEX  0x00000032
#define NXMAC_ENCR_WPI_INT_KEY_0_RESET  0x00000000

static inline uint32_t blmac_encr_wpi_int_key_0_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_0_ADDR);
}

static inline void blmac_encr_wpi_int_key_0_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_0_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_INT_KEY_RAM_WORD_0_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_INT_KEY_RAM_WORD_0_LSB    0
#define NXMAC_ENCR_INT_KEY_RAM_WORD_0_WIDTH  ((uint32_t)0x00000020)

