bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
#define NXMAC_ENCR_INT_KEY_RAM_WORD_0_RST    0x0

static inline uint32_t blmac_encr_int_key_ram_word_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_int_key_ram_word_0_setf(uint32_t encrintkeyramword0)
{
    ASSERT_ERR((((uint32_t)encrintkeyramword0 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_0_ADDR, (uint32_t)encrintkeyramword0 << 0);
}

/**
 * @brief ENCR_WPI_INT_KEY_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00   encrIntKeyRAMWord1   0x0
 * </pre>
 */
#define NXMAC_ENCR_WPI_INT_KEY_1_ADDR   0x60B000CC
#define NXMAC_ENCR_WPI_INT_KEY_1_OFFSET 0x000000CC
#define NXMAC_ENCR_WPI_INT_KEY_1_INDEX  0x00000033
#define NXMAC_ENCR_WPI_INT_KEY_1_RESET  0x00000000

static inline uint32_t blmac_encr_wpi_int_key_1_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_1_ADDR);
}

static inline void blmac_encr_wpi_int_key_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_1_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_INT_KEY_RAM_WORD_1_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_INT_KEY_RAM_WORD_1_LSB    0
#define NXMAC_ENCR_INT_KEY_RAM_WORD_1_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_INT_KEY_RAM_WORD_1_RST    0x0

static inline uint32_t blmac_encr_int_key_ram_word_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_int_key_ram_word_1_setf(uint32_t encrintkeyramword1)
{
    ASSERT_ERR((((uint32_t)encrintkeyramword1 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_1_ADDR, (uint32_t)encrintkeyramword1 << 0);
}

/**
 * @brief ENCR_WPI_INT_KEY_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00   encrIntKeyRAMWord2   0x0
 * </pre>
 */
#define NXMAC_ENCR_WPI_INT_KEY_2_ADDR   0x60B000D0
#define NXMAC_ENCR_WPI_INT_KEY_2_OFFSET 0x000000D0
#define NXMAC_ENCR_WPI_INT_KEY_2_INDEX  0x00000034
#define NXMAC_ENCR_WPI_INT_KEY_2_RESET  0x00000000

static inline uint32_t blmac_encr_wpi_int_key_2_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_2_ADDR);
}

static inline void blmac_encr_wpi_int_key_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_2_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_INT_KEY_RAM_WORD_2_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_INT_KEY_RAM_WORD_2_LSB    0
#define NXMAC_ENCR_INT_KEY_RAM_WORD_2_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_INT_KEY_RAM_WORD_2_RST    0x0

static inline uint32_t blmac_encr_int_key_ram_word_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_int_key_ram_word_2_setf(uint32_t encrintkeyramword2)
{
    ASSERT_ERR((((uint32_t)encrintkeyramword2 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_2_ADDR, (uint32_t)encrintkeyramword2 << 0);
}

/**
 * @brief ENCR_WPI_INT_KEY_3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00   encrIntKeyRAMWord3   0x0
 * </pre>
 */
#define NXMAC_ENCR_WPI_INT_KEY_3_ADDR   0x60B000D4
#define NXMAC_ENCR_WPI_INT_KEY_3_OFFSET 0x000000D4
#define NXMAC_ENCR_WPI_INT_KEY_3_INDEX  0x00000035
#define NXMAC_ENCR_WPI_INT_KEY_3_RESET  0x00000000

static inline uint32_t blmac_encr_wpi_int_key_3_get(void)
{
    return REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_3_ADDR);
}

static inline void blmac_encr_wpi_int_key_3_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_3_ADDR, value);
}

// field definitions
#define NXMAC_ENCR_INT_KEY_RAM_WORD_3_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ENCR_INT_KEY_RAM_WORD_3_LSB    0
#define NXMAC_ENCR_INT_KEY_RAM_WORD_3_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ENCR_INT_KEY_RAM_WORD_3_RST    0x0

static inline uint32_t blmac_encr_int_key_ram_word_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ENCR_WPI_INT_KEY_3_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_encr_int_key_ram_word_3_setf(uint32_t encrintkeyramword3)
{
    ASSERT_ERR((((uint32_t)encrintkeyramword3 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ENCR_WPI_INT_KEY_3_ADDR, (uint32_t)encrintkeyramword3 << 0);
}

/**
 * @brief RATES register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  11:00      bssBasicRateSet   0x150
 * </pre>
 */
#define NXMAC_RATES_ADDR   0x60B000DC
#define NXMAC_RATES_OFFSET 0x000000DC
#define NXMAC_RATES_INDEX  0x00000037
#define NXMAC_RATES_RESET  0x00000150

static inline uint32_t blmac_rates_get(void)
{
    return REG_PL_RD(NXMAC_RATES_ADDR);
}

static inline void blmac_rates_set(uint32_t value)
{
    REG_PL_WR(NXMAC_RATES_ADDR, value);
}

// field definitions
#define NXMAC_BSS_BASIC_RATE_SET_MASK   ((uint32_t)0x00000FFF)
#define NXMAC_BSS_BASIC_RATE_SET_LSB    0
#define NXMAC_BSS_BASIC_RATE_SET_WIDTH  ((uint32_t)0x0000000C)

#define NXMAC_BSS_BASIC_RATE_SET_RST    0x150

static inline uint16_t blmac_bss_basic_rate_set_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RATES_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000FFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_bss_basic_rate_set_setf(uint16_t bssbasicrateset)
{
    ASSERT_ERR((((uint32_t)bssbasicrateset << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(NXMAC_RATES_ADDR, (uint32_t)bssbasicrateset << 0);
}

/**
 * @brief OLBC register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24            dsssCount   0x0
 *  23:16            ofdmCount   0x0
 *  15:00            olbcTimer   0x0
 * </pre>
 */
#define NXMAC_OLBC_ADDR   0x60B000E0
#define NXMAC_OLBC_OFFSET 0x000000E0
#define NXMAC_OLBC_INDEX  0x00000038
#define NXMAC_OLBC_RESET  0x00000000

static inline uint32_t blmac_olbc_get(void)
{
    return REG_PL_RD(NXMAC_OLBC_ADDR);
}

static inline void blmac_olbc_set(uint32_t value)
{
    REG_PL_WR(NXMAC_OLBC_ADDR, value);
}

