bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_DSSS_COUNT_MASK   ((uint32_t)0xFF000000)
#define NXMAC_DSSS_COUNT_LSB    24
#define NXMAC_DSSS_COUNT_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_OFDM_COUNT_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_OFDM_COUNT_LSB    16
#define NXMAC_OFDM_COUNT_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_OLBC_TIMER_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_OLBC_TIMER_LSB    0
#define NXMAC_OLBC_TIMER_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_DSSS_COUNT_RST    0x0
#define NXMAC_OFDM_COUNT_RST    0x0
#define NXMAC_OLBC_TIMER_RST    0x0

static inline void blmac_olbc_pack(uint8_t dssscount, uint8_t ofdmcount, uint16_t olbctimer)
{
    ASSERT_ERR((((uint32_t)dssscount << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)ofdmcount << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)olbctimer << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_OLBC_ADDR,  ((uint32_t)dssscount << 24) | ((uint32_t)ofdmcount << 16) | ((uint32_t)olbctimer << 0));
}

static inline void blmac_olbc_unpack(uint8_t* dssscount, uint8_t* ofdmcount, uint16_t* olbctimer)
{
    uint32_t localVal = REG_PL_RD(NXMAC_OLBC_ADDR);

    *dssscount = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *ofdmcount = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *olbctimer = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

static inline uint8_t blmac_dsss_count_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_OLBC_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline void blmac_dsss_count_setf(uint8_t dssscount)
{
    ASSERT_ERR((((uint32_t)dssscount << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_PL_WR(NXMAC_OLBC_ADDR, (REG_PL_RD(NXMAC_OLBC_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)dssscount << 24));
}

static inline uint8_t blmac_ofdm_count_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_OLBC_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_ofdm_count_setf(uint8_t ofdmcount)
{
    ASSERT_ERR((((uint32_t)ofdmcount << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_OLBC_ADDR, (REG_PL_RD(NXMAC_OLBC_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)ofdmcount << 16));
}

static inline uint16_t blmac_olbc_timer_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_OLBC_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

static inline void blmac_olbc_timer_setf(uint16_t olbctimer)
{
    ASSERT_ERR((((uint32_t)olbctimer << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_OLBC_ADDR, (REG_PL_RD(NXMAC_OLBC_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)olbctimer << 0));
}

/**
 * @brief TIMINGS_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:18   txChainDelayInMACClk   0x0
 *  17:08    txRFDelayInMACClk   0x0
 *  07:00       macCoreClkFreq   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_1_ADDR   0x60B000E4
#define NXMAC_TIMINGS_1_OFFSET 0x000000E4
#define NXMAC_TIMINGS_1_INDEX  0x00000039
#define NXMAC_TIMINGS_1_RESET  0x00000000

static inline uint32_t blmac_timings_1_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_1_ADDR);
}

static inline void blmac_timings_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_1_ADDR, value);
}

// field definitions
#define NXMAC_TX_CHAIN_DELAY_IN_MAC_CLK_MASK   ((uint32_t)0x0FFC0000)
#define NXMAC_TX_CHAIN_DELAY_IN_MAC_CLK_LSB    18
#define NXMAC_TX_CHAIN_DELAY_IN_MAC_CLK_WIDTH  ((uint32_t)0x0000000A)
#define NXMAC_TX_RF_DELAY_IN_MAC_CLK_MASK      ((uint32_t)0x0003FF00)
#define NXMAC_TX_RF_DELAY_IN_MAC_CLK_LSB       8
#define NXMAC_TX_RF_DELAY_IN_MAC_CLK_WIDTH     ((uint32_t)0x0000000A)
#define NXMAC_MAC_CORE_CLK_FREQ_MASK           ((uint32_t)0x000000FF)
#define NXMAC_MAC_CORE_CLK_FREQ_LSB            0
#define NXMAC_MAC_CORE_CLK_FREQ_WIDTH          ((uint32_t)0x00000008)

#define NXMAC_TX_CHAIN_DELAY_IN_MAC_CLK_RST    0x0
#define NXMAC_TX_RF_DELAY_IN_MAC_CLK_RST       0x0
#define NXMAC_MAC_CORE_CLK_FREQ_RST            0x0

static inline void blmac_timings_1_pack(uint16_t txchaindelayinmacclk, uint16_t txrfdelayinmacclk, uint8_t maccoreclkfreq)
{
    ASSERT_ERR((((uint32_t)txchaindelayinmacclk << 18) & ~((uint32_t)0x0FFC0000)) == 0);
    ASSERT_ERR((((uint32_t)txrfdelayinmacclk << 8) & ~((uint32_t)0x0003FF00)) == 0);
    ASSERT_ERR((((uint32_t)maccoreclkfreq << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_1_ADDR,  ((uint32_t)txchaindelayinmacclk << 18) | ((uint32_t)txrfdelayinmacclk << 8) | ((uint32_t)maccoreclkfreq << 0));
}

static inline void blmac_timings_1_unpack(uint16_t* txchaindelayinmacclk, uint16_t* txrfdelayinmacclk, uint8_t* maccoreclkfreq)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_1_ADDR);

    *txchaindelayinmacclk = (localVal & ((uint32_t)0x0FFC0000)) >> 18;
    *txrfdelayinmacclk = (localVal & ((uint32_t)0x0003FF00)) >> 8;
    *maccoreclkfreq = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_tx_chain_delay_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_1_ADDR);
    return ((localVal & ((uint32_t)0x0FFC0000)) >> 18);
}

static inline void blmac_tx_chain_delay_in_mac_clk_setf(uint16_t txchaindelayinmacclk)
{
    ASSERT_ERR((((uint32_t)txchaindelayinmacclk << 18) & ~((uint32_t)0x0FFC0000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_1_ADDR, (REG_PL_RD(NXMAC_TIMINGS_1_ADDR) & ~((uint32_t)0x0FFC0000)) | ((uint32_t)txchaindelayinmacclk << 18));
}

static inline uint16_t blmac_tx_rf_delay_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_1_ADDR);
    return ((localVal & ((uint32_t)0x0003FF00)) >> 8);
}

static inline void blmac_tx_rf_delay_in_mac_clk_setf(uint16_t txrfdelayinmacclk)
{
    ASSERT_ERR((((uint32_t)txrfdelayinmacclk << 8) & ~((uint32_t)0x0003FF00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_1_ADDR, (REG_PL_RD(NXMAC_TIMINGS_1_ADDR) & ~((uint32_t)0x0003FF00)) | ((uint32_t)txrfdelayinmacclk << 8));
}

static inline uint8_t blmac_mac_core_clk_freq_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_1_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

