bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_mac_core_clk_freq_setf(uint8_t maccoreclkfreq)
{
    ASSERT_ERR((((uint32_t)maccoreclkfreq << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_1_ADDR, (REG_PL_RD(NXMAC_TIMINGS_1_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)maccoreclkfreq << 0));
}

/**
 * @brief TIMINGS_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:08     slotTimeInMACClk   0x0
 *  07:00             slotTime   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_2_ADDR   0x60B000E8
#define NXMAC_TIMINGS_2_OFFSET 0x000000E8
#define NXMAC_TIMINGS_2_INDEX  0x0000003A
#define NXMAC_TIMINGS_2_RESET  0x00000000

static inline uint32_t blmac_timings_2_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_2_ADDR);
}

static inline void blmac_timings_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_2_ADDR, value);
}

// field definitions
#define NXMAC_SLOT_TIME_IN_MAC_CLK_MASK   ((uint32_t)0x00FFFF00)
#define NXMAC_SLOT_TIME_IN_MAC_CLK_LSB    8
#define NXMAC_SLOT_TIME_IN_MAC_CLK_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_SLOT_TIME_MASK              ((uint32_t)0x000000FF)
#define NXMAC_SLOT_TIME_LSB               0
#define NXMAC_SLOT_TIME_WIDTH             ((uint32_t)0x00000008)

#define NXMAC_SLOT_TIME_IN_MAC_CLK_RST    0x0
#define NXMAC_SLOT_TIME_RST               0x0

static inline void blmac_timings_2_pack(uint16_t slottimeinmacclk, uint8_t slottime)
{
    ASSERT_ERR((((uint32_t)slottimeinmacclk << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    ASSERT_ERR((((uint32_t)slottime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_2_ADDR,  ((uint32_t)slottimeinmacclk << 8) | ((uint32_t)slottime << 0));
}

static inline void blmac_timings_2_unpack(uint16_t* slottimeinmacclk, uint8_t* slottime)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_2_ADDR);

    *slottimeinmacclk = (localVal & ((uint32_t)0x00FFFF00)) >> 8;
    *slottime = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_slot_time_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_2_ADDR);
    return ((localVal & ((uint32_t)0x00FFFF00)) >> 8);
}

static inline void blmac_slot_time_in_mac_clk_setf(uint16_t slottimeinmacclk)
{
    ASSERT_ERR((((uint32_t)slottimeinmacclk << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_2_ADDR, (REG_PL_RD(NXMAC_TIMINGS_2_ADDR) & ~((uint32_t)0x00FFFF00)) | ((uint32_t)slottimeinmacclk << 8));
}

static inline uint8_t blmac_slot_time_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_2_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_slot_time_setf(uint8_t slottime)
{
    ASSERT_ERR((((uint32_t)slottime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_2_ADDR, (REG_PL_RD(NXMAC_TIMINGS_2_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)slottime << 0));
}

/**
 * @brief TIMINGS_3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:20    rxRFDelayInMACClk   0x0
 *  19:10   txDelayRFOnInMACClk   0x0
 *  09:00   macProcDelayInMACClk   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_3_ADDR   0x60B000EC
#define NXMAC_TIMINGS_3_OFFSET 0x000000EC
#define NXMAC_TIMINGS_3_INDEX  0x0000003B
#define NXMAC_TIMINGS_3_RESET  0x00000000

static inline uint32_t blmac_timings_3_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_3_ADDR);
}

static inline void blmac_timings_3_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_3_ADDR, value);
}

// field definitions
#define NXMAC_RX_RF_DELAY_IN_MAC_CLK_MASK      ((uint32_t)0x3FF00000)
#define NXMAC_RX_RF_DELAY_IN_MAC_CLK_LSB       20
#define NXMAC_RX_RF_DELAY_IN_MAC_CLK_WIDTH     ((uint32_t)0x0000000A)
#define NXMAC_TX_DELAY_RF_ON_IN_MAC_CLK_MASK   ((uint32_t)0x000FFC00)
#define NXMAC_TX_DELAY_RF_ON_IN_MAC_CLK_LSB    10
#define NXMAC_TX_DELAY_RF_ON_IN_MAC_CLK_WIDTH  ((uint32_t)0x0000000A)
#define NXMAC_MAC_PROC_DELAY_IN_MAC_CLK_MASK   ((uint32_t)0x000003FF)
#define NXMAC_MAC_PROC_DELAY_IN_MAC_CLK_LSB    0
#define NXMAC_MAC_PROC_DELAY_IN_MAC_CLK_WIDTH  ((uint32_t)0x0000000A)

#define NXMAC_RX_RF_DELAY_IN_MAC_CLK_RST       0x0
#define NXMAC_TX_DELAY_RF_ON_IN_MAC_CLK_RST    0x0
#define NXMAC_MAC_PROC_DELAY_IN_MAC_CLK_RST    0x0

static inline void blmac_timings_3_pack(uint16_t rxrfdelayinmacclk, uint16_t txdelayrfoninmacclk, uint16_t macprocdelayinmacclk)
{
    ASSERT_ERR((((uint32_t)rxrfdelayinmacclk << 20) & ~((uint32_t)0x3FF00000)) == 0);
    ASSERT_ERR((((uint32_t)txdelayrfoninmacclk << 10) & ~((uint32_t)0x000FFC00)) == 0);
    ASSERT_ERR((((uint32_t)macprocdelayinmacclk << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_3_ADDR,  ((uint32_t)rxrfdelayinmacclk << 20) | ((uint32_t)txdelayrfoninmacclk << 10) | ((uint32_t)macprocdelayinmacclk << 0));
}

static inline void blmac_timings_3_unpack(uint16_t* rxrfdelayinmacclk, uint16_t* txdelayrfoninmacclk, uint16_t* macprocdelayinmacclk)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_3_ADDR);

    *rxrfdelayinmacclk = (localVal & ((uint32_t)0x3FF00000)) >> 20;
    *txdelayrfoninmacclk = (localVal & ((uint32_t)0x000FFC00)) >> 10;
    *macprocdelayinmacclk = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

static inline uint16_t blmac_rx_rf_delay_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_3_ADDR);
    return ((localVal & ((uint32_t)0x3FF00000)) >> 20);
}

static inline void blmac_rx_rf_delay_in_mac_clk_setf(uint16_t rxrfdelayinmacclk)
{
    ASSERT_ERR((((uint32_t)rxrfdelayinmacclk << 20) & ~((uint32_t)0x3FF00000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_3_ADDR, (REG_PL_RD(NXMAC_TIMINGS_3_ADDR) & ~((uint32_t)0x3FF00000)) | ((uint32_t)rxrfdelayinmacclk << 20));
}

static inline uint16_t blmac_tx_delay_rf_on_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_3_ADDR);
    return ((localVal & ((uint32_t)0x000FFC00)) >> 10);
}

static inline void blmac_tx_delay_rf_on_in_mac_clk_setf(uint16_t txdelayrfoninmacclk)
{
    ASSERT_ERR((((uint32_t)txdelayrfoninmacclk << 10) & ~((uint32_t)0x000FFC00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_3_ADDR, (REG_PL_RD(NXMAC_TIMINGS_3_ADDR) & ~((uint32_t)0x000FFC00)) | ((uint32_t)txdelayrfoninmacclk << 10));
}

static inline uint16_t blmac_mac_proc_delay_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_3_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

static inline void blmac_mac_proc_delay_in_mac_clk_setf(uint16_t macprocdelayinmacclk)
{
    ASSERT_ERR((((uint32_t)macprocdelayinmacclk << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_3_ADDR, (REG_PL_RD(NXMAC_TIMINGS_3_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)macprocdelayinmacclk << 0));
}

/**
 * @brief TIMINGS_4 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22      radioWakeUpTime   0x0
 *  21:12       radioChirpTime   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_4_ADDR   0x60B000F0
#define NXMAC_TIMINGS_4_OFFSET 0x000000F0
#define NXMAC_TIMINGS_4_INDEX  0x0000003C
#define NXMAC_TIMINGS_4_RESET  0x00000000

static inline uint32_t blmac_timings_4_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_4_ADDR);
}

static inline void blmac_timings_4_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_4_ADDR, value);
}

