bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_RADIO_WAKE_UP_TIME_MASK   ((uint32_t)0xFFC00000)
#define NXMAC_RADIO_WAKE_UP_TIME_LSB    22
#define NXMAC_RADIO_WAKE_UP_TIME_WIDTH  ((uint32_t)0x0000000A)
#define NXMAC_RADIO_CHIRP_TIME_MASK     ((uint32_t)0x003FF000)
#define NXMAC_RADIO_CHIRP_TIME_LSB      12
#define NXMAC_RADIO_CHIRP_TIME_WIDTH    ((uint32_t)0x0000000A)

#define NXMAC_RADIO_WAKE_UP_TIME_RST    0x0
#define NXMAC_RADIO_CHIRP_TIME_RST      0x0

static inline void blmac_timings_4_pack(uint16_t radiowakeuptime, uint16_t radiochirptime)
{
    ASSERT_ERR((((uint32_t)radiowakeuptime << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)radiochirptime << 12) & ~((uint32_t)0x003FF000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_4_ADDR,  ((uint32_t)radiowakeuptime << 22) | ((uint32_t)radiochirptime << 12));
}

static inline void blmac_timings_4_unpack(uint16_t* radiowakeuptime, uint16_t* radiochirptime)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_4_ADDR);

    *radiowakeuptime = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *radiochirptime = (localVal & ((uint32_t)0x003FF000)) >> 12;
}

static inline uint16_t blmac_radio_wake_up_time_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_4_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

static inline void blmac_radio_wake_up_time_setf(uint16_t radiowakeuptime)
{
    ASSERT_ERR((((uint32_t)radiowakeuptime << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_4_ADDR, (REG_PL_RD(NXMAC_TIMINGS_4_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)radiowakeuptime << 22));
}

static inline uint16_t blmac_radio_chirp_time_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_4_ADDR);
    return ((localVal & ((uint32_t)0x003FF000)) >> 12);
}

static inline void blmac_radio_chirp_time_setf(uint16_t radiochirptime)
{
    ASSERT_ERR((((uint32_t)radiochirptime << 12) & ~((uint32_t)0x003FF000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_4_ADDR, (REG_PL_RD(NXMAC_TIMINGS_4_ADDR) & ~((uint32_t)0x003FF000)) | ((uint32_t)radiochirptime << 12));
}

/**
 * @brief TIMINGS_5 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:08        sifsBInMACClk   0x0
 *  07:00                sifsB   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_5_ADDR   0x60B000F4
#define NXMAC_TIMINGS_5_OFFSET 0x000000F4
#define NXMAC_TIMINGS_5_INDEX  0x0000003D
#define NXMAC_TIMINGS_5_RESET  0x00000000

static inline uint32_t blmac_timings_5_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_5_ADDR);
}

static inline void blmac_timings_5_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_5_ADDR, value);
}

// field definitions
#define NXMAC_SIFS_B_IN_MAC_CLK_MASK   ((uint32_t)0x00FFFF00)
#define NXMAC_SIFS_B_IN_MAC_CLK_LSB    8
#define NXMAC_SIFS_B_IN_MAC_CLK_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_SIFS_B_MASK              ((uint32_t)0x000000FF)
#define NXMAC_SIFS_B_LSB               0
#define NXMAC_SIFS_B_WIDTH             ((uint32_t)0x00000008)

#define NXMAC_SIFS_B_IN_MAC_CLK_RST    0x0
#define NXMAC_SIFS_B_RST               0x0

static inline void blmac_timings_5_pack(uint16_t sifsbinmacclk, uint8_t sifsb)
{
    ASSERT_ERR((((uint32_t)sifsbinmacclk << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    ASSERT_ERR((((uint32_t)sifsb << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_5_ADDR,  ((uint32_t)sifsbinmacclk << 8) | ((uint32_t)sifsb << 0));
}

static inline void blmac_timings_5_unpack(uint16_t* sifsbinmacclk, uint8_t* sifsb)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_5_ADDR);

    *sifsbinmacclk = (localVal & ((uint32_t)0x00FFFF00)) >> 8;
    *sifsb = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_sifs_b_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_5_ADDR);
    return ((localVal & ((uint32_t)0x00FFFF00)) >> 8);
}

static inline void blmac_sifs_b_in_mac_clk_setf(uint16_t sifsbinmacclk)
{
    ASSERT_ERR((((uint32_t)sifsbinmacclk << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_5_ADDR, (REG_PL_RD(NXMAC_TIMINGS_5_ADDR) & ~((uint32_t)0x00FFFF00)) | ((uint32_t)sifsbinmacclk << 8));
}

static inline uint8_t blmac_sifs_b_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_5_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_sifs_b_setf(uint8_t sifsb)
{
    ASSERT_ERR((((uint32_t)sifsb << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_5_ADDR, (REG_PL_RD(NXMAC_TIMINGS_5_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)sifsb << 0));
}

/**
 * @brief TIMINGS_6 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:08        sifsAInMACClk   0x0
 *  07:00                sifsA   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_6_ADDR   0x60B000F8
#define NXMAC_TIMINGS_6_OFFSET 0x000000F8
#define NXMAC_TIMINGS_6_INDEX  0x0000003E
#define NXMAC_TIMINGS_6_RESET  0x00000000

static inline uint32_t blmac_timings_6_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_6_ADDR);
}

static inline void blmac_timings_6_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_6_ADDR, value);
}

// field definitions
#define NXMAC_SIFS_A_IN_MAC_CLK_MASK   ((uint32_t)0x00FFFF00)
#define NXMAC_SIFS_A_IN_MAC_CLK_LSB    8
#define NXMAC_SIFS_A_IN_MAC_CLK_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_SIFS_A_MASK              ((uint32_t)0x000000FF)
#define NXMAC_SIFS_A_LSB               0
#define NXMAC_SIFS_A_WIDTH             ((uint32_t)0x00000008)

#define NXMAC_SIFS_A_IN_MAC_CLK_RST    0x0
#define NXMAC_SIFS_A_RST               0x0

static inline void blmac_timings_6_pack(uint16_t sifsainmacclk, uint8_t sifsa)
{
    ASSERT_ERR((((uint32_t)sifsainmacclk << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    ASSERT_ERR((((uint32_t)sifsa << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_6_ADDR,  ((uint32_t)sifsainmacclk << 8) | ((uint32_t)sifsa << 0));
}

static inline void blmac_timings_6_unpack(uint16_t* sifsainmacclk, uint8_t* sifsa)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_6_ADDR);

