bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
    *sifsainmacclk = (localVal & ((uint32_t)0x00FFFF00)) >> 8;
    *sifsa = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_sifs_a_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_6_ADDR);
    return ((localVal & ((uint32_t)0x00FFFF00)) >> 8);
}

static inline void blmac_sifs_a_in_mac_clk_setf(uint16_t sifsainmacclk)
{
    ASSERT_ERR((((uint32_t)sifsainmacclk << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_6_ADDR, (REG_PL_RD(NXMAC_TIMINGS_6_ADDR) & ~((uint32_t)0x00FFFF00)) | ((uint32_t)sifsainmacclk << 8));
}

static inline uint8_t blmac_sifs_a_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_6_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_sifs_a_setf(uint8_t sifsa)
{
    ASSERT_ERR((((uint32_t)sifsa << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_6_ADDR, (REG_PL_RD(NXMAC_TIMINGS_6_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)sifsa << 0));
}

/**
 * @brief TIMINGS_7 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  11:08           rxCCADelay   0x0
 *  07:00                 rifs   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_7_ADDR   0x60B000FC
#define NXMAC_TIMINGS_7_OFFSET 0x000000FC
#define NXMAC_TIMINGS_7_INDEX  0x0000003F
#define NXMAC_TIMINGS_7_RESET  0x00000000

static inline uint32_t blmac_timings_7_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_7_ADDR);
}

static inline void blmac_timings_7_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_7_ADDR, value);
}

// field definitions
#define NXMAC_RX_CCA_DELAY_MASK   ((uint32_t)0x00000F00)
#define NXMAC_RX_CCA_DELAY_LSB    8
#define NXMAC_RX_CCA_DELAY_WIDTH  ((uint32_t)0x00000004)
#define NXMAC_RIFS_MASK           ((uint32_t)0x000000FF)
#define NXMAC_RIFS_LSB            0
#define NXMAC_RIFS_WIDTH          ((uint32_t)0x00000008)

#define NXMAC_RX_CCA_DELAY_RST    0x0
#define NXMAC_RIFS_RST            0x0

static inline void blmac_timings_7_pack(uint8_t rxccadelay, uint8_t rifs)
{
    ASSERT_ERR((((uint32_t)rxccadelay << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)rifs << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_7_ADDR,  ((uint32_t)rxccadelay << 8) | ((uint32_t)rifs << 0));
}

static inline void blmac_timings_7_unpack(uint8_t* rxccadelay, uint8_t* rifs)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_7_ADDR);

    *rxccadelay = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *rifs = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_rx_cca_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_7_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline void blmac_rx_cca_delay_setf(uint8_t rxccadelay)
{
    ASSERT_ERR((((uint32_t)rxccadelay << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_7_ADDR, (REG_PL_RD(NXMAC_TIMINGS_7_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)rxccadelay << 8));
}

static inline uint8_t blmac_rifs_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_7_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_rifs_setf(uint8_t rifs)
{
    ASSERT_ERR((((uint32_t)rifs << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_7_ADDR, (REG_PL_RD(NXMAC_TIMINGS_7_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)rifs << 0));
}

/**
 * @brief TIMINGS_8 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24     rxStartDelayMIMO   0x21
 *  23:16    rxStartDelayShort   0x60
 *  15:08     rxStartDelayLong   0xC0
 *  07:00     rxStartDelayOFDM   0x21
 * </pre>
 */
#define NXMAC_TIMINGS_8_ADDR   0x60B00100
#define NXMAC_TIMINGS_8_OFFSET 0x00000100
#define NXMAC_TIMINGS_8_INDEX  0x00000040
#define NXMAC_TIMINGS_8_RESET  0x2160C021

static inline uint32_t blmac_timings_8_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_8_ADDR);
}

static inline void blmac_timings_8_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_8_ADDR, value);
}

// field definitions
#define NXMAC_RX_START_DELAY_MIMO_MASK    ((uint32_t)0xFF000000)
#define NXMAC_RX_START_DELAY_MIMO_LSB     24
#define NXMAC_RX_START_DELAY_MIMO_WIDTH   ((uint32_t)0x00000008)
#define NXMAC_RX_START_DELAY_SHORT_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_RX_START_DELAY_SHORT_LSB    16
#define NXMAC_RX_START_DELAY_SHORT_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_RX_START_DELAY_LONG_MASK    ((uint32_t)0x0000FF00)
#define NXMAC_RX_START_DELAY_LONG_LSB     8
#define NXMAC_RX_START_DELAY_LONG_WIDTH   ((uint32_t)0x00000008)
#define NXMAC_RX_START_DELAY_OFDM_MASK    ((uint32_t)0x000000FF)
#define NXMAC_RX_START_DELAY_OFDM_LSB     0
#define NXMAC_RX_START_DELAY_OFDM_WIDTH   ((uint32_t)0x00000008)

#define NXMAC_RX_START_DELAY_MIMO_RST     0x21
#define NXMAC_RX_START_DELAY_SHORT_RST    0x60
#define NXMAC_RX_START_DELAY_LONG_RST     0xC0
#define NXMAC_RX_START_DELAY_OFDM_RST     0x21

static inline void blmac_timings_8_pack(uint8_t rxstartdelaymimo, uint8_t rxstartdelayshort, uint8_t rxstartdelaylong, uint8_t rxstartdelayofdm)
{
    ASSERT_ERR((((uint32_t)rxstartdelaymimo << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)rxstartdelayshort << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)rxstartdelaylong << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)rxstartdelayofdm << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_8_ADDR,  ((uint32_t)rxstartdelaymimo << 24) | ((uint32_t)rxstartdelayshort << 16) | ((uint32_t)rxstartdelaylong << 8) | ((uint32_t)rxstartdelayofdm << 0));
}

static inline void blmac_timings_8_unpack(uint8_t* rxstartdelaymimo, uint8_t* rxstartdelayshort, uint8_t* rxstartdelaylong, uint8_t* rxstartdelayofdm)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_8_ADDR);

    *rxstartdelaymimo = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *rxstartdelayshort = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *rxstartdelaylong = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *rxstartdelayofdm = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

