bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_rx_start_delay_mimo_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_8_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline void blmac_rx_start_delay_mimo_setf(uint8_t rxstartdelaymimo)
{
    ASSERT_ERR((((uint32_t)rxstartdelaymimo << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_8_ADDR, (REG_PL_RD(NXMAC_TIMINGS_8_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)rxstartdelaymimo << 24));
}

static inline uint8_t blmac_rx_start_delay_short_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_8_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_rx_start_delay_short_setf(uint8_t rxstartdelayshort)
{
    ASSERT_ERR((((uint32_t)rxstartdelayshort << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_8_ADDR, (REG_PL_RD(NXMAC_TIMINGS_8_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)rxstartdelayshort << 16));
}

static inline uint8_t blmac_rx_start_delay_long_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_8_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_rx_start_delay_long_setf(uint8_t rxstartdelaylong)
{
    ASSERT_ERR((((uint32_t)rxstartdelaylong << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_8_ADDR, (REG_PL_RD(NXMAC_TIMINGS_8_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)rxstartdelaylong << 8));
}

static inline uint8_t blmac_rx_start_delay_ofdm_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_8_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_rx_start_delay_ofdm_setf(uint8_t rxstartdelayofdm)
{
    ASSERT_ERR((((uint32_t)rxstartdelayofdm << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_8_ADDR, (REG_PL_RD(NXMAC_TIMINGS_8_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)rxstartdelayofdm << 0));
}

/**
 * @brief TIMINGS_9 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:20       rifsTOInMACClk   0x0
 *  19:10         rifsInMACClk   0x0
 *  09:00   txDMAProcDlyInMACClk   0x0
 * </pre>
 */
#define NXMAC_TIMINGS_9_ADDR   0x60B00104
#define NXMAC_TIMINGS_9_OFFSET 0x00000104
#define NXMAC_TIMINGS_9_INDEX  0x00000041
#define NXMAC_TIMINGS_9_RESET  0x00000000

static inline uint32_t blmac_timings_9_get(void)
{
    return REG_PL_RD(NXMAC_TIMINGS_9_ADDR);
}

static inline void blmac_timings_9_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TIMINGS_9_ADDR, value);
}

// field definitions
#define NXMAC_RIFS_TO_IN_MAC_CLK_MASK           ((uint32_t)0x3FF00000)
#define NXMAC_RIFS_TO_IN_MAC_CLK_LSB            20
#define NXMAC_RIFS_TO_IN_MAC_CLK_WIDTH          ((uint32_t)0x0000000A)
#define NXMAC_RIFS_IN_MAC_CLK_MASK              ((uint32_t)0x000FFC00)
#define NXMAC_RIFS_IN_MAC_CLK_LSB               10
#define NXMAC_RIFS_IN_MAC_CLK_WIDTH             ((uint32_t)0x0000000A)
#define NXMAC_TX_DMA_PROC_DLY_IN_MAC_CLK_MASK   ((uint32_t)0x000003FF)
#define NXMAC_TX_DMA_PROC_DLY_IN_MAC_CLK_LSB    0
#define NXMAC_TX_DMA_PROC_DLY_IN_MAC_CLK_WIDTH  ((uint32_t)0x0000000A)

#define NXMAC_RIFS_TO_IN_MAC_CLK_RST            0x0
#define NXMAC_RIFS_IN_MAC_CLK_RST               0x0
#define NXMAC_TX_DMA_PROC_DLY_IN_MAC_CLK_RST    0x0

static inline void blmac_timings_9_pack(uint16_t rifstoinmacclk, uint16_t rifsinmacclk, uint16_t txdmaprocdlyinmacclk)
{
    ASSERT_ERR((((uint32_t)rifstoinmacclk << 20) & ~((uint32_t)0x3FF00000)) == 0);
    ASSERT_ERR((((uint32_t)rifsinmacclk << 10) & ~((uint32_t)0x000FFC00)) == 0);
    ASSERT_ERR((((uint32_t)txdmaprocdlyinmacclk << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_9_ADDR,  ((uint32_t)rifstoinmacclk << 20) | ((uint32_t)rifsinmacclk << 10) | ((uint32_t)txdmaprocdlyinmacclk << 0));
}

static inline void blmac_timings_9_unpack(uint16_t* rifstoinmacclk, uint16_t* rifsinmacclk, uint16_t* txdmaprocdlyinmacclk)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_9_ADDR);

    *rifstoinmacclk = (localVal & ((uint32_t)0x3FF00000)) >> 20;
    *rifsinmacclk = (localVal & ((uint32_t)0x000FFC00)) >> 10;
    *txdmaprocdlyinmacclk = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

static inline uint16_t blmac_rifs_to_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_9_ADDR);
    return ((localVal & ((uint32_t)0x3FF00000)) >> 20);
}

static inline void blmac_rifs_to_in_mac_clk_setf(uint16_t rifstoinmacclk)
{
    ASSERT_ERR((((uint32_t)rifstoinmacclk << 20) & ~((uint32_t)0x3FF00000)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_9_ADDR, (REG_PL_RD(NXMAC_TIMINGS_9_ADDR) & ~((uint32_t)0x3FF00000)) | ((uint32_t)rifstoinmacclk << 20));
}

static inline uint16_t blmac_rifs_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_9_ADDR);
    return ((localVal & ((uint32_t)0x000FFC00)) >> 10);
}

static inline void blmac_rifs_in_mac_clk_setf(uint16_t rifsinmacclk)
{
    ASSERT_ERR((((uint32_t)rifsinmacclk << 10) & ~((uint32_t)0x000FFC00)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_9_ADDR, (REG_PL_RD(NXMAC_TIMINGS_9_ADDR) & ~((uint32_t)0x000FFC00)) | ((uint32_t)rifsinmacclk << 10));
}

static inline uint16_t blmac_tx_dma_proc_dly_in_mac_clk_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TIMINGS_9_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

static inline void blmac_tx_dma_proc_dly_in_mac_clk_setf(uint16_t txdmaprocdlyinmacclk)
{
    ASSERT_ERR((((uint32_t)txdmaprocdlyinmacclk << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(NXMAC_TIMINGS_9_ADDR, (REG_PL_RD(NXMAC_TIMINGS_9_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txdmaprocdlyinmacclk << 0));
}

/**
 * @brief PROT_TRIG_TIMER register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08     hccaTriggerTimer   0x0
 *  07:00     edcaTriggerTimer   0x9
 * </pre>
 */
#define NXMAC_PROT_TRIG_TIMER_ADDR   0x60B0010C
#define NXMAC_PROT_TRIG_TIMER_OFFSET 0x0000010C
#define NXMAC_PROT_TRIG_TIMER_INDEX  0x00000043
#define NXMAC_PROT_TRIG_TIMER_RESET  0x00000009

