bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint32_t blmac_prot_trig_timer_get(void)
{
    return REG_PL_RD(NXMAC_PROT_TRIG_TIMER_ADDR);
}

static inline void blmac_prot_trig_timer_set(uint32_t value)
{
    REG_PL_WR(NXMAC_PROT_TRIG_TIMER_ADDR, value);
}

// field definitions
#define NXMAC_HCCA_TRIGGER_TIMER_MASK   ((uint32_t)0x0000FF00)
#define NXMAC_HCCA_TRIGGER_TIMER_LSB    8
#define NXMAC_HCCA_TRIGGER_TIMER_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_EDCA_TRIGGER_TIMER_MASK   ((uint32_t)0x000000FF)
#define NXMAC_EDCA_TRIGGER_TIMER_LSB    0
#define NXMAC_EDCA_TRIGGER_TIMER_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_HCCA_TRIGGER_TIMER_RST    0x0
#define NXMAC_EDCA_TRIGGER_TIMER_RST    0x9

static inline void blmac_prot_trig_timer_unpack(uint8_t* hccatriggertimer, uint8_t* edcatriggertimer)
{
    uint32_t localVal = REG_PL_RD(NXMAC_PROT_TRIG_TIMER_ADDR);

    *hccatriggertimer = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *edcatriggertimer = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_hcca_trigger_timer_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_PROT_TRIG_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline uint8_t blmac_edca_trigger_timer_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_PROT_TRIG_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_edca_trigger_timer_setf(uint8_t edcatriggertimer)
{
    ASSERT_ERR((((uint32_t)edcatriggertimer << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_PROT_TRIG_TIMER_ADDR, (uint32_t)edcatriggertimer << 0);
}

/**
 * @brief TX_TRIGGER_TIMER register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08      txPacketTimeout   0xF
 *  07:00    txAbsoluteTimeout   0x9C
 * </pre>
 */
#define NXMAC_TX_TRIGGER_TIMER_ADDR   0x60B00110
#define NXMAC_TX_TRIGGER_TIMER_OFFSET 0x00000110
#define NXMAC_TX_TRIGGER_TIMER_INDEX  0x00000044
#define NXMAC_TX_TRIGGER_TIMER_RESET  0x00000F9C

static inline uint32_t blmac_tx_trigger_timer_get(void)
{
    return REG_PL_RD(NXMAC_TX_TRIGGER_TIMER_ADDR);
}

static inline void blmac_tx_trigger_timer_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TX_TRIGGER_TIMER_ADDR, value);
}

// field definitions
#define NXMAC_TX_PACKET_TIMEOUT_MASK     ((uint32_t)0x0000FF00)
#define NXMAC_TX_PACKET_TIMEOUT_LSB      8
#define NXMAC_TX_PACKET_TIMEOUT_WIDTH    ((uint32_t)0x00000008)
#define NXMAC_TX_ABSOLUTE_TIMEOUT_MASK   ((uint32_t)0x000000FF)
#define NXMAC_TX_ABSOLUTE_TIMEOUT_LSB    0
#define NXMAC_TX_ABSOLUTE_TIMEOUT_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_TX_PACKET_TIMEOUT_RST      0xF
#define NXMAC_TX_ABSOLUTE_TIMEOUT_RST    0x9C

static inline void blmac_tx_trigger_timer_pack(uint8_t txpackettimeout, uint8_t txabsolutetimeout)
{
    ASSERT_ERR((((uint32_t)txpackettimeout << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)txabsolutetimeout << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TX_TRIGGER_TIMER_ADDR,  ((uint32_t)txpackettimeout << 8) | ((uint32_t)txabsolutetimeout << 0));
}

static inline void blmac_tx_trigger_timer_unpack(uint8_t* txpackettimeout, uint8_t* txabsolutetimeout)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_TRIGGER_TIMER_ADDR);

    *txpackettimeout = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *txabsolutetimeout = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_tx_packet_timeout_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_TRIGGER_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_tx_packet_timeout_setf(uint8_t txpackettimeout)
{
    ASSERT_ERR((((uint32_t)txpackettimeout << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_TX_TRIGGER_TIMER_ADDR, (REG_PL_RD(NXMAC_TX_TRIGGER_TIMER_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)txpackettimeout << 8));
}

static inline uint8_t blmac_tx_absolute_timeout_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_TRIGGER_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_tx_absolute_timeout_setf(uint8_t txabsolutetimeout)
{
    ASSERT_ERR((((uint32_t)txabsolutetimeout << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_TX_TRIGGER_TIMER_ADDR, (REG_PL_RD(NXMAC_TX_TRIGGER_TIMER_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)txabsolutetimeout << 0));
}

/**
 * @brief RX_TRIGGER_TIMER register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16   rxPayloadUsedCount   0xF
 *  15:08      rxPacketTimeout   0xF
 *  07:00    rxAbsoluteTimeout   0x9C
 * </pre>
 */
#define NXMAC_RX_TRIGGER_TIMER_ADDR   0x60B00114
#define NXMAC_RX_TRIGGER_TIMER_OFFSET 0x00000114
#define NXMAC_RX_TRIGGER_TIMER_INDEX  0x00000045
#define NXMAC_RX_TRIGGER_TIMER_RESET  0x000F0F9C

static inline uint32_t blmac_rx_trigger_timer_get(void)
{
    return REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR);
}

static inline void blmac_rx_trigger_timer_set(uint32_t value)
{
    REG_PL_WR(NXMAC_RX_TRIGGER_TIMER_ADDR, value);
}

// field definitions
#define NXMAC_RX_PAYLOAD_USED_COUNT_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_RX_PAYLOAD_USED_COUNT_LSB    16
#define NXMAC_RX_PAYLOAD_USED_COUNT_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_RX_PACKET_TIMEOUT_MASK       ((uint32_t)0x0000FF00)
#define NXMAC_RX_PACKET_TIMEOUT_LSB        8
#define NXMAC_RX_PACKET_TIMEOUT_WIDTH      ((uint32_t)0x00000008)
#define NXMAC_RX_ABSOLUTE_TIMEOUT_MASK     ((uint32_t)0x000000FF)
#define NXMAC_RX_ABSOLUTE_TIMEOUT_LSB      0
#define NXMAC_RX_ABSOLUTE_TIMEOUT_WIDTH    ((uint32_t)0x00000008)

#define NXMAC_RX_PAYLOAD_USED_COUNT_RST    0xF
#define NXMAC_RX_PACKET_TIMEOUT_RST        0xF
#define NXMAC_RX_ABSOLUTE_TIMEOUT_RST      0x9C

static inline void blmac_rx_trigger_timer_pack(uint8_t rxpayloadusedcount, uint8_t rxpackettimeout, uint8_t rxabsolutetimeout)
{
    ASSERT_ERR((((uint32_t)rxpayloadusedcount << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)rxpackettimeout << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)rxabsolutetimeout << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_RX_TRIGGER_TIMER_ADDR,  ((uint32_t)rxpayloadusedcount << 16) | ((uint32_t)rxpackettimeout << 8) | ((uint32_t)rxabsolutetimeout << 0));
}

