bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_rx_trigger_timer_unpack(uint8_t* rxpayloadusedcount, uint8_t* rxpackettimeout, uint8_t* rxabsolutetimeout)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR);

    *rxpayloadusedcount = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *rxpackettimeout = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *rxabsolutetimeout = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_rx_payload_used_count_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_rx_payload_used_count_setf(uint8_t rxpayloadusedcount)
{
    ASSERT_ERR((((uint32_t)rxpayloadusedcount << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_RX_TRIGGER_TIMER_ADDR, (REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)rxpayloadusedcount << 16));
}

static inline uint8_t blmac_rx_packet_timeout_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_rx_packet_timeout_setf(uint8_t rxpackettimeout)
{
    ASSERT_ERR((((uint32_t)rxpackettimeout << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_RX_TRIGGER_TIMER_ADDR, (REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)rxpackettimeout << 8));
}

static inline uint8_t blmac_rx_absolute_timeout_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_rx_absolute_timeout_setf(uint8_t rxabsolutetimeout)
{
    ASSERT_ERR((((uint32_t)rxabsolutetimeout << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_RX_TRIGGER_TIMER_ADDR, (REG_PL_RD(NXMAC_RX_TRIGGER_TIMER_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)rxabsolutetimeout << 0));
}

/**
 * @brief MIB_TABLE_WRITE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16             mibValue   0x0
 *     15             mibWrite   0
 *     14     mibIncrementMode   1
 *  09:00        mibTableIndex   0x0
 * </pre>
 */
#define NXMAC_MIB_TABLE_WRITE_ADDR   0x60B00118
#define NXMAC_MIB_TABLE_WRITE_OFFSET 0x00000118
#define NXMAC_MIB_TABLE_WRITE_INDEX  0x00000046
#define NXMAC_MIB_TABLE_WRITE_RESET  0x00004000

static inline uint32_t blmac_mib_table_write_get(void)
{
    return REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR);
}

static inline void blmac_mib_table_write_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MIB_TABLE_WRITE_ADDR, value);
}

// field definitions
#define NXMAC_MIB_VALUE_MASK            ((uint32_t)0xFFFF0000)
#define NXMAC_MIB_VALUE_LSB             16
#define NXMAC_MIB_VALUE_WIDTH           ((uint32_t)0x00000010)
#define NXMAC_MIB_WRITE_BIT             ((uint32_t)0x00008000)
#define NXMAC_MIB_WRITE_POS             15
#define NXMAC_MIB_INCREMENT_MODE_BIT    ((uint32_t)0x00004000)
#define NXMAC_MIB_INCREMENT_MODE_POS    14
#define NXMAC_MIB_TABLE_INDEX_MASK      ((uint32_t)0x000003FF)
#define NXMAC_MIB_TABLE_INDEX_LSB       0
#define NXMAC_MIB_TABLE_INDEX_WIDTH     ((uint32_t)0x0000000A)

#define NXMAC_MIB_VALUE_RST             0x0
#define NXMAC_MIB_WRITE_RST             0x0
#define NXMAC_MIB_INCREMENT_MODE_RST    0x1
#define NXMAC_MIB_TABLE_INDEX_RST       0x0

static inline void blmac_mib_table_write_pack(uint16_t mibvalue, uint8_t mibwrite, uint8_t mibincrementmode, uint16_t mibtableindex)
{
    ASSERT_ERR((((uint32_t)mibvalue << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)mibwrite << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)mibincrementmode << 14) & ~((uint32_t)0x00004000)) == 0);
    ASSERT_ERR((((uint32_t)mibtableindex << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(NXMAC_MIB_TABLE_WRITE_ADDR,  ((uint32_t)mibvalue << 16) | ((uint32_t)mibwrite << 15) | ((uint32_t)mibincrementmode << 14) | ((uint32_t)mibtableindex << 0));
}

static inline void blmac_mib_table_write_unpack(uint16_t* mibvalue, uint8_t* mibwrite, uint8_t* mibincrementmode, uint16_t* mibtableindex)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR);

    *mibvalue = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *mibwrite = (localVal & ((uint32_t)0x00008000)) >> 15;
    *mibincrementmode = (localVal & ((uint32_t)0x00004000)) >> 14;
    *mibtableindex = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

static inline uint16_t blmac_mib_value_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

static inline void blmac_mib_value_setf(uint16_t mibvalue)
{
    ASSERT_ERR((((uint32_t)mibvalue << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_PL_WR(NXMAC_MIB_TABLE_WRITE_ADDR, (REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)mibvalue << 16));
}

static inline uint8_t blmac_mib_write_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

static inline void blmac_mib_write_setf(uint8_t mibwrite)
{
    ASSERT_ERR((((uint32_t)mibwrite << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_PL_WR(NXMAC_MIB_TABLE_WRITE_ADDR, (REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)mibwrite << 15));
}

static inline uint8_t blmac_mib_increment_mode_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

static inline void blmac_mib_increment_mode_setf(uint8_t mibincrementmode)
{
    ASSERT_ERR((((uint32_t)mibincrementmode << 14) & ~((uint32_t)0x00004000)) == 0);
    REG_PL_WR(NXMAC_MIB_TABLE_WRITE_ADDR, (REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR) & ~((uint32_t)0x00004000)) | ((uint32_t)mibincrementmode << 14));
}

static inline uint16_t blmac_mib_table_index_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

static inline void blmac_mib_table_index_setf(uint16_t mibtableindex)
{
    ASSERT_ERR((((uint32_t)mibtableindex << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(NXMAC_MIB_TABLE_WRITE_ADDR, (REG_PL_RD(NXMAC_MIB_TABLE_WRITE_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)mibtableindex << 0));
}

/**
 * @brief MONOTONIC_COUNTER_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00    monotonicCounter1   0x0
 * </pre>
 */
#define NXMAC_MONOTONIC_COUNTER_1_ADDR   0x60B0011C
#define NXMAC_MONOTONIC_COUNTER_1_OFFSET 0x0000011C
#define NXMAC_MONOTONIC_COUNTER_1_INDEX  0x00000047
#define NXMAC_MONOTONIC_COUNTER_1_RESET  0x00000000

static inline uint32_t blmac_monotonic_counter_1_get(void)
{
    return REG_PL_RD(NXMAC_MONOTONIC_COUNTER_1_ADDR);
}

