bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_MONOTONIC_COUNTER_1_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_MONOTONIC_COUNTER_1_LSB    0
#define NXMAC_MONOTONIC_COUNTER_1_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_MONOTONIC_COUNTER_1_RST    0x0

static inline uint32_t blmac_monotonic_counter_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MONOTONIC_COUNTER_1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief MONOTONIC_COUNTER_2_LO register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00   monotonicCounterLow2   0x0
 * </pre>
 */
#define NXMAC_MONOTONIC_COUNTER_2_LO_ADDR   0x60B00120
#define NXMAC_MONOTONIC_COUNTER_2_LO_OFFSET 0x00000120
#define NXMAC_MONOTONIC_COUNTER_2_LO_INDEX  0x00000048
#define NXMAC_MONOTONIC_COUNTER_2_LO_RESET  0x00000000

static inline uint32_t blmac_monotonic_counter_2_lo_get(void)
{
    return REG_PL_RD(NXMAC_MONOTONIC_COUNTER_2_LO_ADDR);
}

// field definitions
#define NXMAC_MONOTONIC_COUNTER_LOW_2_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_MONOTONIC_COUNTER_LOW_2_LSB    0
#define NXMAC_MONOTONIC_COUNTER_LOW_2_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_MONOTONIC_COUNTER_LOW_2_RST    0x0

static inline uint32_t blmac_monotonic_counter_low_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MONOTONIC_COUNTER_2_LO_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief MONOTONIC_COUNTER_2_HI register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00   monotonicCounterHigh2   0x0
 * </pre>
 */
#define NXMAC_MONOTONIC_COUNTER_2_HI_ADDR   0x60B00124
#define NXMAC_MONOTONIC_COUNTER_2_HI_OFFSET 0x00000124
#define NXMAC_MONOTONIC_COUNTER_2_HI_INDEX  0x00000049
#define NXMAC_MONOTONIC_COUNTER_2_HI_RESET  0x00000000

static inline uint32_t blmac_monotonic_counter_2_hi_get(void)
{
    return REG_PL_RD(NXMAC_MONOTONIC_COUNTER_2_HI_ADDR);
}

// field definitions
#define NXMAC_MONOTONIC_COUNTER_HIGH_2_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_MONOTONIC_COUNTER_HIGH_2_LSB    0
#define NXMAC_MONOTONIC_COUNTER_HIGH_2_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_MONOTONIC_COUNTER_HIGH_2_RST    0x0

static inline uint16_t blmac_monotonic_counter_high_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MONOTONIC_COUNTER_2_HI_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief ABS_TIMER register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00        absTimerValue   0x0
 * </pre>
 */
#define NXMAC_ABS_TIMER_ADDR   0x60B00128
#define NXMAC_ABS_TIMER_OFFSET 0x00000128
#define NXMAC_ABS_TIMER_INDEX  0x0000004A
#define NXMAC_ABS_TIMER_RESET  0x00000000
#define NXMAC_ABS_TIMER_COUNT  10

static inline uint32_t blmac_abs_timer_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 9);
    return REG_PL_RD(NXMAC_ABS_TIMER_ADDR + reg_idx * 4);
}

static inline void blmac_abs_timer_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 9);
    REG_PL_WR(NXMAC_ABS_TIMER_ADDR + reg_idx * 4, value);
}

// field definitions
#define NXMAC_ABS_TIMER_VALUE_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_ABS_TIMER_VALUE_LSB    0
#define NXMAC_ABS_TIMER_VALUE_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_ABS_TIMER_VALUE_RST    0x0

static inline uint32_t blmac_abs_timer_value_getf(int reg_idx)
{
    uint32_t localVal;
    ASSERT_ERR(reg_idx <= 9);
    localVal = REG_PL_RD(NXMAC_ABS_TIMER_ADDR + reg_idx * 4);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_abs_timer_value_setf(int reg_idx, uint32_t abstimervalue)
{
    ASSERT_ERR(reg_idx <= 9);
    ASSERT_ERR((((uint32_t)abstimervalue << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ABS_TIMER_ADDR + reg_idx * 4, (uint32_t)abstimervalue << 0);
}

/**
 * @brief MAX_RX_LENGTH register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:00     maxAllowedLength   0xFFFF
 * </pre>
 */
#define NXMAC_MAX_RX_LENGTH_ADDR   0x60B00150
#define NXMAC_MAX_RX_LENGTH_OFFSET 0x00000150
#define NXMAC_MAX_RX_LENGTH_INDEX  0x00000054
#define NXMAC_MAX_RX_LENGTH_RESET  0x0000FFFF

static inline uint32_t blmac_max_rx_length_get(void)
{
    return REG_PL_RD(NXMAC_MAX_RX_LENGTH_ADDR);
}

static inline void blmac_max_rx_length_set(uint32_t value)
{
    REG_PL_WR(NXMAC_MAX_RX_LENGTH_ADDR, value);
}

// field definitions
#define NXMAC_MAX_ALLOWED_LENGTH_MASK   ((uint32_t)0x000FFFFF)
#define NXMAC_MAX_ALLOWED_LENGTH_LSB    0
#define NXMAC_MAX_ALLOWED_LENGTH_WIDTH  ((uint32_t)0x00000014)

#define NXMAC_MAX_ALLOWED_LENGTH_RST    0xFFFF

static inline uint32_t blmac_max_allowed_length_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_MAX_RX_LENGTH_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000FFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_max_allowed_length_setf(uint32_t maxallowedlength)
{
    ASSERT_ERR((((uint32_t)maxallowedlength << 0) & ~((uint32_t)0x000FFFFF)) == 0);
    REG_PL_WR(NXMAC_MAX_RX_LENGTH_ADDR, (uint32_t)maxallowedlength << 0);
}

/**
 * @brief EDCA_AC_0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:12           txOpLimit0   0x0
 *  11:08               cwMax0   0xA
 *  07:04               cwMin0   0x4
 *  03:00               aifsn0   0x7
 * </pre>
 */
#define NXMAC_EDCA_AC_0_ADDR   0x60B00200
#define NXMAC_EDCA_AC_0_OFFSET 0x00000200
#define NXMAC_EDCA_AC_0_INDEX  0x00000080
#define NXMAC_EDCA_AC_0_RESET  0x00000A47

static inline uint32_t blmac_edca_ac_0_get(void)
{
    return REG_PL_RD(NXMAC_EDCA_AC_0_ADDR);
}

static inline void blmac_edca_ac_0_set(uint32_t value)
{
    REG_PL_WR(NXMAC_EDCA_AC_0_ADDR, value);
}

// field definitions
#define NXMAC_TX_OP_LIMIT_0_MASK   ((uint32_t)0x0FFFF000)
#define NXMAC_TX_OP_LIMIT_0_LSB    12
#define NXMAC_TX_OP_LIMIT_0_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_CW_MAX_0_MASK        ((uint32_t)0x00000F00)
#define NXMAC_CW_MAX_0_LSB         8
#define NXMAC_CW_MAX_0_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_CW_MIN_0_MASK        ((uint32_t)0x000000F0)
#define NXMAC_CW_MIN_0_LSB         4
#define NXMAC_CW_MIN_0_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_AIFSN_0_MASK         ((uint32_t)0x0000000F)
#define NXMAC_AIFSN_0_LSB          0
#define NXMAC_AIFSN_0_WIDTH        ((uint32_t)0x00000004)

#define NXMAC_TX_OP_LIMIT_0_RST    0x0
#define NXMAC_CW_MAX_0_RST         0xA
#define NXMAC_CW_MIN_0_RST         0x4
#define NXMAC_AIFSN_0_RST          0x7

static inline void blmac_edca_ac_0_pack(uint16_t txoplimit0, uint8_t cwmax0, uint8_t cwmin0, uint8_t aifsn0)
{
    ASSERT_ERR((((uint32_t)txoplimit0 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    ASSERT_ERR((((uint32_t)cwmax0 << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)cwmin0 << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)aifsn0 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_0_ADDR,  ((uint32_t)txoplimit0 << 12) | ((uint32_t)cwmax0 << 8) | ((uint32_t)cwmin0 << 4) | ((uint32_t)aifsn0 << 0));
}

static inline void blmac_edca_ac_0_unpack(uint16_t* txoplimit0, uint8_t* cwmax0, uint8_t* cwmin0, uint8_t* aifsn0)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_0_ADDR);

    *txoplimit0 = (localVal & ((uint32_t)0x0FFFF000)) >> 12;
    *cwmax0 = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *cwmin0 = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *aifsn0 = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint16_t blmac_tx_op_limit_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_0_ADDR);
    return ((localVal & ((uint32_t)0x0FFFF000)) >> 12);
}

