bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_tx_op_limit_0_setf(uint16_t txoplimit0)
{
    ASSERT_ERR((((uint32_t)txoplimit0 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_0_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_0_ADDR) & ~((uint32_t)0x0FFFF000)) | ((uint32_t)txoplimit0 << 12));
}

static inline uint8_t blmac_cw_max_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_0_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline void blmac_cw_max_0_setf(uint8_t cwmax0)
{
    ASSERT_ERR((((uint32_t)cwmax0 << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_0_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_0_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)cwmax0 << 8));
}

static inline uint8_t blmac_cw_min_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_0_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_cw_min_0_setf(uint8_t cwmin0)
{
    ASSERT_ERR((((uint32_t)cwmin0 << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_0_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_0_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)cwmin0 << 4));
}

static inline uint8_t blmac_aifsn_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_0_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

static inline void blmac_aifsn_0_setf(uint8_t aifsn0)
{
    ASSERT_ERR((((uint32_t)aifsn0 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_0_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_0_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)aifsn0 << 0));
}

/**
 * @brief EDCA_AC_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:12           txOpLimit1   0x0
 *  11:08               cwMax1   0xA
 *  07:04               cwMin1   0x4
 *  03:00               aifsn1   0x3
 * </pre>
 */
#define NXMAC_EDCA_AC_1_ADDR   0x60B00204
#define NXMAC_EDCA_AC_1_OFFSET 0x00000204
#define NXMAC_EDCA_AC_1_INDEX  0x00000081
#define NXMAC_EDCA_AC_1_RESET  0x00000A43

static inline uint32_t blmac_edca_ac_1_get(void)
{
    return REG_PL_RD(NXMAC_EDCA_AC_1_ADDR);
}

static inline void blmac_edca_ac_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_EDCA_AC_1_ADDR, value);
}

// field definitions
#define NXMAC_TX_OP_LIMIT_1_MASK   ((uint32_t)0x0FFFF000)
#define NXMAC_TX_OP_LIMIT_1_LSB    12
#define NXMAC_TX_OP_LIMIT_1_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_CW_MAX_1_MASK        ((uint32_t)0x00000F00)
#define NXMAC_CW_MAX_1_LSB         8
#define NXMAC_CW_MAX_1_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_CW_MIN_1_MASK        ((uint32_t)0x000000F0)
#define NXMAC_CW_MIN_1_LSB         4
#define NXMAC_CW_MIN_1_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_AIFSN_1_MASK         ((uint32_t)0x0000000F)
#define NXMAC_AIFSN_1_LSB          0
#define NXMAC_AIFSN_1_WIDTH        ((uint32_t)0x00000004)

#define NXMAC_TX_OP_LIMIT_1_RST    0x0
#define NXMAC_CW_MAX_1_RST         0xA
#define NXMAC_CW_MIN_1_RST         0x4
#define NXMAC_AIFSN_1_RST          0x3

static inline void blmac_edca_ac_1_pack(uint16_t txoplimit1, uint8_t cwmax1, uint8_t cwmin1, uint8_t aifsn1)
{
    ASSERT_ERR((((uint32_t)txoplimit1 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    ASSERT_ERR((((uint32_t)cwmax1 << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)cwmin1 << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)aifsn1 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_1_ADDR,  ((uint32_t)txoplimit1 << 12) | ((uint32_t)cwmax1 << 8) | ((uint32_t)cwmin1 << 4) | ((uint32_t)aifsn1 << 0));
}

static inline void blmac_edca_ac_1_unpack(uint16_t* txoplimit1, uint8_t* cwmax1, uint8_t* cwmin1, uint8_t* aifsn1)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_1_ADDR);

    *txoplimit1 = (localVal & ((uint32_t)0x0FFFF000)) >> 12;
    *cwmax1 = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *cwmin1 = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *aifsn1 = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint16_t blmac_tx_op_limit_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_1_ADDR);
    return ((localVal & ((uint32_t)0x0FFFF000)) >> 12);
}

static inline void blmac_tx_op_limit_1_setf(uint16_t txoplimit1)
{
    ASSERT_ERR((((uint32_t)txoplimit1 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_1_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_1_ADDR) & ~((uint32_t)0x0FFFF000)) | ((uint32_t)txoplimit1 << 12));
}

static inline uint8_t blmac_cw_max_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_1_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline void blmac_cw_max_1_setf(uint8_t cwmax1)
{
    ASSERT_ERR((((uint32_t)cwmax1 << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_1_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_1_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)cwmax1 << 8));
}

static inline uint8_t blmac_cw_min_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_1_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_cw_min_1_setf(uint8_t cwmin1)
{
    ASSERT_ERR((((uint32_t)cwmin1 << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_1_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_1_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)cwmin1 << 4));
}

static inline uint8_t blmac_aifsn_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_1_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

static inline void blmac_aifsn_1_setf(uint8_t aifsn1)
{
    ASSERT_ERR((((uint32_t)aifsn1 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_1_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_1_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)aifsn1 << 0));
}

/**
 * @brief EDCA_AC_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:12           txOpLimit2   0x5E
 *  11:08               cwMax2   0x4
 *  07:04               cwMin2   0x3
 *  03:00               aifsn2   0x2
 * </pre>
 */
#define NXMAC_EDCA_AC_2_ADDR   0x60B00208
#define NXMAC_EDCA_AC_2_OFFSET 0x00000208
#define NXMAC_EDCA_AC_2_INDEX  0x00000082
#define NXMAC_EDCA_AC_2_RESET  0x0005E432

static inline uint32_t blmac_edca_ac_2_get(void)
{
    return REG_PL_RD(NXMAC_EDCA_AC_2_ADDR);
}

static inline void blmac_edca_ac_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_EDCA_AC_2_ADDR, value);
}

