bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_TX_OP_LIMIT_2_MASK   ((uint32_t)0x0FFFF000)
#define NXMAC_TX_OP_LIMIT_2_LSB    12
#define NXMAC_TX_OP_LIMIT_2_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_CW_MAX_2_MASK        ((uint32_t)0x00000F00)
#define NXMAC_CW_MAX_2_LSB         8
#define NXMAC_CW_MAX_2_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_CW_MIN_2_MASK        ((uint32_t)0x000000F0)
#define NXMAC_CW_MIN_2_LSB         4
#define NXMAC_CW_MIN_2_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_AIFSN_2_MASK         ((uint32_t)0x0000000F)
#define NXMAC_AIFSN_2_LSB          0
#define NXMAC_AIFSN_2_WIDTH        ((uint32_t)0x00000004)

#define NXMAC_TX_OP_LIMIT_2_RST    0x5E
#define NXMAC_CW_MAX_2_RST         0x4
#define NXMAC_CW_MIN_2_RST         0x3
#define NXMAC_AIFSN_2_RST          0x2

static inline void blmac_edca_ac_2_pack(uint16_t txoplimit2, uint8_t cwmax2, uint8_t cwmin2, uint8_t aifsn2)
{
    ASSERT_ERR((((uint32_t)txoplimit2 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    ASSERT_ERR((((uint32_t)cwmax2 << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)cwmin2 << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)aifsn2 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_2_ADDR,  ((uint32_t)txoplimit2 << 12) | ((uint32_t)cwmax2 << 8) | ((uint32_t)cwmin2 << 4) | ((uint32_t)aifsn2 << 0));
}

static inline void blmac_edca_ac_2_unpack(uint16_t* txoplimit2, uint8_t* cwmax2, uint8_t* cwmin2, uint8_t* aifsn2)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_2_ADDR);

    *txoplimit2 = (localVal & ((uint32_t)0x0FFFF000)) >> 12;
    *cwmax2 = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *cwmin2 = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *aifsn2 = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint16_t blmac_tx_op_limit_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_2_ADDR);
    return ((localVal & ((uint32_t)0x0FFFF000)) >> 12);
}

static inline void blmac_tx_op_limit_2_setf(uint16_t txoplimit2)
{
    ASSERT_ERR((((uint32_t)txoplimit2 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_2_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_2_ADDR) & ~((uint32_t)0x0FFFF000)) | ((uint32_t)txoplimit2 << 12));
}

static inline uint8_t blmac_cw_max_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_2_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline void blmac_cw_max_2_setf(uint8_t cwmax2)
{
    ASSERT_ERR((((uint32_t)cwmax2 << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_2_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_2_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)cwmax2 << 8));
}

static inline uint8_t blmac_cw_min_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_2_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_cw_min_2_setf(uint8_t cwmin2)
{
    ASSERT_ERR((((uint32_t)cwmin2 << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_2_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_2_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)cwmin2 << 4));
}

static inline uint8_t blmac_aifsn_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_2_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

static inline void blmac_aifsn_2_setf(uint8_t aifsn2)
{
    ASSERT_ERR((((uint32_t)aifsn2 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_2_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_2_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)aifsn2 << 0));
}

/**
 * @brief EDCA_AC_3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:12           txOpLimit3   0x2F
 *  11:08               cwMax3   0x3
 *  07:04               cwMin3   0x2
 *  03:00               aifsn3   0x2
 * </pre>
 */
#define NXMAC_EDCA_AC_3_ADDR   0x60B0020C
#define NXMAC_EDCA_AC_3_OFFSET 0x0000020C
#define NXMAC_EDCA_AC_3_INDEX  0x00000083
#define NXMAC_EDCA_AC_3_RESET  0x0002F322

static inline uint32_t blmac_edca_ac_3_get(void)
{
    return REG_PL_RD(NXMAC_EDCA_AC_3_ADDR);
}

static inline void blmac_edca_ac_3_set(uint32_t value)
{
    REG_PL_WR(NXMAC_EDCA_AC_3_ADDR, value);
}

// field definitions
#define NXMAC_TX_OP_LIMIT_3_MASK   ((uint32_t)0x0FFFF000)
#define NXMAC_TX_OP_LIMIT_3_LSB    12
#define NXMAC_TX_OP_LIMIT_3_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_CW_MAX_3_MASK        ((uint32_t)0x00000F00)
#define NXMAC_CW_MAX_3_LSB         8
#define NXMAC_CW_MAX_3_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_CW_MIN_3_MASK        ((uint32_t)0x000000F0)
#define NXMAC_CW_MIN_3_LSB         4
#define NXMAC_CW_MIN_3_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_AIFSN_3_MASK         ((uint32_t)0x0000000F)
#define NXMAC_AIFSN_3_LSB          0
#define NXMAC_AIFSN_3_WIDTH        ((uint32_t)0x00000004)

#define NXMAC_TX_OP_LIMIT_3_RST    0x2F
#define NXMAC_CW_MAX_3_RST         0x3
#define NXMAC_CW_MIN_3_RST         0x2
#define NXMAC_AIFSN_3_RST          0x2

static inline void blmac_edca_ac_3_pack(uint16_t txoplimit3, uint8_t cwmax3, uint8_t cwmin3, uint8_t aifsn3)
{
    ASSERT_ERR((((uint32_t)txoplimit3 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    ASSERT_ERR((((uint32_t)cwmax3 << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)cwmin3 << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)aifsn3 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_3_ADDR,  ((uint32_t)txoplimit3 << 12) | ((uint32_t)cwmax3 << 8) | ((uint32_t)cwmin3 << 4) | ((uint32_t)aifsn3 << 0));
}

static inline void blmac_edca_ac_3_unpack(uint16_t* txoplimit3, uint8_t* cwmax3, uint8_t* cwmin3, uint8_t* aifsn3)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_3_ADDR);

    *txoplimit3 = (localVal & ((uint32_t)0x0FFFF000)) >> 12;
    *cwmax3 = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *cwmin3 = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *aifsn3 = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint16_t blmac_tx_op_limit_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_3_ADDR);
    return ((localVal & ((uint32_t)0x0FFFF000)) >> 12);
}

