bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_tx_op_limit_3_setf(uint16_t txoplimit3)
{
    ASSERT_ERR((((uint32_t)txoplimit3 << 12) & ~((uint32_t)0x0FFFF000)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_3_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_3_ADDR) & ~((uint32_t)0x0FFFF000)) | ((uint32_t)txoplimit3 << 12));
}

static inline uint8_t blmac_cw_max_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_3_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline void blmac_cw_max_3_setf(uint8_t cwmax3)
{
    ASSERT_ERR((((uint32_t)cwmax3 << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_3_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_3_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)cwmax3 << 8));
}

static inline uint8_t blmac_cw_min_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_3_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_cw_min_3_setf(uint8_t cwmin3)
{
    ASSERT_ERR((((uint32_t)cwmin3 << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_3_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_3_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)cwmin3 << 4));
}

static inline uint8_t blmac_aifsn_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_AC_3_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

static inline void blmac_aifsn_3_setf(uint8_t aifsn3)
{
    ASSERT_ERR((((uint32_t)aifsn3 << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_EDCA_AC_3_ADDR, (REG_PL_RD(NXMAC_EDCA_AC_3_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)aifsn3 << 0));
}

/**
 * @brief EDCA_CCA_BUSY register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00           ccaBusyDur   0x0
 * </pre>
 */
#define NXMAC_EDCA_CCA_BUSY_ADDR   0x60B00220
#define NXMAC_EDCA_CCA_BUSY_OFFSET 0x00000220
#define NXMAC_EDCA_CCA_BUSY_INDEX  0x00000088
#define NXMAC_EDCA_CCA_BUSY_RESET  0x00000000

static inline uint32_t blmac_edca_cca_busy_get(void)
{
    return REG_PL_RD(NXMAC_EDCA_CCA_BUSY_ADDR);
}

static inline void blmac_edca_cca_busy_set(uint32_t value)
{
    REG_PL_WR(NXMAC_EDCA_CCA_BUSY_ADDR, value);
}

// field definitions
#define NXMAC_CCA_BUSY_DUR_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_CCA_BUSY_DUR_LSB    0
#define NXMAC_CCA_BUSY_DUR_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_CCA_BUSY_DUR_RST    0x0

static inline uint32_t blmac_cca_busy_dur_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_CCA_BUSY_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_cca_busy_dur_setf(uint32_t ccabusydur)
{
    ASSERT_ERR((((uint32_t)ccabusydur << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_EDCA_CCA_BUSY_ADDR, (uint32_t)ccabusydur << 0);
}

/**
 * @brief EDCA_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     05         keepTXOPOpen   0
 *     04    remTXOPInDurField   0
 *     01            sendCFEnd   0
 *     00         sendCFEndNow   0
 * </pre>
 */
#define NXMAC_EDCA_CNTRL_ADDR   0x60B00224
#define NXMAC_EDCA_CNTRL_OFFSET 0x00000224
#define NXMAC_EDCA_CNTRL_INDEX  0x00000089
#define NXMAC_EDCA_CNTRL_RESET  0x00000000

static inline uint32_t blmac_edca_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR);
}

static inline void blmac_edca_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_EDCA_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_KEEP_TXOP_OPEN_BIT           ((uint32_t)0x00000020)
#define NXMAC_KEEP_TXOP_OPEN_POS           5
#define NXMAC_REM_TXOP_IN_DUR_FIELD_BIT    ((uint32_t)0x00000010)
#define NXMAC_REM_TXOP_IN_DUR_FIELD_POS    4
#define NXMAC_SEND_CF_END_BIT              ((uint32_t)0x00000002)
#define NXMAC_SEND_CF_END_POS              1
#define NXMAC_SEND_CF_END_NOW_BIT          ((uint32_t)0x00000001)
#define NXMAC_SEND_CF_END_NOW_POS          0

#define NXMAC_KEEP_TXOP_OPEN_RST           0x0
#define NXMAC_REM_TXOP_IN_DUR_FIELD_RST    0x0
#define NXMAC_SEND_CF_END_RST              0x0
#define NXMAC_SEND_CF_END_NOW_RST          0x0

static inline void blmac_edca_cntrl_pack(uint8_t keeptxopopen, uint8_t remtxopindurfield, uint8_t sendcfend, uint8_t sendcfendnow)
{
    ASSERT_ERR((((uint32_t)keeptxopopen << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)remtxopindurfield << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)sendcfend << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)sendcfendnow << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_EDCA_CNTRL_ADDR,  ((uint32_t)keeptxopopen << 5) | ((uint32_t)remtxopindurfield << 4) | ((uint32_t)sendcfend << 1) | ((uint32_t)sendcfendnow << 0));
}

static inline void blmac_edca_cntrl_unpack(uint8_t* keeptxopopen, uint8_t* remtxopindurfield, uint8_t* sendcfend, uint8_t* sendcfendnow)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR);

    *keeptxopopen = (localVal & ((uint32_t)0x00000020)) >> 5;
    *remtxopindurfield = (localVal & ((uint32_t)0x00000010)) >> 4;
    *sendcfend = (localVal & ((uint32_t)0x00000002)) >> 1;
    *sendcfendnow = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_keep_txop_open_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

static inline void blmac_keep_txop_open_setf(uint8_t keeptxopopen)
{
    ASSERT_ERR((((uint32_t)keeptxopopen << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_PL_WR(NXMAC_EDCA_CNTRL_ADDR, (REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)keeptxopopen << 5));
}

static inline uint8_t blmac_rem_txop_in_dur_field_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

static inline void blmac_rem_txop_in_dur_field_setf(uint8_t remtxopindurfield)
{
    ASSERT_ERR((((uint32_t)remtxopindurfield << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_PL_WR(NXMAC_EDCA_CNTRL_ADDR, (REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)remtxopindurfield << 4));
}

static inline uint8_t blmac_send_cf_end_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

