bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_send_cf_end_setf(uint8_t sendcfend)
{
    ASSERT_ERR((((uint32_t)sendcfend << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(NXMAC_EDCA_CNTRL_ADDR, (REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)sendcfend << 1));
}

static inline uint8_t blmac_send_cf_end_now_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_send_cf_end_now_setf(uint8_t sendcfendnow)
{
    ASSERT_ERR((((uint32_t)sendcfendnow << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_EDCA_CNTRL_ADDR, (REG_PL_RD(NXMAC_EDCA_CNTRL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)sendcfendnow << 0));
}

/**
 * @brief QUIET_ELEMENT_1A register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16       quietDuration1   0x0
 *  15:08         quietPeriod1   0x0
 *  07:00          quietCount1   0x0
 * </pre>
 */
#define NXMAC_QUIET_ELEMENT_1A_ADDR   0x60B00280
#define NXMAC_QUIET_ELEMENT_1A_OFFSET 0x00000280
#define NXMAC_QUIET_ELEMENT_1A_INDEX  0x000000A0
#define NXMAC_QUIET_ELEMENT_1A_RESET  0x00000000

static inline uint32_t blmac_quiet_element_1a_get(void)
{
    return REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR);
}

static inline void blmac_quiet_element_1a_set(uint32_t value)
{
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1A_ADDR, value);
}

// field definitions
#define NXMAC_QUIET_DURATION_1_MASK   ((uint32_t)0xFFFF0000)
#define NXMAC_QUIET_DURATION_1_LSB    16
#define NXMAC_QUIET_DURATION_1_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_QUIET_PERIOD_1_MASK     ((uint32_t)0x0000FF00)
#define NXMAC_QUIET_PERIOD_1_LSB      8
#define NXMAC_QUIET_PERIOD_1_WIDTH    ((uint32_t)0x00000008)
#define NXMAC_QUIET_COUNT_1_MASK      ((uint32_t)0x000000FF)
#define NXMAC_QUIET_COUNT_1_LSB       0
#define NXMAC_QUIET_COUNT_1_WIDTH     ((uint32_t)0x00000008)

#define NXMAC_QUIET_DURATION_1_RST    0x0
#define NXMAC_QUIET_PERIOD_1_RST      0x0
#define NXMAC_QUIET_COUNT_1_RST       0x0

static inline void blmac_quiet_element_1a_pack(uint16_t quietduration1, uint8_t quietperiod1, uint8_t quietcount1)
{
    ASSERT_ERR((((uint32_t)quietduration1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)quietperiod1 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)quietcount1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1A_ADDR,  ((uint32_t)quietduration1 << 16) | ((uint32_t)quietperiod1 << 8) | ((uint32_t)quietcount1 << 0));
}

static inline void blmac_quiet_element_1a_unpack(uint16_t* quietduration1, uint8_t* quietperiod1, uint8_t* quietcount1)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR);

    *quietduration1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *quietperiod1 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *quietcount1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_quiet_duration_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

static inline void blmac_quiet_duration_1_setf(uint16_t quietduration1)
{
    ASSERT_ERR((((uint32_t)quietduration1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1A_ADDR, (REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)quietduration1 << 16));
}

static inline uint8_t blmac_quiet_period_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_quiet_period_1_setf(uint8_t quietperiod1)
{
    ASSERT_ERR((((uint32_t)quietperiod1 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1A_ADDR, (REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)quietperiod1 << 8));
}

static inline uint8_t blmac_quiet_count_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_quiet_count_1_setf(uint8_t quietcount1)
{
    ASSERT_ERR((((uint32_t)quietcount1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1A_ADDR, (REG_PL_RD(NXMAC_QUIET_ELEMENT_1A_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)quietcount1 << 0));
}

/**
 * @brief QUIET_ELEMENT_1B register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00         quietOffset1   0x0
 * </pre>
 */
#define NXMAC_QUIET_ELEMENT_1B_ADDR   0x60B00284
#define NXMAC_QUIET_ELEMENT_1B_OFFSET 0x00000284
#define NXMAC_QUIET_ELEMENT_1B_INDEX  0x000000A1
#define NXMAC_QUIET_ELEMENT_1B_RESET  0x00000000

static inline uint32_t blmac_quiet_element_1b_get(void)
{
    return REG_PL_RD(NXMAC_QUIET_ELEMENT_1B_ADDR);
}

static inline void blmac_quiet_element_1b_set(uint32_t value)
{
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1B_ADDR, value);
}

// field definitions
#define NXMAC_QUIET_OFFSET_1_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_QUIET_OFFSET_1_LSB    0
#define NXMAC_QUIET_OFFSET_1_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_QUIET_OFFSET_1_RST    0x0

static inline uint16_t blmac_quiet_offset_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_1B_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_quiet_offset_1_setf(uint16_t quietoffset1)
{
    ASSERT_ERR((((uint32_t)quietoffset1 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_1B_ADDR, (uint32_t)quietoffset1 << 0);
}

/**
 * @brief QUIET_ELEMENT_2A register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16       quietDuration2   0x0
 *  15:08         quietPeriod2   0x0
 *  07:00          quietCount2   0x0
 * </pre>
 */
#define NXMAC_QUIET_ELEMENT_2A_ADDR   0x60B00288
#define NXMAC_QUIET_ELEMENT_2A_OFFSET 0x00000288
#define NXMAC_QUIET_ELEMENT_2A_INDEX  0x000000A2
#define NXMAC_QUIET_ELEMENT_2A_RESET  0x00000000

static inline uint32_t blmac_quiet_element_2a_get(void)
{
    return REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR);
}

static inline void blmac_quiet_element_2a_set(uint32_t value)
{
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2A_ADDR, value);
}

