bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_QUIET_DURATION_2_MASK   ((uint32_t)0xFFFF0000)
#define NXMAC_QUIET_DURATION_2_LSB    16
#define NXMAC_QUIET_DURATION_2_WIDTH  ((uint32_t)0x00000010)
#define NXMAC_QUIET_PERIOD_2_MASK     ((uint32_t)0x0000FF00)
#define NXMAC_QUIET_PERIOD_2_LSB      8
#define NXMAC_QUIET_PERIOD_2_WIDTH    ((uint32_t)0x00000008)
#define NXMAC_QUIET_COUNT_2_MASK      ((uint32_t)0x000000FF)
#define NXMAC_QUIET_COUNT_2_LSB       0
#define NXMAC_QUIET_COUNT_2_WIDTH     ((uint32_t)0x00000008)

#define NXMAC_QUIET_DURATION_2_RST    0x0
#define NXMAC_QUIET_PERIOD_2_RST      0x0
#define NXMAC_QUIET_COUNT_2_RST       0x0

static inline void blmac_quiet_element_2a_pack(uint16_t quietduration2, uint8_t quietperiod2, uint8_t quietcount2)
{
    ASSERT_ERR((((uint32_t)quietduration2 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)quietperiod2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)quietcount2 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2A_ADDR,  ((uint32_t)quietduration2 << 16) | ((uint32_t)quietperiod2 << 8) | ((uint32_t)quietcount2 << 0));
}

static inline void blmac_quiet_element_2a_unpack(uint16_t* quietduration2, uint8_t* quietperiod2, uint8_t* quietcount2)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR);

    *quietduration2 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *quietperiod2 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *quietcount2 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint16_t blmac_quiet_duration_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

static inline void blmac_quiet_duration_2_setf(uint16_t quietduration2)
{
    ASSERT_ERR((((uint32_t)quietduration2 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2A_ADDR, (REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)quietduration2 << 16));
}

static inline uint8_t blmac_quiet_period_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_quiet_period_2_setf(uint8_t quietperiod2)
{
    ASSERT_ERR((((uint32_t)quietperiod2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2A_ADDR, (REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)quietperiod2 << 8));
}

static inline uint8_t blmac_quiet_count_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_quiet_count_2_setf(uint8_t quietcount2)
{
    ASSERT_ERR((((uint32_t)quietcount2 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2A_ADDR, (REG_PL_RD(NXMAC_QUIET_ELEMENT_2A_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)quietcount2 << 0));
}

/**
 * @brief QUIET_ELEMENT_2B register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00         quietOffset2   0x0
 * </pre>
 */
#define NXMAC_QUIET_ELEMENT_2B_ADDR   0x60B0028C
#define NXMAC_QUIET_ELEMENT_2B_OFFSET 0x0000028C
#define NXMAC_QUIET_ELEMENT_2B_INDEX  0x000000A3
#define NXMAC_QUIET_ELEMENT_2B_RESET  0x00000000

static inline uint32_t blmac_quiet_element_2b_get(void)
{
    return REG_PL_RD(NXMAC_QUIET_ELEMENT_2B_ADDR);
}

static inline void blmac_quiet_element_2b_set(uint32_t value)
{
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2B_ADDR, value);
}

// field definitions
#define NXMAC_QUIET_OFFSET_2_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_QUIET_OFFSET_2_LSB    0
#define NXMAC_QUIET_OFFSET_2_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_QUIET_OFFSET_2_RST    0x0

static inline uint16_t blmac_quiet_offset_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_QUIET_ELEMENT_2B_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_quiet_offset_2_setf(uint16_t quietoffset2)
{
    ASSERT_ERR((((uint32_t)quietoffset2 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_QUIET_ELEMENT_2B_ADDR, (uint32_t)quietoffset2 << 0);
}

/**
 * @brief ADD_CCA_BUSY_SEC_20 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      ccaBusyDurSec20   0x0
 * </pre>
 */
#define NXMAC_ADD_CCA_BUSY_SEC_20_ADDR   0x60B00290
#define NXMAC_ADD_CCA_BUSY_SEC_20_OFFSET 0x00000290
#define NXMAC_ADD_CCA_BUSY_SEC_20_INDEX  0x000000A4
#define NXMAC_ADD_CCA_BUSY_SEC_20_RESET  0x00000000

static inline uint32_t blmac_add_cca_busy_sec_20_get(void)
{
    return REG_PL_RD(NXMAC_ADD_CCA_BUSY_SEC_20_ADDR);
}

static inline void blmac_add_cca_busy_sec_20_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ADD_CCA_BUSY_SEC_20_ADDR, value);
}

// field definitions
#define NXMAC_CCA_BUSY_DUR_SEC_20_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_CCA_BUSY_DUR_SEC_20_LSB    0
#define NXMAC_CCA_BUSY_DUR_SEC_20_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_CCA_BUSY_DUR_SEC_20_RST    0x0

static inline uint32_t blmac_cca_busy_dur_sec_20_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ADD_CCA_BUSY_SEC_20_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_cca_busy_dur_sec_20_setf(uint32_t ccabusydursec20)
{
    ASSERT_ERR((((uint32_t)ccabusydursec20 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ADD_CCA_BUSY_SEC_20_ADDR, (uint32_t)ccabusydursec20 << 0);
}

/**
 * @brief ADD_CCA_BUSY_SEC_40 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      ccaBusyDurSec40   0x0
 * </pre>
 */
#define NXMAC_ADD_CCA_BUSY_SEC_40_ADDR   0x60B00294
#define NXMAC_ADD_CCA_BUSY_SEC_40_OFFSET 0x00000294
#define NXMAC_ADD_CCA_BUSY_SEC_40_INDEX  0x000000A5
#define NXMAC_ADD_CCA_BUSY_SEC_40_RESET  0x00000000

static inline uint32_t blmac_add_cca_busy_sec_40_get(void)
{
    return REG_PL_RD(NXMAC_ADD_CCA_BUSY_SEC_40_ADDR);
}

static inline void blmac_add_cca_busy_sec_40_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ADD_CCA_BUSY_SEC_40_ADDR, value);
}

