bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_CCA_BUSY_DUR_SEC_40_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_CCA_BUSY_DUR_SEC_40_LSB    0
#define NXMAC_CCA_BUSY_DUR_SEC_40_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_CCA_BUSY_DUR_SEC_40_RST    0x0

static inline uint32_t blmac_cca_busy_dur_sec_40_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ADD_CCA_BUSY_SEC_40_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_cca_busy_dur_sec_40_setf(uint32_t ccabusydursec40)
{
    ASSERT_ERR((((uint32_t)ccabusydursec40 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ADD_CCA_BUSY_SEC_40_ADDR, (uint32_t)ccabusydursec40 << 0);
}

/**
 * @brief ADD_CCA_BUSY_SEC_80 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00      ccaBusyDurSec80   0x0
 * </pre>
 */
#define NXMAC_ADD_CCA_BUSY_SEC_80_ADDR   0x60B00298
#define NXMAC_ADD_CCA_BUSY_SEC_80_OFFSET 0x00000298
#define NXMAC_ADD_CCA_BUSY_SEC_80_INDEX  0x000000A6
#define NXMAC_ADD_CCA_BUSY_SEC_80_RESET  0x00000000

static inline uint32_t blmac_add_cca_busy_sec_80_get(void)
{
    return REG_PL_RD(NXMAC_ADD_CCA_BUSY_SEC_80_ADDR);
}

static inline void blmac_add_cca_busy_sec_80_set(uint32_t value)
{
    REG_PL_WR(NXMAC_ADD_CCA_BUSY_SEC_80_ADDR, value);
}

// field definitions
#define NXMAC_CCA_BUSY_DUR_SEC_80_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_CCA_BUSY_DUR_SEC_80_LSB    0
#define NXMAC_CCA_BUSY_DUR_SEC_80_WIDTH  ((uint32_t)0x00000020)

#define NXMAC_CCA_BUSY_DUR_SEC_80_RST    0x0

static inline uint32_t blmac_cca_busy_dur_sec_80_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_ADD_CCA_BUSY_SEC_80_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_cca_busy_dur_sec_80_setf(uint32_t ccabusydursec80)
{
    ASSERT_ERR((((uint32_t)ccabusydursec80 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(NXMAC_ADD_CCA_BUSY_SEC_80_ADDR, (uint32_t)ccabusydursec80 << 0);
}

/**
 * @brief STBC_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:25         basicSTBCMCS   0x0
 *     24          dualCTSProt   0
 *  23:16           ctsSTBCDur   0x0
 *  15:00         cfEndSTBCDur   0x0
 * </pre>
 */
#define NXMAC_STBC_CNTRL_ADDR   0x60B00300
#define NXMAC_STBC_CNTRL_OFFSET 0x00000300
#define NXMAC_STBC_CNTRL_INDEX  0x000000C0
#define NXMAC_STBC_CNTRL_RESET  0x00000000

static inline uint32_t blmac_stbc_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_STBC_CNTRL_ADDR);
}

static inline void blmac_stbc_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_STBC_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_BASIC_STBCMCS_MASK     ((uint32_t)0xFE000000)
#define NXMAC_BASIC_STBCMCS_LSB      25
#define NXMAC_BASIC_STBCMCS_WIDTH    ((uint32_t)0x00000007)
#define NXMAC_DUAL_CTS_PROT_BIT      ((uint32_t)0x01000000)
#define NXMAC_DUAL_CTS_PROT_POS      24
#define NXMAC_CTS_STBC_DUR_MASK      ((uint32_t)0x00FF0000)
#define NXMAC_CTS_STBC_DUR_LSB       16
#define NXMAC_CTS_STBC_DUR_WIDTH     ((uint32_t)0x00000008)
#define NXMAC_CF_END_STBC_DUR_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_CF_END_STBC_DUR_LSB    0
#define NXMAC_CF_END_STBC_DUR_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_BASIC_STBCMCS_RST      0x0
#define NXMAC_DUAL_CTS_PROT_RST      0x0
#define NXMAC_CTS_STBC_DUR_RST       0x0
#define NXMAC_CF_END_STBC_DUR_RST    0x0

static inline void blmac_stbc_cntrl_pack(uint8_t basicstbcmcs, uint8_t dualctsprot, uint8_t ctsstbcdur, uint16_t cfendstbcdur)
{
    ASSERT_ERR((((uint32_t)basicstbcmcs << 25) & ~((uint32_t)0xFE000000)) == 0);
    ASSERT_ERR((((uint32_t)dualctsprot << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)ctsstbcdur << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)cfendstbcdur << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_STBC_CNTRL_ADDR,  ((uint32_t)basicstbcmcs << 25) | ((uint32_t)dualctsprot << 24) | ((uint32_t)ctsstbcdur << 16) | ((uint32_t)cfendstbcdur << 0));
}

static inline void blmac_stbc_cntrl_unpack(uint8_t* basicstbcmcs, uint8_t* dualctsprot, uint8_t* ctsstbcdur, uint16_t* cfendstbcdur)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STBC_CNTRL_ADDR);

    *basicstbcmcs = (localVal & ((uint32_t)0xFE000000)) >> 25;
    *dualctsprot = (localVal & ((uint32_t)0x01000000)) >> 24;
    *ctsstbcdur = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *cfendstbcdur = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

static inline uint8_t blmac_basic_stbcmcs_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STBC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0xFE000000)) >> 25);
}

static inline void blmac_basic_stbcmcs_setf(uint8_t basicstbcmcs)
{
    ASSERT_ERR((((uint32_t)basicstbcmcs << 25) & ~((uint32_t)0xFE000000)) == 0);
    REG_PL_WR(NXMAC_STBC_CNTRL_ADDR, (REG_PL_RD(NXMAC_STBC_CNTRL_ADDR) & ~((uint32_t)0xFE000000)) | ((uint32_t)basicstbcmcs << 25));
}

static inline uint8_t blmac_dual_cts_prot_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STBC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

static inline void blmac_dual_cts_prot_setf(uint8_t dualctsprot)
{
    ASSERT_ERR((((uint32_t)dualctsprot << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_PL_WR(NXMAC_STBC_CNTRL_ADDR, (REG_PL_RD(NXMAC_STBC_CNTRL_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)dualctsprot << 24));
}

static inline uint8_t blmac_cts_stbc_dur_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STBC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_cts_stbc_dur_setf(uint8_t ctsstbcdur)
{
    ASSERT_ERR((((uint32_t)ctsstbcdur << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_STBC_CNTRL_ADDR, (REG_PL_RD(NXMAC_STBC_CNTRL_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)ctsstbcdur << 16));
}

static inline uint16_t blmac_cf_end_stbc_dur_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_STBC_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

static inline void blmac_cf_end_stbc_dur_setf(uint16_t cfendstbcdur)
{
    ASSERT_ERR((((uint32_t)cfendstbcdur << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_STBC_CNTRL_ADDR, (REG_PL_RD(NXMAC_STBC_CNTRL_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)cfendstbcdur << 0));
}

/**
 * @brief START_TX_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:28            startTxBW   0x0
 *     27       startTxPreType   0
 *  26:24     startTxFormatMod   0x0
 *  23:16     startTxMCSIndex0   0x0
 *  15:06      startTxKSRIndex   0x0
 *  04:03            startTxAC   0x0
 *  02:01     startTxFrmExType   0x0
 *     00       startTxFrameEx   0
 * </pre>
 */
#define NXMAC_START_TX_1_ADDR   0x60B00304
#define NXMAC_START_TX_1_OFFSET 0x00000304
#define NXMAC_START_TX_1_INDEX  0x000000C1
#define NXMAC_START_TX_1_RESET  0x00000000

static inline uint32_t blmac_start_tx_1_get(void)
{
    return REG_PL_RD(NXMAC_START_TX_1_ADDR);
}

static inline void blmac_start_tx_1_set(uint32_t value)
{
    REG_PL_WR(NXMAC_START_TX_1_ADDR, value);
}

