bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
// field definitions
#define NXMAC_START_TX_BW_MASK            ((uint32_t)0x30000000)
#define NXMAC_START_TX_BW_LSB             28
#define NXMAC_START_TX_BW_WIDTH           ((uint32_t)0x00000002)
#define NXMAC_START_TX_PRE_TYPE_BIT       ((uint32_t)0x08000000)
#define NXMAC_START_TX_PRE_TYPE_POS       27
#define NXMAC_START_TX_FORMAT_MOD_MASK    ((uint32_t)0x07000000)
#define NXMAC_START_TX_FORMAT_MOD_LSB     24
#define NXMAC_START_TX_FORMAT_MOD_WIDTH   ((uint32_t)0x00000003)
#define NXMAC_START_TX_MCS_INDEX_0_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_START_TX_MCS_INDEX_0_LSB    16
#define NXMAC_START_TX_MCS_INDEX_0_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_START_TX_KSR_INDEX_MASK     ((uint32_t)0x0000FFC0)
#define NXMAC_START_TX_KSR_INDEX_LSB      6
#define NXMAC_START_TX_KSR_INDEX_WIDTH    ((uint32_t)0x0000000A)
#define NXMAC_START_TX_AC_MASK            ((uint32_t)0x00000018)
#define NXMAC_START_TX_AC_LSB             3
#define NXMAC_START_TX_AC_WIDTH           ((uint32_t)0x00000002)
#define NXMAC_START_TX_FRM_EX_TYPE_MASK   ((uint32_t)0x00000006)
#define NXMAC_START_TX_FRM_EX_TYPE_LSB    1
#define NXMAC_START_TX_FRM_EX_TYPE_WIDTH  ((uint32_t)0x00000002)
#define NXMAC_START_TX_FRAME_EX_BIT       ((uint32_t)0x00000001)
#define NXMAC_START_TX_FRAME_EX_POS       0

#define NXMAC_START_TX_BW_RST             0x0
#define NXMAC_START_TX_PRE_TYPE_RST       0x0
#define NXMAC_START_TX_FORMAT_MOD_RST     0x0
#define NXMAC_START_TX_MCS_INDEX_0_RST    0x0
#define NXMAC_START_TX_KSR_INDEX_RST      0x0
#define NXMAC_START_TX_AC_RST             0x0
#define NXMAC_START_TX_FRM_EX_TYPE_RST    0x0
#define NXMAC_START_TX_FRAME_EX_RST       0x0

static inline void blmac_start_tx_1_pack(uint8_t starttxbw, uint8_t starttxpretype, uint8_t starttxformatmod, uint8_t starttxmcsindex0, uint16_t starttxksrindex, uint8_t starttxac, uint8_t starttxfrmextype, uint8_t starttxframeex)
{
    ASSERT_ERR((((uint32_t)starttxbw << 28) & ~((uint32_t)0x30000000)) == 0);
    ASSERT_ERR((((uint32_t)starttxpretype << 27) & ~((uint32_t)0x08000000)) == 0);
    ASSERT_ERR((((uint32_t)starttxformatmod << 24) & ~((uint32_t)0x07000000)) == 0);
    ASSERT_ERR((((uint32_t)starttxmcsindex0 << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)starttxksrindex << 6) & ~((uint32_t)0x0000FFC0)) == 0);
    ASSERT_ERR((((uint32_t)starttxac << 3) & ~((uint32_t)0x00000018)) == 0);
    ASSERT_ERR((((uint32_t)starttxfrmextype << 1) & ~((uint32_t)0x00000006)) == 0);
    ASSERT_ERR((((uint32_t)starttxframeex << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR,  ((uint32_t)starttxbw << 28) | ((uint32_t)starttxpretype << 27) | ((uint32_t)starttxformatmod << 24) | ((uint32_t)starttxmcsindex0 << 16) | ((uint32_t)starttxksrindex << 6) | ((uint32_t)starttxac << 3) | ((uint32_t)starttxfrmextype << 1) | ((uint32_t)starttxframeex << 0));
}

static inline void blmac_start_tx_1_unpack(uint8_t* starttxbw, uint8_t* starttxpretype, uint8_t* starttxformatmod, uint8_t* starttxmcsindex0, uint16_t* starttxksrindex, uint8_t* starttxac, uint8_t* starttxfrmextype, uint8_t* starttxframeex)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);

    *starttxbw = (localVal & ((uint32_t)0x30000000)) >> 28;
    *starttxpretype = (localVal & ((uint32_t)0x08000000)) >> 27;
    *starttxformatmod = (localVal & ((uint32_t)0x07000000)) >> 24;
    *starttxmcsindex0 = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *starttxksrindex = (localVal & ((uint32_t)0x0000FFC0)) >> 6;
    *starttxac = (localVal & ((uint32_t)0x00000018)) >> 3;
    *starttxfrmextype = (localVal & ((uint32_t)0x00000006)) >> 1;
    *starttxframeex = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_start_tx_bw_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x30000000)) >> 28);
}

static inline void blmac_start_tx_bw_setf(uint8_t starttxbw)
{
    ASSERT_ERR((((uint32_t)starttxbw << 28) & ~((uint32_t)0x30000000)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x30000000)) | ((uint32_t)starttxbw << 28));
}

static inline uint8_t blmac_start_tx_pre_type_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x08000000)) >> 27);
}

static inline void blmac_start_tx_pre_type_setf(uint8_t starttxpretype)
{
    ASSERT_ERR((((uint32_t)starttxpretype << 27) & ~((uint32_t)0x08000000)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x08000000)) | ((uint32_t)starttxpretype << 27));
}

static inline uint8_t blmac_start_tx_format_mod_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x07000000)) >> 24);
}

static inline void blmac_start_tx_format_mod_setf(uint8_t starttxformatmod)
{
    ASSERT_ERR((((uint32_t)starttxformatmod << 24) & ~((uint32_t)0x07000000)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x07000000)) | ((uint32_t)starttxformatmod << 24));
}

static inline uint8_t blmac_start_tx_mcs_index_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_start_tx_mcs_index_0_setf(uint8_t starttxmcsindex0)
{
    ASSERT_ERR((((uint32_t)starttxmcsindex0 << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)starttxmcsindex0 << 16));
}

static inline uint16_t blmac_start_tx_ksr_index_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x0000FFC0)) >> 6);
}

static inline void blmac_start_tx_ksr_index_setf(uint16_t starttxksrindex)
{
    ASSERT_ERR((((uint32_t)starttxksrindex << 6) & ~((uint32_t)0x0000FFC0)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x0000FFC0)) | ((uint32_t)starttxksrindex << 6));
}

static inline uint8_t blmac_start_tx_ac_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x00000018)) >> 3);
}

static inline void blmac_start_tx_ac_setf(uint8_t starttxac)
{
    ASSERT_ERR((((uint32_t)starttxac << 3) & ~((uint32_t)0x00000018)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x00000018)) | ((uint32_t)starttxac << 3));
}

