bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_start_tx_frm_ex_type_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x00000006)) >> 1);
}

static inline void blmac_start_tx_frm_ex_type_setf(uint8_t starttxfrmextype)
{
    ASSERT_ERR((((uint32_t)starttxfrmextype << 1) & ~((uint32_t)0x00000006)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x00000006)) | ((uint32_t)starttxfrmextype << 1));
}

static inline uint8_t blmac_start_tx_frame_ex_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_1_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_start_tx_frame_ex_setf(uint8_t starttxframeex)
{
    ASSERT_ERR((((uint32_t)starttxframeex << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_START_TX_1_ADDR, (REG_PL_RD(NXMAC_START_TX_1_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)starttxframeex << 0));
}

/**
 * @brief START_TX_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00        durControlFrm   0x0
 * </pre>
 */
#define NXMAC_START_TX_2_ADDR   0x60B00308
#define NXMAC_START_TX_2_OFFSET 0x00000308
#define NXMAC_START_TX_2_INDEX  0x000000C2
#define NXMAC_START_TX_2_RESET  0x00000000

static inline uint32_t blmac_start_tx_2_get(void)
{
    return REG_PL_RD(NXMAC_START_TX_2_ADDR);
}

static inline void blmac_start_tx_2_set(uint32_t value)
{
    REG_PL_WR(NXMAC_START_TX_2_ADDR, value);
}

// field definitions
#define NXMAC_DUR_CONTROL_FRM_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_DUR_CONTROL_FRM_LSB    0
#define NXMAC_DUR_CONTROL_FRM_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_DUR_CONTROL_FRM_RST    0x0

static inline uint16_t blmac_dur_control_frm_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_dur_control_frm_setf(uint16_t durcontrolfrm)
{
    ASSERT_ERR((((uint32_t)durcontrolfrm << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_START_TX_2_ADDR, (uint32_t)durcontrolfrm << 0);
}

/**
 * @brief START_TX_3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24      startTxSMMIndex   0x0
 *  23:16    startTxAntennaSet   0x0
 *     13          startTxLSTP   0
 *     12     startTxSmoothing   0
 *     08       startTxShortGI   0
 *  07:05           startTxNTx   0x0
 *     04     startTxFecCoding   0
 *  03:02          startTxSTBC   0x0
 *  01:00     startTxNumExtnSS   0x0
 * </pre>
 */
#define NXMAC_START_TX_3_ADDR   0x60B0030C
#define NXMAC_START_TX_3_OFFSET 0x0000030C
#define NXMAC_START_TX_3_INDEX  0x000000C3
#define NXMAC_START_TX_3_RESET  0x00000000

static inline uint32_t blmac_start_tx_3_get(void)
{
    return REG_PL_RD(NXMAC_START_TX_3_ADDR);
}

static inline void blmac_start_tx_3_set(uint32_t value)
{
    REG_PL_WR(NXMAC_START_TX_3_ADDR, value);
}

// field definitions
#define NXMAC_START_TX_SMM_INDEX_MASK     ((uint32_t)0xFF000000)
#define NXMAC_START_TX_SMM_INDEX_LSB      24
#define NXMAC_START_TX_SMM_INDEX_WIDTH    ((uint32_t)0x00000008)
#define NXMAC_START_TX_ANTENNA_SET_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_START_TX_ANTENNA_SET_LSB    16
#define NXMAC_START_TX_ANTENNA_SET_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_START_TX_LSTP_BIT           ((uint32_t)0x00002000)
#define NXMAC_START_TX_LSTP_POS           13
#define NXMAC_START_TX_SMOOTHING_BIT      ((uint32_t)0x00001000)
#define NXMAC_START_TX_SMOOTHING_POS      12
#define NXMAC_START_TX_SHORT_GI_BIT       ((uint32_t)0x00000100)
#define NXMAC_START_TX_SHORT_GI_POS       8
#define NXMAC_START_TX_N_TX_MASK          ((uint32_t)0x000000E0)
#define NXMAC_START_TX_N_TX_LSB           5
#define NXMAC_START_TX_N_TX_WIDTH         ((uint32_t)0x00000003)
#define NXMAC_START_TX_FEC_CODING_BIT     ((uint32_t)0x00000010)
#define NXMAC_START_TX_FEC_CODING_POS     4
#define NXMAC_START_TX_STBC_MASK          ((uint32_t)0x0000000C)
#define NXMAC_START_TX_STBC_LSB           2
#define NXMAC_START_TX_STBC_WIDTH         ((uint32_t)0x00000002)
#define NXMAC_START_TX_NUM_EXTN_SS_MASK   ((uint32_t)0x00000003)
#define NXMAC_START_TX_NUM_EXTN_SS_LSB    0
#define NXMAC_START_TX_NUM_EXTN_SS_WIDTH  ((uint32_t)0x00000002)

#define NXMAC_START_TX_SMM_INDEX_RST      0x0
#define NXMAC_START_TX_ANTENNA_SET_RST    0x0
#define NXMAC_START_TX_LSTP_RST           0x0
#define NXMAC_START_TX_SMOOTHING_RST      0x0
#define NXMAC_START_TX_SHORT_GI_RST       0x0
#define NXMAC_START_TX_N_TX_RST           0x0
#define NXMAC_START_TX_FEC_CODING_RST     0x0
#define NXMAC_START_TX_STBC_RST           0x0
#define NXMAC_START_TX_NUM_EXTN_SS_RST    0x0

static inline void blmac_start_tx_3_pack(uint8_t starttxsmmindex, uint8_t starttxantennaset, uint8_t starttxlstp, uint8_t starttxsmoothing, uint8_t starttxshortgi, uint8_t starttxntx, uint8_t starttxfeccoding, uint8_t starttxstbc, uint8_t starttxnumextnss)
{
    ASSERT_ERR((((uint32_t)starttxsmmindex << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)starttxantennaset << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)starttxlstp << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)starttxsmoothing << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)starttxshortgi << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)starttxntx << 5) & ~((uint32_t)0x000000E0)) == 0);
    ASSERT_ERR((((uint32_t)starttxfeccoding << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)starttxstbc << 2) & ~((uint32_t)0x0000000C)) == 0);
    ASSERT_ERR((((uint32_t)starttxnumextnss << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR,  ((uint32_t)starttxsmmindex << 24) | ((uint32_t)starttxantennaset << 16) | ((uint32_t)starttxlstp << 13) | ((uint32_t)starttxsmoothing << 12) | ((uint32_t)starttxshortgi << 8) | ((uint32_t)starttxntx << 5) | ((uint32_t)starttxfeccoding << 4) | ((uint32_t)starttxstbc << 2) | ((uint32_t)starttxnumextnss << 0));
}

static inline void blmac_start_tx_3_unpack(uint8_t* starttxsmmindex, uint8_t* starttxantennaset, uint8_t* starttxlstp, uint8_t* starttxsmoothing, uint8_t* starttxshortgi, uint8_t* starttxntx, uint8_t* starttxfeccoding, uint8_t* starttxstbc, uint8_t* starttxnumextnss)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);

