bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
    *starttxsmmindex = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *starttxantennaset = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *starttxlstp = (localVal & ((uint32_t)0x00002000)) >> 13;
    *starttxsmoothing = (localVal & ((uint32_t)0x00001000)) >> 12;
    *starttxshortgi = (localVal & ((uint32_t)0x00000100)) >> 8;
    *starttxntx = (localVal & ((uint32_t)0x000000E0)) >> 5;
    *starttxfeccoding = (localVal & ((uint32_t)0x00000010)) >> 4;
    *starttxstbc = (localVal & ((uint32_t)0x0000000C)) >> 2;
    *starttxnumextnss = (localVal & ((uint32_t)0x00000003)) >> 0;
}

static inline uint8_t blmac_start_tx_smm_index_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline void blmac_start_tx_smm_index_setf(uint8_t starttxsmmindex)
{
    ASSERT_ERR((((uint32_t)starttxsmmindex << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)starttxsmmindex << 24));
}

static inline uint8_t blmac_start_tx_antenna_set_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline void blmac_start_tx_antenna_set_setf(uint8_t starttxantennaset)
{
    ASSERT_ERR((((uint32_t)starttxantennaset << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)starttxantennaset << 16));
}

static inline uint8_t blmac_start_tx_lstp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

static inline void blmac_start_tx_lstp_setf(uint8_t starttxlstp)
{
    ASSERT_ERR((((uint32_t)starttxlstp << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)starttxlstp << 13));
}

static inline uint8_t blmac_start_tx_smoothing_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

static inline void blmac_start_tx_smoothing_setf(uint8_t starttxsmoothing)
{
    ASSERT_ERR((((uint32_t)starttxsmoothing << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)starttxsmoothing << 12));
}

static inline uint8_t blmac_start_tx_short_gi_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

static inline void blmac_start_tx_short_gi_setf(uint8_t starttxshortgi)
{
    ASSERT_ERR((((uint32_t)starttxshortgi << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)starttxshortgi << 8));
}

static inline uint8_t blmac_start_tx_n_tx_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x000000E0)) >> 5);
}

static inline void blmac_start_tx_n_tx_setf(uint8_t starttxntx)
{
    ASSERT_ERR((((uint32_t)starttxntx << 5) & ~((uint32_t)0x000000E0)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x000000E0)) | ((uint32_t)starttxntx << 5));
}

static inline uint8_t blmac_start_tx_fec_coding_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

static inline void blmac_start_tx_fec_coding_setf(uint8_t starttxfeccoding)
{
    ASSERT_ERR((((uint32_t)starttxfeccoding << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)starttxfeccoding << 4));
}

static inline uint8_t blmac_start_tx_stbc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

static inline void blmac_start_tx_stbc_setf(uint8_t starttxstbc)
{
    ASSERT_ERR((((uint32_t)starttxstbc << 2) & ~((uint32_t)0x0000000C)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x0000000C)) | ((uint32_t)starttxstbc << 2));
}

static inline uint8_t blmac_start_tx_num_extn_ss_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_START_TX_3_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

static inline void blmac_start_tx_num_extn_ss_setf(uint8_t starttxnumextnss)
{
    ASSERT_ERR((((uint32_t)starttxnumextnss << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_PL_WR(NXMAC_START_TX_3_ADDR, (REG_PL_RD(NXMAC_START_TX_3_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)starttxnumextnss << 0));
}

/**
 * @brief TX_BW_CNTRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:16       maxSupportedBW   0x2
 *  15:08         aPPDUMaxTime   0xA
 *     07              dynBWEn   0
 *  06:04   numTryBWAcquisition   0x1
 *     03        dropToLowerBW   1
 *  02:01        defaultBWTXOP   0x0
 *     00       defaultBWTXOPV   0
 * </pre>
 */
#define NXMAC_TX_BW_CNTRL_ADDR   0x60B00310
#define NXMAC_TX_BW_CNTRL_OFFSET 0x00000310
#define NXMAC_TX_BW_CNTRL_INDEX  0x000000C4
#define NXMAC_TX_BW_CNTRL_RESET  0x00020A18

static inline uint32_t blmac_tx_bw_cntrl_get(void)
{
    return REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
}

static inline void blmac_tx_bw_cntrl_set(uint32_t value)
{
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, value);
}

// field definitions
#define NXMAC_MAX_SUPPORTED_BW_MASK         ((uint32_t)0x00030000)
#define NXMAC_MAX_SUPPORTED_BW_LSB          16
#define NXMAC_MAX_SUPPORTED_BW_WIDTH        ((uint32_t)0x00000002)
#define NXMAC_A_PPDU_MAX_TIME_MASK          ((uint32_t)0x0000FF00)
#define NXMAC_A_PPDU_MAX_TIME_LSB           8
#define NXMAC_A_PPDU_MAX_TIME_WIDTH         ((uint32_t)0x00000008)
#define NXMAC_DYN_BW_EN_BIT                 ((uint32_t)0x00000080)
#define NXMAC_DYN_BW_EN_POS                 7
#define NXMAC_NUM_TRY_BW_ACQUISITION_MASK   ((uint32_t)0x00000070)
#define NXMAC_NUM_TRY_BW_ACQUISITION_LSB    4
#define NXMAC_NUM_TRY_BW_ACQUISITION_WIDTH  ((uint32_t)0x00000003)
#define NXMAC_DROP_TO_LOWER_BW_BIT          ((uint32_t)0x00000008)
#define NXMAC_DROP_TO_LOWER_BW_POS          3
#define NXMAC_DEFAULT_BWTXOP_MASK           ((uint32_t)0x00000006)
#define NXMAC_DEFAULT_BWTXOP_LSB            1
#define NXMAC_DEFAULT_BWTXOP_WIDTH          ((uint32_t)0x00000002)
#define NXMAC_DEFAULT_BWTXOPV_BIT           ((uint32_t)0x00000001)
#define NXMAC_DEFAULT_BWTXOPV_POS           0

