bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
#define NXMAC_MAX_SUPPORTED_BW_RST          0x2
#define NXMAC_A_PPDU_MAX_TIME_RST           0xA
#define NXMAC_DYN_BW_EN_RST                 0x0
#define NXMAC_NUM_TRY_BW_ACQUISITION_RST    0x1
#define NXMAC_DROP_TO_LOWER_BW_RST          0x1
#define NXMAC_DEFAULT_BWTXOP_RST            0x0
#define NXMAC_DEFAULT_BWTXOPV_RST           0x0

static inline void blmac_tx_bw_cntrl_pack(uint8_t maxsupportedbw, uint8_t appdumaxtime, uint8_t dynbwen, uint8_t numtrybwacquisition, uint8_t droptolowerbw, uint8_t defaultbwtxop, uint8_t defaultbwtxopv)
{
    ASSERT_ERR((((uint32_t)maxsupportedbw << 16) & ~((uint32_t)0x00030000)) == 0);
    ASSERT_ERR((((uint32_t)appdumaxtime << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)dynbwen << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)numtrybwacquisition << 4) & ~((uint32_t)0x00000070)) == 0);
    ASSERT_ERR((((uint32_t)droptolowerbw << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)defaultbwtxop << 1) & ~((uint32_t)0x00000006)) == 0);
    ASSERT_ERR((((uint32_t)defaultbwtxopv << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR,  ((uint32_t)maxsupportedbw << 16) | ((uint32_t)appdumaxtime << 8) | ((uint32_t)dynbwen << 7) | ((uint32_t)numtrybwacquisition << 4) | ((uint32_t)droptolowerbw << 3) | ((uint32_t)defaultbwtxop << 1) | ((uint32_t)defaultbwtxopv << 0));
}

static inline void blmac_tx_bw_cntrl_unpack(uint8_t* maxsupportedbw, uint8_t* appdumaxtime, uint8_t* dynbwen, uint8_t* numtrybwacquisition, uint8_t* droptolowerbw, uint8_t* defaultbwtxop, uint8_t* defaultbwtxopv)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);

    *maxsupportedbw = (localVal & ((uint32_t)0x00030000)) >> 16;
    *appdumaxtime = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *dynbwen = (localVal & ((uint32_t)0x00000080)) >> 7;
    *numtrybwacquisition = (localVal & ((uint32_t)0x00000070)) >> 4;
    *droptolowerbw = (localVal & ((uint32_t)0x00000008)) >> 3;
    *defaultbwtxop = (localVal & ((uint32_t)0x00000006)) >> 1;
    *defaultbwtxopv = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_max_supported_bw_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

static inline void blmac_max_supported_bw_setf(uint8_t maxsupportedbw)
{
    ASSERT_ERR((((uint32_t)maxsupportedbw << 16) & ~((uint32_t)0x00030000)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x00030000)) | ((uint32_t)maxsupportedbw << 16));
}

static inline uint8_t blmac_a_ppdu_max_time_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_a_ppdu_max_time_setf(uint8_t appdumaxtime)
{
    ASSERT_ERR((((uint32_t)appdumaxtime << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)appdumaxtime << 8));
}

static inline uint8_t blmac_dyn_bw_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

static inline void blmac_dyn_bw_en_setf(uint8_t dynbwen)
{
    ASSERT_ERR((((uint32_t)dynbwen << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)dynbwen << 7));
}

static inline uint8_t blmac_num_try_bw_acquisition_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

static inline void blmac_num_try_bw_acquisition_setf(uint8_t numtrybwacquisition)
{
    ASSERT_ERR((((uint32_t)numtrybwacquisition << 4) & ~((uint32_t)0x00000070)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x00000070)) | ((uint32_t)numtrybwacquisition << 4));
}

static inline uint8_t blmac_drop_to_lower_bw_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

static inline void blmac_drop_to_lower_bw_setf(uint8_t droptolowerbw)
{
    ASSERT_ERR((((uint32_t)droptolowerbw << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)droptolowerbw << 3));
}

static inline uint8_t blmac_default_bwtxop_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000006)) >> 1);
}

static inline void blmac_default_bwtxop_setf(uint8_t defaultbwtxop)
{
    ASSERT_ERR((((uint32_t)defaultbwtxop << 1) & ~((uint32_t)0x00000006)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x00000006)) | ((uint32_t)defaultbwtxop << 1));
}

static inline uint8_t blmac_default_bwtxopv_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_default_bwtxopv_setf(uint8_t defaultbwtxopv)
{
    ASSERT_ERR((((uint32_t)defaultbwtxopv << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_TX_BW_CNTRL_ADDR, (REG_PL_RD(NXMAC_TX_BW_CNTRL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)defaultbwtxopv << 0));
}

/**
 * @brief HTMCS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  21:16   bssBasicHTMCSSetUM   0x0
 *  15:00   bssBasicHTMCSSetEM   0xFFFF
 * </pre>
 */
#define NXMAC_HTMCS_ADDR   0x60B00314
#define NXMAC_HTMCS_OFFSET 0x00000314
#define NXMAC_HTMCS_INDEX  0x000000C5
#define NXMAC_HTMCS_RESET  0x0000FFFF

static inline uint32_t blmac_htmcs_get(void)
{
    return REG_PL_RD(NXMAC_HTMCS_ADDR);
}

static inline void blmac_htmcs_set(uint32_t value)
{
    REG_PL_WR(NXMAC_HTMCS_ADDR, value);
}

// field definitions
#define NXMAC_BSS_BASIC_HTMCS_SET_UM_MASK   ((uint32_t)0x003F0000)
#define NXMAC_BSS_BASIC_HTMCS_SET_UM_LSB    16
#define NXMAC_BSS_BASIC_HTMCS_SET_UM_WIDTH  ((uint32_t)0x00000006)
#define NXMAC_BSS_BASIC_HTMCS_SET_EM_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_BSS_BASIC_HTMCS_SET_EM_LSB    0
#define NXMAC_BSS_BASIC_HTMCS_SET_EM_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_BSS_BASIC_HTMCS_SET_UM_RST    0x0
#define NXMAC_BSS_BASIC_HTMCS_SET_EM_RST    0xFFFF

static inline void blmac_htmcs_pack(uint8_t bssbasichtmcssetum, uint16_t bssbasichtmcssetem)
{
    ASSERT_ERR((((uint32_t)bssbasichtmcssetum << 16) & ~((uint32_t)0x003F0000)) == 0);
    ASSERT_ERR((((uint32_t)bssbasichtmcssetem << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_HTMCS_ADDR,  ((uint32_t)bssbasichtmcssetum << 16) | ((uint32_t)bssbasichtmcssetem << 0));
}

static inline void blmac_htmcs_unpack(uint8_t* bssbasichtmcssetum, uint16_t* bssbasichtmcssetem)
{
    uint32_t localVal = REG_PL_RD(NXMAC_HTMCS_ADDR);

    *bssbasichtmcssetum = (localVal & ((uint32_t)0x003F0000)) >> 16;
    *bssbasichtmcssetem = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

