bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_bss_basic_htmcs_set_um_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_HTMCS_ADDR);
    return ((localVal & ((uint32_t)0x003F0000)) >> 16);
}

static inline void blmac_bss_basic_htmcs_set_um_setf(uint8_t bssbasichtmcssetum)
{
    ASSERT_ERR((((uint32_t)bssbasichtmcssetum << 16) & ~((uint32_t)0x003F0000)) == 0);
    REG_PL_WR(NXMAC_HTMCS_ADDR, (REG_PL_RD(NXMAC_HTMCS_ADDR) & ~((uint32_t)0x003F0000)) | ((uint32_t)bssbasichtmcssetum << 16));
}

static inline uint16_t blmac_bss_basic_htmcs_set_em_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_HTMCS_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

static inline void blmac_bss_basic_htmcs_set_em_setf(uint16_t bssbasichtmcssetem)
{
    ASSERT_ERR((((uint32_t)bssbasichtmcssetem << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_HTMCS_ADDR, (REG_PL_RD(NXMAC_HTMCS_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)bssbasichtmcssetem << 0));
}

/**
 * @brief VHTMCS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00    bssBasicVHTMCSSet   0xFFFF
 * </pre>
 */
#define NXMAC_VHTMCS_ADDR   0x60B0031C
#define NXMAC_VHTMCS_OFFSET 0x0000031C
#define NXMAC_VHTMCS_INDEX  0x000000C7
#define NXMAC_VHTMCS_RESET  0x0000FFFF

static inline uint32_t blmac_vhtmcs_get(void)
{
    return REG_PL_RD(NXMAC_VHTMCS_ADDR);
}

static inline void blmac_vhtmcs_set(uint32_t value)
{
    REG_PL_WR(NXMAC_VHTMCS_ADDR, value);
}

// field definitions
#define NXMAC_BSS_BASIC_VHTMCS_SET_MASK   ((uint32_t)0x0000FFFF)
#define NXMAC_BSS_BASIC_VHTMCS_SET_LSB    0
#define NXMAC_BSS_BASIC_VHTMCS_SET_WIDTH  ((uint32_t)0x00000010)

#define NXMAC_BSS_BASIC_VHTMCS_SET_RST    0xFFFF

static inline uint16_t blmac_bss_basic_vhtmcs_set_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_VHTMCS_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_bss_basic_vhtmcs_set_setf(uint16_t bssbasicvhtmcsset)
{
    ASSERT_ERR((((uint32_t)bssbasicvhtmcsset << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_PL_WR(NXMAC_VHTMCS_ADDR, (uint32_t)bssbasicvhtmcsset << 0);
}

/**
 * @brief LSTP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     00          supportLSTP   0
 * </pre>
 */
#define NXMAC_LSTP_ADDR   0x60B00320
#define NXMAC_LSTP_OFFSET 0x00000320
#define NXMAC_LSTP_INDEX  0x000000C8
#define NXMAC_LSTP_RESET  0x00000000

static inline uint32_t blmac_lstp_get(void)
{
    return REG_PL_RD(NXMAC_LSTP_ADDR);
}

static inline void blmac_lstp_set(uint32_t value)
{
    REG_PL_WR(NXMAC_LSTP_ADDR, value);
}

// field definitions
#define NXMAC_SUPPORT_LSTP_BIT    ((uint32_t)0x00000001)
#define NXMAC_SUPPORT_LSTP_POS    0

#define NXMAC_SUPPORT_LSTP_RST    0x0

static inline uint8_t blmac_support_lstp_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_LSTP_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000001)) == 0);
    return (localVal >> 0);
}

static inline void blmac_support_lstp_setf(uint8_t supportlstp)
{
    ASSERT_ERR((((uint32_t)supportlstp << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_LSTP_ADDR, (uint32_t)supportlstp << 0);
}

/**
 * @brief COEX_CONTROL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  22:16     coexWlanChanFreq   0x0
 *     12   coexWlanChanOffset   0
 *     00           coexEnable   0
 * </pre>
 */
#define NXMAC_COEX_CONTROL_ADDR   0x60B00400
#define NXMAC_COEX_CONTROL_OFFSET 0x00000400
#define NXMAC_COEX_CONTROL_INDEX  0x00000100
#define NXMAC_COEX_CONTROL_RESET  0x00000000

static inline uint32_t blmac_coex_control_get(void)
{
    return REG_PL_RD(NXMAC_COEX_CONTROL_ADDR);
}

static inline void blmac_coex_control_set(uint32_t value)
{
    REG_PL_WR(NXMAC_COEX_CONTROL_ADDR, value);
}

// field definitions
#define NXMAC_COEX_WLAN_CHAN_FREQ_MASK     ((uint32_t)0x007F0000)
#define NXMAC_COEX_WLAN_CHAN_FREQ_LSB      16
#define NXMAC_COEX_WLAN_CHAN_FREQ_WIDTH    ((uint32_t)0x00000007)
#define NXMAC_COEX_WLAN_CHAN_OFFSET_BIT    ((uint32_t)0x00001000)
#define NXMAC_COEX_WLAN_CHAN_OFFSET_POS    12
#define NXMAC_COEX_ENABLE_BIT              ((uint32_t)0x00000001)
#define NXMAC_COEX_ENABLE_POS              0

#define NXMAC_COEX_WLAN_CHAN_FREQ_RST      0x0
#define NXMAC_COEX_WLAN_CHAN_OFFSET_RST    0x0
#define NXMAC_COEX_ENABLE_RST              0x0

static inline void blmac_coex_control_pack(uint8_t coexwlanchanfreq, uint8_t coexwlanchanoffset, uint8_t coexenable)
{
    ASSERT_ERR((((uint32_t)coexwlanchanfreq << 16) & ~((uint32_t)0x007F0000)) == 0);
    ASSERT_ERR((((uint32_t)coexwlanchanoffset << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)coexenable << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_COEX_CONTROL_ADDR,  ((uint32_t)coexwlanchanfreq << 16) | ((uint32_t)coexwlanchanoffset << 12) | ((uint32_t)coexenable << 0));
}

static inline void blmac_coex_control_unpack(uint8_t* coexwlanchanfreq, uint8_t* coexwlanchanoffset, uint8_t* coexenable)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_CONTROL_ADDR);

    *coexwlanchanfreq = (localVal & ((uint32_t)0x007F0000)) >> 16;
    *coexwlanchanoffset = (localVal & ((uint32_t)0x00001000)) >> 12;
    *coexenable = (localVal & ((uint32_t)0x00000001)) >> 0;
}

static inline uint8_t blmac_coex_wlan_chan_freq_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_CONTROL_ADDR);
    return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

static inline void blmac_coex_wlan_chan_freq_setf(uint8_t coexwlanchanfreq)
{
    ASSERT_ERR((((uint32_t)coexwlanchanfreq << 16) & ~((uint32_t)0x007F0000)) == 0);
    REG_PL_WR(NXMAC_COEX_CONTROL_ADDR, (REG_PL_RD(NXMAC_COEX_CONTROL_ADDR) & ~((uint32_t)0x007F0000)) | ((uint32_t)coexwlanchanfreq << 16));
}

static inline uint8_t blmac_coex_wlan_chan_offset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_CONTROL_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

static inline void blmac_coex_wlan_chan_offset_setf(uint8_t coexwlanchanoffset)
{
    ASSERT_ERR((((uint32_t)coexwlanchanoffset << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_PL_WR(NXMAC_COEX_CONTROL_ADDR, (REG_PL_RD(NXMAC_COEX_CONTROL_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)coexwlanchanoffset << 12));
}

static inline uint8_t blmac_coex_enable_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_CONTROL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

static inline void blmac_coex_enable_setf(uint8_t coexenable)
{
    ASSERT_ERR((((uint32_t)coexenable << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_COEX_CONTROL_ADDR, (REG_PL_RD(NXMAC_COEX_CONTROL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)coexenable << 0));
}

/**
 * @brief COEX_PTI register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:28       coexPTIBcnData   0x0
 *  27:24        coexPTIBKData   0x0
 *  23:20        coexPTIBEData   0x2
 *  19:16        coexPTIVIData   0x4
 *  15:12        coexPTIVOData   0x6
 *  11:08           coexPTIMgt   0x6
 *  07:04          coexPTICntl   0x3
 *  03:00           coexPTIAck   0x7
 * </pre>
 */
#define NXMAC_COEX_PTI_ADDR   0x60B00404
#define NXMAC_COEX_PTI_OFFSET 0x00000404
#define NXMAC_COEX_PTI_INDEX  0x00000101
#define NXMAC_COEX_PTI_RESET  0x00246637

static inline uint32_t blmac_coex_pti_get(void)
{
    return REG_PL_RD(NXMAC_COEX_PTI_ADDR);
}

