bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline void blmac_coex_pti_set(uint32_t value)
{
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, value);
}

// field definitions
#define NXMAC_COEX_PTI_BCN_DATA_MASK   ((uint32_t)0xF0000000)
#define NXMAC_COEX_PTI_BCN_DATA_LSB    28
#define NXMAC_COEX_PTI_BCN_DATA_WIDTH  ((uint32_t)0x00000004)
#define NXMAC_COEX_PTIBK_DATA_MASK     ((uint32_t)0x0F000000)
#define NXMAC_COEX_PTIBK_DATA_LSB      24
#define NXMAC_COEX_PTIBK_DATA_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_COEX_PTIBE_DATA_MASK     ((uint32_t)0x00F00000)
#define NXMAC_COEX_PTIBE_DATA_LSB      20
#define NXMAC_COEX_PTIBE_DATA_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_COEX_PTIVI_DATA_MASK     ((uint32_t)0x000F0000)
#define NXMAC_COEX_PTIVI_DATA_LSB      16
#define NXMAC_COEX_PTIVI_DATA_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_COEX_PTIVO_DATA_MASK     ((uint32_t)0x0000F000)
#define NXMAC_COEX_PTIVO_DATA_LSB      12
#define NXMAC_COEX_PTIVO_DATA_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_COEX_PTI_MGT_MASK        ((uint32_t)0x00000F00)
#define NXMAC_COEX_PTI_MGT_LSB         8
#define NXMAC_COEX_PTI_MGT_WIDTH       ((uint32_t)0x00000004)
#define NXMAC_COEX_PTI_CNTL_MASK       ((uint32_t)0x000000F0)
#define NXMAC_COEX_PTI_CNTL_LSB        4
#define NXMAC_COEX_PTI_CNTL_WIDTH      ((uint32_t)0x00000004)
#define NXMAC_COEX_PTI_ACK_MASK        ((uint32_t)0x0000000F)
#define NXMAC_COEX_PTI_ACK_LSB         0
#define NXMAC_COEX_PTI_ACK_WIDTH       ((uint32_t)0x00000004)

#define NXMAC_COEX_PTI_BCN_DATA_RST    0x0
#define NXMAC_COEX_PTIBK_DATA_RST      0x0
#define NXMAC_COEX_PTIBE_DATA_RST      0x2
#define NXMAC_COEX_PTIVI_DATA_RST      0x4
#define NXMAC_COEX_PTIVO_DATA_RST      0x6
#define NXMAC_COEX_PTI_MGT_RST         0x6
#define NXMAC_COEX_PTI_CNTL_RST        0x3
#define NXMAC_COEX_PTI_ACK_RST         0x7

static inline void blmac_coex_pti_pack(uint8_t coexptibcndata, uint8_t coexptibkdata, uint8_t coexptibedata, uint8_t coexptividata, uint8_t coexptivodata, uint8_t coexptimgt, uint8_t coexpticntl, uint8_t coexptiack)
{
    ASSERT_ERR((((uint32_t)coexptibcndata << 28) & ~((uint32_t)0xF0000000)) == 0);
    ASSERT_ERR((((uint32_t)coexptibkdata << 24) & ~((uint32_t)0x0F000000)) == 0);
    ASSERT_ERR((((uint32_t)coexptibedata << 20) & ~((uint32_t)0x00F00000)) == 0);
    ASSERT_ERR((((uint32_t)coexptividata << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)coexptivodata << 12) & ~((uint32_t)0x0000F000)) == 0);
    ASSERT_ERR((((uint32_t)coexptimgt << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)coexpticntl << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)coexptiack << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR,  ((uint32_t)coexptibcndata << 28) | ((uint32_t)coexptibkdata << 24) | ((uint32_t)coexptibedata << 20) | ((uint32_t)coexptividata << 16) | ((uint32_t)coexptivodata << 12) | ((uint32_t)coexptimgt << 8) | ((uint32_t)coexpticntl << 4) | ((uint32_t)coexptiack << 0));
}

static inline void blmac_coex_pti_unpack(uint8_t* coexptibcndata, uint8_t* coexptibkdata, uint8_t* coexptibedata, uint8_t* coexptividata, uint8_t* coexptivodata, uint8_t* coexptimgt, uint8_t* coexpticntl, uint8_t* coexptiack)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);

    *coexptibcndata = (localVal & ((uint32_t)0xF0000000)) >> 28;
    *coexptibkdata = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *coexptibedata = (localVal & ((uint32_t)0x00F00000)) >> 20;
    *coexptividata = (localVal & ((uint32_t)0x000F0000)) >> 16;
    *coexptivodata = (localVal & ((uint32_t)0x0000F000)) >> 12;
    *coexptimgt = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *coexpticntl = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *coexptiack = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint8_t blmac_coex_pti_bcn_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0xF0000000)) >> 28);
}

static inline void blmac_coex_pti_bcn_data_setf(uint8_t coexptibcndata)
{
    ASSERT_ERR((((uint32_t)coexptibcndata << 28) & ~((uint32_t)0xF0000000)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0xF0000000)) | ((uint32_t)coexptibcndata << 28));
}

static inline uint8_t blmac_coex_ptibk_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

static inline void blmac_coex_ptibk_data_setf(uint8_t coexptibkdata)
{
    ASSERT_ERR((((uint32_t)coexptibkdata << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)coexptibkdata << 24));
}

static inline uint8_t blmac_coex_ptibe_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x00F00000)) >> 20);
}

static inline void blmac_coex_ptibe_data_setf(uint8_t coexptibedata)
{
    ASSERT_ERR((((uint32_t)coexptibedata << 20) & ~((uint32_t)0x00F00000)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x00F00000)) | ((uint32_t)coexptibedata << 20));
}

static inline uint8_t blmac_coex_ptivi_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

static inline void blmac_coex_ptivi_data_setf(uint8_t coexptividata)
{
    ASSERT_ERR((((uint32_t)coexptividata << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)coexptividata << 16));
}

static inline uint8_t blmac_coex_ptivo_data_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

static inline void blmac_coex_ptivo_data_setf(uint8_t coexptivodata)
{
    ASSERT_ERR((((uint32_t)coexptivodata << 12) & ~((uint32_t)0x0000F000)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x0000F000)) | ((uint32_t)coexptivodata << 12));
}

