bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
static inline uint8_t blmac_coex_pti_mgt_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline void blmac_coex_pti_mgt_setf(uint8_t coexptimgt)
{
    ASSERT_ERR((((uint32_t)coexptimgt << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)coexptimgt << 8));
}

static inline uint8_t blmac_coex_pti_cntl_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline void blmac_coex_pti_cntl_setf(uint8_t coexpticntl)
{
    ASSERT_ERR((((uint32_t)coexpticntl << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)coexpticntl << 4));
}

static inline uint8_t blmac_coex_pti_ack_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_COEX_PTI_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

static inline void blmac_coex_pti_ack_setf(uint8_t coexptiack)
{
    ASSERT_ERR((((uint32_t)coexptiack << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_PL_WR(NXMAC_COEX_PTI_ADDR, (REG_PL_RD(NXMAC_COEX_PTI_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)coexptiack << 0));
}

/**
 * @brief DEBUG_HWSM_1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24         macControlLs   0x0
 *  16:08          txControlLs   0x0
 *  04:00          rxControlLs   0x0
 * </pre>
 */
#define NXMAC_DEBUG_HWSM_1_ADDR   0x60B00500
#define NXMAC_DEBUG_HWSM_1_OFFSET 0x00000500
#define NXMAC_DEBUG_HWSM_1_INDEX  0x00000140
#define NXMAC_DEBUG_HWSM_1_RESET  0x00000000

static inline uint32_t blmac_debug_hwsm_1_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_HWSM_1_ADDR);
}

// field definitions
#define NXMAC_MAC_CONTROL_LS_MASK   ((uint32_t)0xFF000000)
#define NXMAC_MAC_CONTROL_LS_LSB    24
#define NXMAC_MAC_CONTROL_LS_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_TX_CONTROL_LS_MASK    ((uint32_t)0x0001FF00)
#define NXMAC_TX_CONTROL_LS_LSB     8
#define NXMAC_TX_CONTROL_LS_WIDTH   ((uint32_t)0x00000009)
#define NXMAC_RX_CONTROL_LS_MASK    ((uint32_t)0x0000001F)
#define NXMAC_RX_CONTROL_LS_LSB     0
#define NXMAC_RX_CONTROL_LS_WIDTH   ((uint32_t)0x00000005)

#define NXMAC_MAC_CONTROL_LS_RST    0x0
#define NXMAC_TX_CONTROL_LS_RST     0x0
#define NXMAC_RX_CONTROL_LS_RST     0x0

static inline void blmac_debug_hwsm_1_unpack(uint8_t* maccontrolls, uint16_t* txcontrolls, uint8_t* rxcontrolls)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_1_ADDR);

    *maccontrolls = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *txcontrolls = (localVal & ((uint32_t)0x0001FF00)) >> 8;
    *rxcontrolls = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

static inline uint8_t blmac_mac_control_ls_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_1_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline uint16_t blmac_tx_control_ls_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_1_ADDR);
    return ((localVal & ((uint32_t)0x0001FF00)) >> 8);
}

static inline uint8_t blmac_rx_control_ls_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_1_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

/**
 * @brief DEBUG_HWSM_2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24         macControlCs   0x0
 *  16:08          txControlCs   0x0
 *  04:00          rxControlCs   0x0
 * </pre>
 */
#define NXMAC_DEBUG_HWSM_2_ADDR   0x60B00504
#define NXMAC_DEBUG_HWSM_2_OFFSET 0x00000504
#define NXMAC_DEBUG_HWSM_2_INDEX  0x00000141
#define NXMAC_DEBUG_HWSM_2_RESET  0x00000000

static inline uint32_t blmac_debug_hwsm_2_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_HWSM_2_ADDR);
}

// field definitions
#define NXMAC_MAC_CONTROL_CS_MASK   ((uint32_t)0xFF000000)
#define NXMAC_MAC_CONTROL_CS_LSB    24
#define NXMAC_MAC_CONTROL_CS_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_TX_CONTROL_CS_MASK    ((uint32_t)0x0001FF00)
#define NXMAC_TX_CONTROL_CS_LSB     8
#define NXMAC_TX_CONTROL_CS_WIDTH   ((uint32_t)0x00000009)
#define NXMAC_RX_CONTROL_CS_MASK    ((uint32_t)0x0000001F)
#define NXMAC_RX_CONTROL_CS_LSB     0
#define NXMAC_RX_CONTROL_CS_WIDTH   ((uint32_t)0x00000005)

#define NXMAC_MAC_CONTROL_CS_RST    0x0
#define NXMAC_TX_CONTROL_CS_RST     0x0
#define NXMAC_RX_CONTROL_CS_RST     0x0

static inline void blmac_debug_hwsm_2_unpack(uint8_t* maccontrolcs, uint16_t* txcontrolcs, uint8_t* rxcontrolcs)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_2_ADDR);

    *maccontrolcs = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *txcontrolcs = (localVal & ((uint32_t)0x0001FF00)) >> 8;
    *rxcontrolcs = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

static inline uint8_t blmac_mac_control_cs_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_2_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline uint16_t blmac_tx_control_cs_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_2_ADDR);
    return ((localVal & ((uint32_t)0x0001FF00)) >> 8);
}

static inline uint8_t blmac_rx_control_cs_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_HWSM_2_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

/**
 * @brief DEBUG_PORT_VALUE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00        debugPortRead   0x0
 * </pre>
 */
#define NXMAC_DEBUG_PORT_VALUE_ADDR   0x60B0050C
#define NXMAC_DEBUG_PORT_VALUE_OFFSET 0x0000050C
#define NXMAC_DEBUG_PORT_VALUE_INDEX  0x00000143
#define NXMAC_DEBUG_PORT_VALUE_RESET  0x00000000

static inline uint32_t blmac_debug_port_value_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_PORT_VALUE_ADDR);
}

// field definitions
#define NXMAC_DEBUG_PORT_READ_MASK   ((uint32_t)0xFFFFFFFF)
#define NXMAC_DEBUG_PORT_READ_LSB    0
#define NXMAC_DEBUG_PORT_READ_WIDTH  ((uint32_t)0x00000020)

