bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
#define NXMAC_DEBUG_PORT_READ_RST    0x0

static inline uint32_t blmac_debug_port_read_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_PORT_VALUE_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

/**
 * @brief DEBUG_PORT_SEL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08        debugPortSel2   0x0
 *  07:00        debugPortSel1   0x0
 * </pre>
 */
#define NXMAC_DEBUG_PORT_SEL_ADDR   0x60B00510
#define NXMAC_DEBUG_PORT_SEL_OFFSET 0x00000510
#define NXMAC_DEBUG_PORT_SEL_INDEX  0x00000144
#define NXMAC_DEBUG_PORT_SEL_RESET  0x00000000

static inline uint32_t blmac_debug_port_sel_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_PORT_SEL_ADDR);
}

static inline void blmac_debug_port_sel_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DEBUG_PORT_SEL_ADDR, value);
}

// field definitions
#define NXMAC_DEBUG_PORT_SEL_2_MASK   ((uint32_t)0x0000FF00)
#define NXMAC_DEBUG_PORT_SEL_2_LSB    8
#define NXMAC_DEBUG_PORT_SEL_2_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_DEBUG_PORT_SEL_1_MASK   ((uint32_t)0x000000FF)
#define NXMAC_DEBUG_PORT_SEL_1_LSB    0
#define NXMAC_DEBUG_PORT_SEL_1_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_DEBUG_PORT_SEL_2_RST    0x0
#define NXMAC_DEBUG_PORT_SEL_1_RST    0x0

static inline void blmac_debug_port_sel_pack(uint8_t debugportsel2, uint8_t debugportsel1)
{
    ASSERT_ERR((((uint32_t)debugportsel2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)debugportsel1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_DEBUG_PORT_SEL_ADDR,  ((uint32_t)debugportsel2 << 8) | ((uint32_t)debugportsel1 << 0));
}

static inline void blmac_debug_port_sel_unpack(uint8_t* debugportsel2, uint8_t* debugportsel1)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_PORT_SEL_ADDR);

    *debugportsel2 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *debugportsel1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_debug_port_sel_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_PORT_SEL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline void blmac_debug_port_sel_2_setf(uint8_t debugportsel2)
{
    ASSERT_ERR((((uint32_t)debugportsel2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(NXMAC_DEBUG_PORT_SEL_ADDR, (REG_PL_RD(NXMAC_DEBUG_PORT_SEL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)debugportsel2 << 8));
}

static inline uint8_t blmac_debug_port_sel_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_PORT_SEL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

static inline void blmac_debug_port_sel_1_setf(uint8_t debugportsel1)
{
    ASSERT_ERR((((uint32_t)debugportsel1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(NXMAC_DEBUG_PORT_SEL_ADDR, (REG_PL_RD(NXMAC_DEBUG_PORT_SEL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)debugportsel1 << 0));
}

/**
 * @brief DEBUG_NAV register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:00           navCounter   0x0
 * </pre>
 */
#define NXMAC_DEBUG_NAV_ADDR   0x60B00514
#define NXMAC_DEBUG_NAV_OFFSET 0x00000514
#define NXMAC_DEBUG_NAV_INDEX  0x00000145
#define NXMAC_DEBUG_NAV_RESET  0x00000000

static inline uint32_t blmac_debug_nav_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_NAV_ADDR);
}

static inline void blmac_debug_nav_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DEBUG_NAV_ADDR, value);
}

// field definitions
#define NXMAC_NAV_COUNTER_MASK   ((uint32_t)0x03FFFFFF)
#define NXMAC_NAV_COUNTER_LSB    0
#define NXMAC_NAV_COUNTER_WIDTH  ((uint32_t)0x0000001A)

#define NXMAC_NAV_COUNTER_RST    0x0

static inline uint32_t blmac_nav_counter_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_NAV_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x03FFFFFF)) == 0);
    return (localVal >> 0);
}

static inline void blmac_nav_counter_setf(uint32_t navcounter)
{
    ASSERT_ERR((((uint32_t)navcounter << 0) & ~((uint32_t)0x03FFFFFF)) == 0);
    REG_PL_WR(NXMAC_DEBUG_NAV_ADDR, (uint32_t)navcounter << 0);
}

/**
 * @brief DEBUG_CW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:24        backoffOffset   0x0
 *  17:16             activeAC   0x0
 *  15:12           currentCW3   0x2
 *  11:08           currentCW2   0x3
 *  07:04           currentCW1   0x4
 *  03:00           currentCW0   0x4
 * </pre>
 */
#define NXMAC_DEBUG_CW_ADDR   0x60B00518
#define NXMAC_DEBUG_CW_OFFSET 0x00000518
#define NXMAC_DEBUG_CW_INDEX  0x00000146
#define NXMAC_DEBUG_CW_RESET  0x00002344

static inline uint32_t blmac_debug_cw_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
}

static inline void blmac_debug_cw_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DEBUG_CW_ADDR, value);
}

// field definitions
#define NXMAC_BACKOFF_OFFSET_MASK   ((uint32_t)0x03000000)
#define NXMAC_BACKOFF_OFFSET_LSB    24
#define NXMAC_BACKOFF_OFFSET_WIDTH  ((uint32_t)0x00000002)
#define NXMAC_ACTIVE_AC_MASK        ((uint32_t)0x00030000)
#define NXMAC_ACTIVE_AC_LSB         16
#define NXMAC_ACTIVE_AC_WIDTH       ((uint32_t)0x00000002)
#define NXMAC_CURRENT_CW_3_MASK     ((uint32_t)0x0000F000)
#define NXMAC_CURRENT_CW_3_LSB      12
#define NXMAC_CURRENT_CW_3_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_CURRENT_CW_2_MASK     ((uint32_t)0x00000F00)
#define NXMAC_CURRENT_CW_2_LSB      8
#define NXMAC_CURRENT_CW_2_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_CURRENT_CW_1_MASK     ((uint32_t)0x000000F0)
#define NXMAC_CURRENT_CW_1_LSB      4
#define NXMAC_CURRENT_CW_1_WIDTH    ((uint32_t)0x00000004)
#define NXMAC_CURRENT_CW_0_MASK     ((uint32_t)0x0000000F)
#define NXMAC_CURRENT_CW_0_LSB      0
#define NXMAC_CURRENT_CW_0_WIDTH    ((uint32_t)0x00000004)

#define NXMAC_BACKOFF_OFFSET_RST    0x0
#define NXMAC_ACTIVE_AC_RST         0x0
#define NXMAC_CURRENT_CW_3_RST      0x2
#define NXMAC_CURRENT_CW_2_RST      0x3
#define NXMAC_CURRENT_CW_1_RST      0x4
#define NXMAC_CURRENT_CW_0_RST      0x4

static inline void blmac_debug_cw_unpack(uint8_t* backoffoffset, uint8_t* activeac, uint8_t* currentcw3, uint8_t* currentcw2, uint8_t* currentcw1, uint8_t* currentcw0)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);

