bouffalolab/bl_iot_sdk/components/bl602/bl602_wifidrv/bl60x_wifi_driver/reg_mac_core.h
    *backoffoffset = (localVal & ((uint32_t)0x03000000)) >> 24;
    *activeac = (localVal & ((uint32_t)0x00030000)) >> 16;
    *currentcw3 = (localVal & ((uint32_t)0x0000F000)) >> 12;
    *currentcw2 = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *currentcw1 = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *currentcw0 = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

static inline uint8_t blmac_backoff_offset_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
    return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

static inline void blmac_backoff_offset_setf(uint8_t backoffoffset)
{
    ASSERT_ERR((((uint32_t)backoffoffset << 24) & ~((uint32_t)0x03000000)) == 0);
    REG_PL_WR(NXMAC_DEBUG_CW_ADDR, (uint32_t)backoffoffset << 24);
}

static inline uint8_t blmac_active_ac_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

static inline uint8_t blmac_current_cw_3_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
    return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

static inline uint8_t blmac_current_cw_2_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

static inline uint8_t blmac_current_cw_1_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

static inline uint8_t blmac_current_cw_0_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_CW_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

/**
 * @brief DEBUG_QSRC register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24              ac3QSRC   0x0
 *  23:16              ac2QSRC   0x0
 *  15:08              ac1QSRC   0x0
 *  07:00              ac0QSRC   0x0
 * </pre>
 */
#define NXMAC_DEBUG_QSRC_ADDR   0x60B0051C
#define NXMAC_DEBUG_QSRC_OFFSET 0x0000051C
#define NXMAC_DEBUG_QSRC_INDEX  0x00000147
#define NXMAC_DEBUG_QSRC_RESET  0x00000000

static inline uint32_t blmac_debug_qsrc_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_QSRC_ADDR);
}

// field definitions
#define NXMAC_AC_3QSRC_MASK   ((uint32_t)0xFF000000)
#define NXMAC_AC_3QSRC_LSB    24
#define NXMAC_AC_3QSRC_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_AC_2QSRC_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_AC_2QSRC_LSB    16
#define NXMAC_AC_2QSRC_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_AC_1QSRC_MASK   ((uint32_t)0x0000FF00)
#define NXMAC_AC_1QSRC_LSB    8
#define NXMAC_AC_1QSRC_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_AC_0QSRC_MASK   ((uint32_t)0x000000FF)
#define NXMAC_AC_0QSRC_LSB    0
#define NXMAC_AC_0QSRC_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_AC_3QSRC_RST    0x0
#define NXMAC_AC_2QSRC_RST    0x0
#define NXMAC_AC_1QSRC_RST    0x0
#define NXMAC_AC_0QSRC_RST    0x0

static inline void blmac_debug_qsrc_unpack(uint8_t* ac3qsrc, uint8_t* ac2qsrc, uint8_t* ac1qsrc, uint8_t* ac0qsrc)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QSRC_ADDR);

    *ac3qsrc = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *ac2qsrc = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *ac1qsrc = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *ac0qsrc = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_ac_3qsrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QSRC_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline uint8_t blmac_ac_2qsrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QSRC_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline uint8_t blmac_ac_1qsrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QSRC_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline uint8_t blmac_ac_0qsrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QSRC_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief DEBUG_QLRC register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24              ac3QLRC   0x0
 *  23:16              ac2QLRC   0x0
 *  15:08              ac1QLRC   0x0
 *  07:00              ac0QLRC   0x0
 * </pre>
 */
#define NXMAC_DEBUG_QLRC_ADDR   0x60B00520
#define NXMAC_DEBUG_QLRC_OFFSET 0x00000520
#define NXMAC_DEBUG_QLRC_INDEX  0x00000148
#define NXMAC_DEBUG_QLRC_RESET  0x00000000

static inline uint32_t blmac_debug_qlrc_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_QLRC_ADDR);
}

// field definitions
#define NXMAC_AC_3QLRC_MASK   ((uint32_t)0xFF000000)
#define NXMAC_AC_3QLRC_LSB    24
#define NXMAC_AC_3QLRC_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_AC_2QLRC_MASK   ((uint32_t)0x00FF0000)
#define NXMAC_AC_2QLRC_LSB    16
#define NXMAC_AC_2QLRC_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_AC_1QLRC_MASK   ((uint32_t)0x0000FF00)
#define NXMAC_AC_1QLRC_LSB    8
#define NXMAC_AC_1QLRC_WIDTH  ((uint32_t)0x00000008)
#define NXMAC_AC_0QLRC_MASK   ((uint32_t)0x000000FF)
#define NXMAC_AC_0QLRC_LSB    0
#define NXMAC_AC_0QLRC_WIDTH  ((uint32_t)0x00000008)

#define NXMAC_AC_3QLRC_RST    0x0
#define NXMAC_AC_2QLRC_RST    0x0
#define NXMAC_AC_1QLRC_RST    0x0
#define NXMAC_AC_0QLRC_RST    0x0

static inline void blmac_debug_qlrc_unpack(uint8_t* ac3qlrc, uint8_t* ac2qlrc, uint8_t* ac1qlrc, uint8_t* ac0qlrc)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QLRC_ADDR);

    *ac3qlrc = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *ac2qlrc = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *ac1qlrc = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *ac0qlrc = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

static inline uint8_t blmac_ac_3qlrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QLRC_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

static inline uint8_t blmac_ac_2qlrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QLRC_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

static inline uint8_t blmac_ac_1qlrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QLRC_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

static inline uint8_t blmac_ac_0qlrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_QLRC_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief DEBUG_PHY register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     00   rxReqForceDeassertion   0
 * </pre>
 */
#define NXMAC_DEBUG_PHY_ADDR   0x60B0055C
#define NXMAC_DEBUG_PHY_OFFSET 0x0000055C
#define NXMAC_DEBUG_PHY_INDEX  0x00000157
#define NXMAC_DEBUG_PHY_RESET  0x00000000

static inline uint32_t blmac_debug_phy_get(void)
{
    return REG_PL_RD(NXMAC_DEBUG_PHY_ADDR);
}

static inline void blmac_debug_phy_set(uint32_t value)
{
    REG_PL_WR(NXMAC_DEBUG_PHY_ADDR, value);
}

// field definitions
#define NXMAC_RX_REQ_FORCE_DEASSERTION_BIT    ((uint32_t)0x00000001)
#define NXMAC_RX_REQ_FORCE_DEASSERTION_POS    0

#define NXMAC_RX_REQ_FORCE_DEASSERTION_RST    0x0

static inline uint8_t blmac_rx_req_force_deassertion_getf(void)
{
    uint32_t localVal = REG_PL_RD(NXMAC_DEBUG_PHY_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000001)) == 0);
    return (localVal >> 0);
}

static inline void blmac_rx_req_force_deassertion_setf(uint8_t rxreqforcedeassertion)
{
    ASSERT_ERR((((uint32_t)rxreqforcedeassertion << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(NXMAC_DEBUG_PHY_ADDR, (uint32_t)rxreqforcedeassertion << 0);
}


#endif // _REG_MAC_CORE_H_

